[
    {
        "url": "https://medium.com/@konpat/%E0%B8%87%E0%B8%B2%E0%B8%99%E0%B9%84%E0%B8%AB%E0%B8%99%E0%B8%9A%E0%B9%89%E0%B8%B2%E0%B8%87%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B8%A1%E0%B8%B5%E0%B9%82%E0%B8%AD%E0%B8%81%E0%B8%B2%E0%B8%AA%E0%B8%96%E0%B8%B9%E0%B8%81%E0%B8%97%E0%B8%94%E0%B9%81%E0%B8%97%E0%B8%99%E0%B8%94%E0%B9%89%E0%B8%A7%E0%B8%A2%E0%B8%A3%E0%B8%B0%E0%B8%9A%E0%B8%9A%E0%B8%AD%E0%B8%B1%E0%B8%95%E0%B9%82%E0%B8%99%E0%B8%A1%E0%B8%B1%E0%B8%95%E0%B8%B4-ad3172b4c847?source=user_profile---------1----------------",
        "title": "งานไหนบ้างที่มีโอกาสถูกทดแทนด้วยระบบอัตโนมัติ? – Konpat Ta Preechakul –",
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out."
    },
    {
        "url": "https://medium.com/@konpat/%E0%B8%A7%E0%B8%A5%E0%B8%B5-%E0%B8%97%E0%B8%B8%E0%B8%81%E0%B8%97%E0%B9%88%E0%B8%B2%E0%B8%99%E0%B8%A5%E0%B8%AD%E0%B8%87%E0%B8%AB%E0%B8%A5%E0%B8%B1%E0%B8%9A%E0%B8%95%E0%B8%B2%E0%B9%81%E0%B8%A5%E0%B9%89%E0%B8%A7%E0%B8%99%E0%B8%B6%E0%B8%81%E0%B8%A0%E0%B8%B2%E0%B8%9E%E0%B8%94%E0%B8%B9%E0%B8%A7%E0%B9%88%E0%B8%B2-%E0%B8%82%E0%B8%AD%E0%B8%87-%E0%B8%94%E0%B8%A3-%E0%B8%AA%E0%B8%A1%E0%B8%84%E0%B8%B4%E0%B8%94-%E0%B8%88%E0%B8%B2%E0%B8%95%E0%B8%B8%E0%B8%A8%E0%B8%A3%E0%B8%B5%E0%B8%9E%E0%B8%B4%E0%B8%97%E0%B8%B1%E0%B8%81%E0%B8%A9%E0%B9%8C-59e6610b037e?source=user_profile---------2----------------",
        "title": "“ทุกท่านลองหลับตาแล้วนึกภาพดูว่า …” ภาพในฝันของ ดร.สมคิด จาตุศรีพิทักษ์",
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out."
    },
    {
        "url": "https://medium.com/@konpat/using-git-bash-in-jupyter-noteobok-on-windows-c88d2c3c7b07?source=user_profile---------3----------------",
        "title": "Using git bash in jupyter noteobok on Windows – Konpat Ta Preechakul –",
        "text": "Since https://github.com/jupyter/notebook/pull/3087 (notebook version 5.3.0), there is a support for terminal on Windows!\n\nSo if you have notebook version 5.3.0 or better installed (check by ), you can new “terminal” in your menu!\n\nThe default shell is “powershell.exe”, but you can change it in\n\nThe following is a config to use Git Bash:\n\nRestart your notebook and see the change!"
    },
    {
        "url": "https://medium.com/@konpat/2d-convolution-layer-without-conv2d-in-keras-8da47cd73e4e?source=user_profile---------4----------------",
        "title": "2D Convolution Layer without Conv2D (in Keras) – Konpat Ta Preechakul –",
        "text": "Disclaimer: practically, you would not want to use this, since you have a perfect Conv2D for this job. But, out of curiosity, I just want to try to implement one without its help. This is just an exercise.\n\nFirst, you can create your own layer in Keras quite simply, here is the boilerplate for that, see https://keras.io/layers/writing-your-own-keras-layers/:\n\nNow, I want to describe how I tackle the problem (creating Conv2D layer). I hope there is a more elegant way to do this … but this is the best to my knowledge (please suggest).\n\nNeedless to say that the implementation is super slower my feeling is like 5 times or more slower than the conventional ."
    },
    {
        "url": "https://medium.com/@konpat/squeeze-and-excitation-networks-hu-et-al-2017-48e691d3fe5e?source=user_profile---------5----------------",
        "title": "Squeeze and Excitation Networks (Hu et al., 2017) – Konpat Ta Preechakul –",
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out."
    },
    {
        "url": "https://medium.com/@konpat/striving-for-simplicity-the-all-convolutional-net-springenberg-et-al-2014-85da395be338?source=user_profile---------6----------------",
        "title": "Striving for Simplicity: The All Convolutional Net (Springenberg et al., 2014)",
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out."
    },
    {
        "url": "https://medium.com/@konpat/network-in-network-lin-et-al-2013-73e562c6c7d7?source=user_profile---------7----------------",
        "title": "Network in Network (Lin et al., 2013) – Konpat Ta Preechakul –",
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out."
    },
    {
        "url": "https://medium.com/@konpat/how-to-host-a-counter-strike-1-6-game-on-linux-full-tutorial-a25f20ff1149?source=user_profile---------8----------------",
        "title": "How to host a Counter Strike 1.6 Game on Linux — Full Tutorial",
        "text": "You will need a Linux sever with internet connection. Actually, you can host on local network and it should be very much the same.\n\nHere, any Linux distribution should do but I have done it on Ubuntu 16.04 LTS.\n\nLet me briefly introduce you to LinuxGSM (https://gameservermanagers.com/) , stands for Linux game server manager, this makes hosting a game on Linux really a piece of cake.\n\nThey seem to have solutions for many games, so if you think of hosting any other you might want to check out this first. But for now, we’re focused on Counter Strike 1.6 server.\n\nSo, we’ll go https://gameservermanagers.com/lgsm/csserver/. You can simply follow the instructions there, but I will take it here anyway:\n\nYou might want to add another user for this purpose. Anyways, I should work fine without.\n\nThen install, it will take sometime:\n\nSo, this is the first command “install”, and “csssever” here is like a control panel for the server. In fact, to “start”, “restart”, or “stop” are done through this script.\n\nNow your directory structure should look like:\n\nUnfortunately, there is a good chance that you are not done yet. The server application downloaded from steam is likely not to be complete. There is a fix to that, https://github.com/dgibbs64/HLDS-appmanifest.\n\nIn short, you will need to put these commands when you are at directory:\n\nAnd then, retry your again. This time it should do.\n\nYou should now have the server installed. You might want to start the server\n\nIf you want to see the console output from the server you can use , beware that you must not quit it with , there is a very specific way to quit which is (If you recall this is a tmux shortcut for detaching the current session).\n\nYou can stop or restart it with .\n\nOf course you will not stop here you will need to configure your server.\n\nFirst place to see such customization files is . You will see , , .\n\n_default.cfg is of course default settings you can open an see what are possible configurations so that you can override it somewhere else. You must not edit this file because it is auto-generated and will be overridden.\n\ncommon.cfg is a configuration file that is shared across multiple servers.\n\ncsserver.cfg (“csserver” is the name of this instance, the name is shared with “./csserver” file) is an instance specific configuration.\n\nNow, it is up to you to edit which file. Whichever the file is let’s say that we want to set the listening port of this server, the listening IP address, and lastly the default map of this server.\n\nHere the port 27015 is the default port for Counter Striker servers, but you can go whatever you like. A good policy to use ports is to make sure you start with 27015 and then increase it by one and so on. Note that you need all port, sourcetvport, and clientport for each instance.\n\nYou can read the full documentation here https://github.com/GameServerManagers/LinuxGSM/wiki/Multiple-Game-Servers,\n\nBut, one easy way to do it is called “single source multiple instances”. Basically, you duplicate the file and rename it to something like . Now, you can create a new configuration file at , put everything you want this instance to be, and save.\n\nNow, run . You now have the new server already! Be advised that it shares the core data with the first one, only configurations change.\n\nWhat you can configure the file is quite limited. If you want to configure game specific settings, you have to put it to .\n\nHere is what I usually put there:\n\nIf you want to control what happens in the game (in real-time), like restart a round, change level (map). These must be done via a console, but you need a way to authenticate you as an admin. That way is RCON. All you need to do is configure the RCON password in your server (shown above), and then use that password to connect and now you can give your sedrver commands.\n\nA tool that I find useful to manage server is HLSW, http://www.hlsw.org/hlsw/download/. You just need to add your server to the list, put your RCON password, and then you can put commands to the console panel as an admin of that server.\n\nHere is a list of things you can do with RCON commands http://txdv.github.io/cstrike-cvarlist/."
    },
    {
        "url": "https://medium.com/@konpat/%E0%B8%9E%E0%B8%B4%E0%B8%8A%E0%B8%B1%E0%B8%A2%E0%B8%AA%E0%B8%87%E0%B8%84%E0%B8%A3%E0%B8%B2%E0%B8%A1%E0%B8%8B%E0%B8%B8%E0%B8%99%E0%B8%A7%E0%B8%B9-%E0%B9%82%E0%B8%94%E0%B8%A2%E0%B8%AA%E0%B8%A3%E0%B8%B8%E0%B8%9B-%E0%B9%84%E0%B8%9B%E0%B8%AB%E0%B8%99%E0%B9%88%E0%B8%AD%E0%B8%A2-c988dd013bac?source=user_profile---------9----------------",
        "title": "พิชัยสงครามซุนวู โดยสรุป … ไปหน่อย – Konpat Ta Preechakul –",
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out."
    },
    {
        "url": "https://medium.com/@konpat/%E0%B9%83%E0%B8%84%E0%B8%A3%E0%B8%A7%E0%B9%88%E0%B8%B2-python-%E0%B8%8A%E0%B9%89%E0%B8%B2-%E0%B8%96%E0%B9%89%E0%B8%B2%E0%B9%80%E0%B8%A3%E0%B8%B2%E0%B8%A3%E0%B8%B9%E0%B9%89%E0%B8%88%E0%B8%B1%E0%B8%81%E0%B9%80%E0%B8%82%E0%B8%B5%E0%B8%A2%E0%B8%99-cython-bb3529194a6?source=user_profile---------10----------------",
        "title": "ใครว่า Python ช้า … ถ้าเรารู้จักเขียน Cython – Konpat Ta Preechakul –",
        "text": "คำว่าช้าในที่นี้ จะหมายถึงช้ากว่าภาษาอย่าง C หรือ C++ อันที่จริงเกือบทุกภาษาที่เราเคยมีมาทั้งหมด … ช้ากว่า C แต่ในที่นี้ผมจะพยายามอธิบายว่าทำไม Python ถึงเป็นหนึ่งในภาษานั้นที่ช้ากว่า C\n\nเพราะว่าด้วยเหตุผลที่กล่าวไปข้างต้น ไม่ว่าจะเขียนอย่างไร Python ก็ไม่มีโอกาสที่จะเร็วได้มากกว่า C ดังนั้นงานที่ต้องการความเร็วจริง ๆ Python ก็เปิดโอกาสให้เขียนด้วย C แทน ซึ่งนั่นก็แปลว่า Python จะต้องรักษาการติดต่อระหว่าง C — Python ให้ทำงานได้รวดเร็วและมีข้อจำกัดน้อยที่สุด\n\nเห้ย ! นี่มันคล้าย ๆ ลูกครึ่ง C — Python นี่นา … ก็ใช่แล้วเพราะว่าสิ่งที่ Cython ทำ คือพยายามอ่านโค้ดเราแล้ว “แปลง” เป็นโค้ดภาษา C แล้วค่อย compile ด้วย compiler ภาษา C เพื่อจะได้โค้ดที่มีประสิทธิภาพดีขึ้น (เร็วราวกับเขียนด้วยภาษา C เลยล่ะ !) และยิ่งเราใช้ syntax เฉพาะทางของ Cython มากขึ้นเท่าไหร่ Cython ก็ยิ่งแปลงโค้ดได้ดีขึ้นเท่านั้น"
    },
    {
        "url": "https://medium.com/o-v-e-r-f-i-t-t-e-d/%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B8%88%E0%B8%B1%E0%B8%94%E0%B8%81%E0%B8%A5%E0%B8%B8%E0%B9%88%E0%B8%A1%E0%B8%82%E0%B9%89%E0%B8%AD%E0%B8%A1%E0%B8%B9%E0%B8%A5%E0%B8%AA%E0%B8%B2%E0%B8%A2-rna-%E0%B9%82%E0%B8%94%E0%B8%A2%E0%B9%84%E0%B8%A1%E0%B9%88%E0%B8%95%E0%B9%89%E0%B8%AD%E0%B8%87%E0%B8%97%E0%B8%B3-alignment-%E0%B9%81%E0%B8%A5%E0%B8%B0-folding-abc05af3fe42?source=user_profile---------11----------------",
        "title": "การจัดกลุ่มข้อมูลสาย RNA โดยไม่ต้องทำ Alignment และ Folding",
        "text": "พื้นฐานของวิธีในที่นี้มาจากผลงานที่ชื่อว่า NoFold: RNA structure clustering without folding or alignment (Kim and Middleton, 2014) ซึ่งได้อธิบายวิธีการจัดกลุ่มข้อมูล RNA โดยไม่ต้องทำ alignment และ folding ในบนความนี้ผู้เขียนได้เลือกเอาเฉพาะส่วนที่เป็นพื้นฐานของวิธีนี้ โดยไม่ได้ให้ความสำคัญกับรายละเอียดยิบย่อยมากนัก\n\nอ่านเพิ่มเติมได้จาก Zuker, Michael, and David Sankoff. “RNA secondary structures and their prediction.” Bulletin of mathematical biology 46.4 (1984): 591–621.\n\nสามารถอ่านเพิ่มเติม graph kernel ได้ที่ Costa, Fabrizio, and Kurt De Grave. “Fast neighborhood subgraph pairwise distance kernel.” Proceedings of the 26th International Conference on Machine Learning. Omnipress, 2010.\n\nทั้งวิธี alignment และ folding สามารถถูกใช้งานร่วมกันได้เพื่อให้ได้คำตอบที่ดียิ่งขึ้นไปอีกได้ โดยวิธีการนึงที่ใช้หลักการนี้ชื่อ LocARNA อ่านเพิ่มเติมได้จาก Will, Sebastian, et al. “Inferring noncoding RNA families and classes by means of genome-scale structure-based clustering.” PLoS Comput Biol 3.4 (2007): e65."
    },
    {
        "url": "https://medium.com/@konpat/install-node-js-and-babel-using-nvm-and-homebrew-782115d32900?source=user_profile---------12----------------",
        "title": "Install Node.js and Babel (using NVM and Homebrew) – Konpat Ta Preechakul –",
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out."
    },
    {
        "url": "https://medium.com/o-v-e-r-f-i-t-t-e-d/%E0%B9%81%E0%B8%A2%E0%B8%81%E0%B8%A0%E0%B8%B2%E0%B8%9E%E0%B8%88%E0%B8%B2%E0%B8%81%E0%B9%82%E0%B8%97%E0%B8%99%E0%B8%AA%E0%B8%B5%E0%B8%94%E0%B9%89%E0%B8%A7%E0%B8%A2-time-series-mining-9d348e7e051b?source=user_profile---------13----------------",
        "title": "แยกภาพจากโทนสีด้วย Time Series Mining – O v e r f i t t e d –",
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out."
    },
    {
        "url": "https://medium.com/o-v-e-r-f-i-t-t-e-d/%E0%B8%A7%E0%B9%88%E0%B8%B2%E0%B8%94%E0%B9%89%E0%B8%A7%E0%B8%A2%E0%B9%80%E0%B8%A3%E0%B8%B7%E0%B9%88%E0%B8%AD%E0%B8%87%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B8%A7%E0%B8%B1%E0%B8%94%E0%B8%9B%E0%B8%A3%E0%B8%B0%E0%B8%AA%E0%B8%B4%E0%B8%97%E0%B8%98%E0%B8%B4%E0%B8%A0%E0%B8%B2%E0%B8%9E-49c81cd3316?source=user_profile---------14----------------",
        "title": "ว่าด้วยเรื่องการวัดประสิทธิภาพ – O v e r f i t t e d –",
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out."
    },
    {
        "url": "https://medium.com/o-v-e-r-f-i-t-t-e-d/scratching-the-surface-of-semi-supervised-learning-a0281de79535?source=user_profile---------15----------------",
        "title": "Scratching The Surface of Semi-supervised Learning – O v e r f i t t e d –",
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out."
    },
    {
        "url": "https://medium.com/o-v-e-r-f-i-t-t-e-d/%E0%B9%80%E0%B8%A3%E0%B8%B4%E0%B9%88%E0%B8%A1%E0%B8%95%E0%B9%89%E0%B8%99%E0%B8%81%E0%B8%B1%E0%B8%9A-reinforcement-learning-%E0%B9%81%E0%B8%A5%E0%B8%B0%E0%B8%95%E0%B8%B1%E0%B8%A7%E0%B8%AD%E0%B8%A2%E0%B9%88%E0%B8%B2%E0%B8%87%E0%B8%9E%E0%B8%B7%E0%B9%89%E0%B8%99-%E0%B9%86-b6a9a1167820?source=user_profile---------16----------------",
        "title": "Reinforcement Learning – O v e r f i t t e d –",
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out."
    }
]