[
    {
        "url": "https://medium.com/@BusinessFlair/is-it-possible-to-completely-transform-our-thinking-cd845a701f32?source=tag_archive---------0----------------", 
        "text": "Is it possible to think on a different level? Is it possible to transform the way we think? Is it possible to transcend the depth of our thinking? Is it possible to have a different way of living? Is it possible that we all have an extraordinary hidden potential that we are unaware of? Is it possible that we are all just too blind to see it? Is it true that we don’t question things anymore? Is it true that we are not fully utilising our curiosity? Why are some people more creative than others? How has their mind development differed to those less creative? What is creativity? Is it possible that we are not utilising all of our brain’s potential? Of course it is, the average human being only uses around 12–13 per cent of their brains capacity and capability. So why are some people able to use more than others? How does the thinking of all the great scientists such as Einstein differ from everyone else? Do they think the same as us? Do we have the ability to think that way too? Does wonder, curiosity and imagination have an inextricable link? Why do we have these capacities? What’s their purpose? Please ask these questions seriously and continue reading! Read with an open mind.\n\nSo what is thinking? Thinking is made up of a series of thoughts. What is a thought? A thought is a child of our memory. A thought can stem from the past, present or the future. It can rise internally or externally. It can be positive or negative. It can be good or bad. It can be intentional or unintentional. It can be timely or untimely. If you are in a park and thinking about the past or the future instead of enjoying, acknowledging and appreciating the beauty around you, that’s an untimely thought. The truth is we do not have control over our minds, over our thoughts. We are prisoners to our own incessant thinking. We have become the mind. The mind is just a tool at our disposal and just like any other tool, you can either use it in a good way or a bad way, the right way or the wrong way. You can use a match to light the stove and cook some food to feed your family or you can use it to burn your house. Which one are you going to chose? It’s a tool that needs to be used when needed.\n\nI will write another blog about how it is possible to control the mind.\n\nBack to the point about thought. Whatever we hear, whatever we see, whatever we taste and feel, we use our memories to find meaning for them. Our memories are from the past, our knowledge is limited. Knowledge is always limited. It’s just the truth that is complete. The knowledge and memories build up from all our experiences, from what we have seen, listened to, read, heard and thought about. In our knowledge and memories, we build our beliefs, theories, views, perspectives and ideals. These then programme and condition the mind to think in a certain way. These have been built up by the society that advocates those things, religion and other things such as the limitations of language. The better your language, the more you will understand, the more meaning you will find, the better you will be able to express the deeper you will be able to think. The cycle goes round and round.\n\nWhen something is conditioned, it is limited in terms of what it is capable of doing. If you programme a piece of technology to do a certain thing, it will be limited what it has been programmed to do and what the programmer is capable of doing. As the programmer’s capability increases, so does the technology they have programmed.\n\nIt’s the same with the mind; it has been conditioned to think in a certain limited way, being influenced by the past and our limited knowledge. It’s not able to live to its full potential.\n\nFull potential of the brain is the essence of intelligence where there is pure observation with the absent of thought and hence pure perception. You have pure insight. Insight is something that happens beyond all thought and memory and experience. It’s seeing the truth of things instantly.\n\nIn this state, the knowledge is no longer needed. It this state, you are fully aware, fully attentive, fully alert, fully present in the moment, fully awake and hence purely observing. There is no thought because thought is from the past and so it will distort you from seeing things, as they are, not as what you are capable of based on what you have seen in the past. You are in a state of full present moment awareness. The psychological time just disappears and there is just the ‘now’, the present moment in which all time exists. Observation without thought means that the mind disappears too. The mind is then on standby, when the mind is on standby, it is still in the game. It is completely aware of the world right along with you. It will be better positioned to serve you. More about this on a different blog.\n\nThe Buddha once said, ‘don’t dwell in the future, don’t dream of the future, live in the moment.’ The moment we deviate away from the present moment is the moment we either start to think about the past or the future. If we are feeling sad or angry or feel depressed, we are living in and thinking of the past and letting it affect our present moment. If we are anxious and worried, you are living in the future and you are letting the future influence your present moment. The past is gone, its just memories; the future is anticipation and uncertainty and hasn’t yet arrived. The present moment is awareness. You are just a bundle of awareness. You are sensing, feeling, learning and understanding. Therefore, time is just a movement of thought. The future and past are both in the imagination which is happening in the ‘now’, the present moment. The present moment awareness is all we have, the future is never going to come as the future, it will come as this moment. If you are going to think about the future or past, there is a time and place for everything, not when you are with friends, not when you are in a park or at 3am in the morning. I hope you can start to realise how little control we have over our minds.\n\nSo is it possible to get rid of psychological time and all the feelings attached to it? Is it beneficial to do so?\n\nThe more present in the moment you are, the more aware and alert you are, the more awake and hence observant you are, the more you are able to have a better perception and so the more you are likely to make the best decisions that yield the highest value. We are making decisions all the time in every moment. You are making a decision to read this post, you have made a decision to stare at the screen, you made a decision to read this post. The list of decisions are limitless. Some are small, some are big, some are right, some are wrong, some are important, some are unimportant, some are conscious, some are unconscious, some stem from love, some stem from fear.\n\nWe are just a bundle or chain of decisions and choices. For every choice we say ‘yes’, there is creation and for every ‘no’ there is an opportunity missed and no creation and hence no utility. You are as you are right now because of all your choices.\n\nWhen you are completely living in the moment, psychological time just disappears and hence knowledge. When knowledge disappears, when the past disappears, so does the ego, the self! You realise your true essence, you are fully awake. You are enlightened. When there is no self, its just pure empathy and compassion and unconditional love for everything, because you sense the aliveness and see the beauty in everything. Beauty and love are inextricably linked.\n\nOnce we know and realise this whole mechanical process that’s happening in our minds and see it holistically, it just expands your curiosity and transcends your though and thinking beyond a certain level, beyond its limitations and break free of the conditioning. You get a taste of what you are capable of doing. You start to see everything holistically and analyse it deeply, think deeply and clearly. You start to have control over your mind and your thought and your are able to maintain concentration and focus and take that thought deeper and deeper and move from the known into the unknown. Deep thinking is the most powerful thing we can learn to master. But we must realise that the truth is seen without the mind. Knowledge stems from the mind. Wisdom stems from no mind. It’s the truth. Truth and reality can just be observed without the interference of thought, not seen with the eyes of the past. Truth is only in the present moment.\n\nOne thing you immediately realise is what is currently happening in the world. You see all the suffering, not just externally, but internally too. If we are sad, angry or depressed, that is suffering too. You realise the trivial things that we are doing and caught up on. You understand we are all one and the same! We have the same consciousness with same content. We all have happiness, love, hatred, compassion, sorrow, curiosity, passion, anxieties, empathy etc. These all make up who we are. What we get our happiness from may differ, but we have happiness, what we are fearful of may differ but we have fear! We act and work in the same way, each lost in our own little journeys, navigating around using our limited intelligence, trying to adapt and do what society expects us to do. We all have our own pains and sorrows, trials and tribulations, think the same way, act the same way, express in the same way, laugh in the same way, cry in the same way. Deep down, we are all exactly the same. If you want to really understand people, just earnestly observe yourself. Observe every thought, every emotion, every action and your behaviour in every situation. Self knowledge is the start of wisdom.\n\nEverything we do is the same. We are the book of life. We are humanity. We are all one. ‘That’s what the true essence of every religion is. Oneness! Union! Love! “Love your neighbour as you love yourself” “Killing one human being is like killing humanity.” ‘Know yourself’. They are all portraying the same message. The message has been so distorted by the limitations of communication and ignorance. The true essence of religion and wisdom behind it has been lost.\n\nWe all have the exact same consciousness. The moment we separate ourselves from that and say I am English, you are French, I am a Muslim you are a Christian, I am White, you are Black, instead of thinking we are all human beings, is the moment there is a division. Where there is a division, there is bound to be conflict. When there is conflict, there is bound to be competition, when there is competition, there are winners and losers. There is happiness and sadness. There is joy and sorrow. There is greed. There is jealousy, which is the root of most of our unhappiness and conflicts. But deep down, there isn’t a true sense of pure fulfillment. The whole world is in competition and everyone is in competition with themselves or others. You can sense how much of a terrible situation we are in and how long it will take to achieve Oneness. The essence of Religion is needed more now than ever before. We are not independent. We are interdependent. When you see things holistically, you see how stupid and trivial things like racism, inequality and war is. We just don’t know ourselves well and so we don’t value and appreciate life as much as we should do. Once we deep down know who we really are and how beautiful we are, how sensitive we can be just by observing ourselves, we will never hurt anyone ever again. That’s when you truly realise your responsibility in society. Imagine a world full of unconditional love for every human being. It will remove every single problem in the world.\n\nI don’t need to tell you about all the conflicts, suffering and torment that is happening around us. There was a time when killing was just killing. Now we have convinced others to kill in order to secure peace. Do we have to be sad to know what happiness is? Do we have to hate to know what love is? Do we have to drink to know what being sober is like? Then why do we think causing suffering will bring peace? Any killing results in accumulation of further hatred, further resentment, further misery and the more we kill, the more the misery. Einstein said ‘Peace cannot be kept by force, it can only be kept by understanding’. How is what we are doing differ from what he is saying? Think about it.\n\nThe media now communicates all the resentment, suffering and sorrow to everyone else. Feelings are highly contagious. Some people catch it more than others depending on how emotional, sensitive and empathetic they are. A lot of people are just ignorant\n\nI hope you see the duality. The only way to remove hatred is through love, the only way to remove ignorance is though awareness, the only way to reduce selfishness is though increasing empathy. It’s a universal rule. Yin Yang.\n\nMoving back to the point. If you think deeply and observe clearly, our minds are not really our minds, there are not personal at all. They belong to the society we live in. You are a contributor to its development when you think for yourself just as much as all other individuals you have seen, heard, learnt about and admired. Communication enables us to understand and learn from each other, exchange with each other, the way we think, the way we feel. We then develop our perspectives, ideals etc. based on other people’s ideals and perspectives and the way they see life. Some of us then become more externally orientated and others who are less internally orientated and have been thinking more themselves, contributed to the development of their mind themselves. Most of our beliefs and understanding stems from others. The rest of our beliefs and understanding comes from our own thinking. I hope you can see and understand this. There comes a point when we don’t have beliefs. Beliefs are just a cover for confusion, not knowing the absolute truth. When we are fully aware and alert and completely observant with pure perception, we see the totality and the truth, there is no confusion.\n\nAll the media on TV, Internet and especially social networks have made it easy to see, observe and learn other people’s cultures and their way of thinking, their way of feeling. That’s why cultures are being transformed and merging. Our habits and tastes are becoming similar. Our preferences are becoming similar. Our thinking and feelings toward the same things are becoming similar. The whole world is influencing each other like never before. It’s fascinating.\n\nCurrently, what we are doing most of the time is moving from the known to the known, accumulating knowledge and trying to understand what others have identified and discovered. We rarely think deeply enough ourselves to move from the known to the unknown. We have the capability, but we aren’t aware and so we can’t. We have so many distractions (other thoughts each fighting for concentration. There is a constant David and Goliath battle between concentration and Distraction. Observe yourself) preventing us from maintaining concentration on one thought and thinking deeply. We think superficially as a result. We have the potential to do this, but we just don’t realise we have it and are limited by our knowledge to understand this. When you let wonder and curiosity do it’s magic, you will reach new fields beyond what you already know. Even Einstein said something along the lines of ‘I am nobody special, I am just passionately curious’ or ‘Don’t lose the holy curiosity’. It’s this curiosity and constant probing and questioning that enables us to think deeper and deeper and look closer and closer. That’s why Einstein was able to think of his amazing equations. I seriously don’t think he had a special brain, his curiosity just developed his imagination and he was able to think deeply and clearly and he had the beautiful mathematical language to prove what he was discovering.\n\nThe fact is that we are all wise learning individuals. We have the possibility and opportunity to learn every moment. The question is, are we learning things that are valuable? We have capacity to see and act, the wisdom to impact, the ability to learn and interact, the awareness to react and the beauty to admire and attract. We have sight, we have sensation, we have love, empathy and a beautiful imagination. We are full of beautiful capacities unlike any other species. The difference between us and them is that we have the potential to create utility and have ability to reason and think. With this incredible intelligence we have at our disposal and the rich resources, we have the capacity to create heaven on earth. We are the guardians of this planet. We have the potential to transcend our thoughts beyond what we have considered satisfactory in the past. I know how it can be done, I have learned the system and it’s incredibly enlightening, but that is not something that can be written about, it needs to be communicated face to face and then sensed, realised and experienced. Writing is limited and opens room for misinterpretation, miscommunication and as a result misunderstanding. I can’t emphasize enough how much our communication can be improved. What are the qualities of the perfect communicator? Can you think deeply enough to identify them?\n\nI have been able to thinking deeply for a few months now and it’s incredibly empowering and enlightening. Just being able to observe clearly is incredibly empowering and thought provoking and fun. You are able to see more, hear more, taste more, sense more and feel more. Love others more! Imagine being able to take any matter whether it’s business or anything else that one step deeper, one step further, one stem closer. Every system created by humans, every industry, every business are trying to be better, are becoming better and moving towards a better version. As our abilities increase, as our knowledge increased, as our awareness increases, we understand more, we are able to apply more and do more and the chain goes round and round. Just look at the transformation of technology like your phones. What has changed in the last 10 years? The reason where it is now is because we have thought deeper and deeper into finding how these new technologies could look, should function like and should do. We have gone deeper and still going. You can see the rate of development changing for some companies where their ability to think deeper changes. The rate of innovation at Apple is one example. It’s not constant.\n\nApple and Google hire the best people. Who are they? They are just more intelligent, meaning they are more aware, alert, have better control over their thought and are able to maintain their concentration on a thought and are able to take it deeper and deeper. They are just deep thinkers who have thought the deepest in their fields or have the potential to think deeply about their field. That’s why some companies like apple have been doing well. They have a lot of people that are constantly able to think deeply, creatively and innovate through better observation and perception. It all started with two deep thinkers. One who had great creativity and ability to think creatively and deeply, the other who has a more logical mind with deeper quality to programme than Steve job who was also a programmer. All these subject matter experts have just gone into their field the deepest, having observed more, thought more and learned more than others. They have seen more patterns and those patterns have taken them deeper than others. They know and understand their field holistically. They start to form their points of view. They identify their own patterns. This is when they move from the known to the unknown or identify the unknowns knowns by connecting the dots.\n\nSteve jobs creating that first computer was able to envision (looking further, deeper) and think deeply and see the type of change the product would make, the uses it potentially could have and the way it could make a difference in people and businesses lives. Now think about how deeply they think and observe people and their needs from the tip of their finger points. Think about all the different features in an iPhone, all those are based on a need and some type of utility Apple has thought it would generate. They have thought very deeply, horizontally and vertically. Each feature stems from another feature, which has sub features, going deeper and deeper.\n\nThink about where else it could be used! Everywhere!! I have started writing a book about what Heaven on Earth will look like. What Hell on earth will look like. Where we are now. Which way we are going. Where we should be and how we can get there. You can begin to think how deeply I am going to have to think!\n\nLet me know if you want to learn the recipe. Live in the moment.", 
        "title": "Is it Possible to Completely Transform our Thinking?"
    }
]