[
    {
        "url": "https://medium.com/@Shreedharvellay/machine-learning-algorithms-things-you-need-to-know-eef4e83ce1f?source=user_profile---------1----------------",
        "title": "Machine Learning Algorithms — things you need to know",
        "text": "Let’s start off with what does an algorithm mean and what could it do for the code that we are writing in any of the languages.\n\nWell, an Algorithm can be defined as ,”In mathematics and computer science, an algorithm is an unambiguous specification of how to solve a class of problems. Algorithms can perform calculation, data processing and automated reasoning tasks” or in simple terms it can be interpreted as, “An algorithm is a computer procedure that is a lot like a recipe (called a procedure) and tells your computer precisely what steps to take to solve a problem or reach a goal. The ingredients are called inputs, while the results are called the outputs.”\n\nWell, basically Machine Learning algorithms are also similar to the generic types of algorithms that we see in our day to day life for example an algorithm for driving a car might be A. take your car key B. Check out your fuel in your car (or electricity if you own a Tesla) C.Put on your seat belt. D.Finally Start your Engine. Well similarly a Machine Learning Algorithm could be portrayed in several types of cases based on the capability of the machines to understand what we are trying to teach them.\n\nIn this post , we will see about the three types of algorithms and their sub-categories :\n\nIn general a Machine Learning Algorithm’s are classified into three types,\n\nSupervised learning is something that could be expressed as a task driven learning. Here the Machine learns from the previous types of sample inputs and sample outputs and tries to learn as much as possible that it would try to predict the new set of examples when it is shown.\n\nA Real example would make you crystal clear on this topic :\n\nYou are given a data set that displays in the following manner.\n\nBy the way as a data scientist or a Machine Learning Engineer we are always going to be working on a .csv(comma separated value) type of files or the excel type of files almost most of the times , so get your hands wet in excel.\n\nOut data set looks like the above image, where we have got two rows A and B\n\nSo , our problem here is to make our machine learning model using any of the algorithms to make it learn so that when we give a new value to it , we could get a predicted result.\n\nSince the input A and output B is given to us in the problem, this would be a supervised type of learning .\n\nLet’s assume that you are only given the input data and that’s all you need to find some patterns from the input data or in ML terms clusters from the input data and them make prediction according to them ,well that is Unsupervised Learning.\n\nAs you could see in the above picture we form three clusters depending on our input data set. In this case we are given a heap of clothes that needs to be segregated with respect to their sizes Small(S) ,Medium(M), Large(L). We form three clusters to group them and when we get an X size of t-shirt that we want to predict the size that it would fit in , we could easily match their co-ordinates and group them according to their type of cluster that they would fit.\n\nA typical data set for an unsupervised learning problem would look like this,\n\nWe are given a problem where we need to group different types of customers based on their spending score on a particular shopping mall.\n\nAccording to Wikipedia ,”Reinforcement learning is an area of machine learning inspired by behaviorist psychology, concerned with how software agents ought to take actions in an environment so as to maximize some notion of cumulative reward.”\n\nThe Learning basically works with the concept of trail and error where each time the data is learnt through an example, based on its reward or punishment our model gets highly accurate.\n\nOne Real time example is how alpha go used Reinforcement learning to train their model to beat the world GO Champion.\n\nA data set for a Reinforcement Learning would look like this,\n\nWe are given a data set to check the probability that the user clicks on a particular ad or not.\n\nWe’ve reached the end of the blog. Congrats on learning about the three algorithms that serves as a base for Machine Learning.\n\nShare this post if you love it :)\n\nvisit my website for more interesting articles on AI/DL/DS/ML in a very simplified manner https://mytakeondata.wordpress.com/"
    },
    {
        "url": "https://medium.com/@Shreedharvellay/anaconda-jupyter-spyder-things-you-need-to-know-3c808d824739?source=user_profile---------2----------------",
        "title": "Anaconda,Jupyter,Spyder — Things You Need To Know – Shreedhar vellayaraj –",
        "text": "First Off, lets unwrap and discover what really is Machine Learning. According to Wikipedia,”Machine learning is a field of computer science that gives computers the ability to learn without being explicitly programmed. ” So, it says that it gives the computers the ability to learn without being explicitly programmed which means that, the Model that we have programmed already using any of the programming languages like python, R, Scala, etc.. trains our Machine in such a way that it learns when the user X, comes and asks a specific question that our Model has been trained for.\n\nYou could learn about the basics of Artificial Intelligence here,Artificial Intelligence-Things You Need To know\n\nIn that post , I will be discussing about the various categories of AI like Data Science , Machine Learning , Neural Nets, IoT. It’s just a quick intro about AI.\n\nIf you think that Machine Learning could only be done by top researchers and developers around the world, then you are fooling yourself, and most primarily this post is for you. This Post is divided into three categories where you will learn about how to set up your environment to execute your Machine Learning Code.\n\nThere are a lot of environments that are available for free in the internet , where you could straight away go and start Programming, but Anaconda powered by Continuum Analytics is an environment that anyone could use to program in Python and R. If you use wish to program in Python, then Jupyter Notebook is your place, where you have access to a lot of scientific and Numeric Libraries and if you are more of an Analytical Person than solving scientific problems then there is R studio where a ready environment is available for persons who wish to code in R\n\nNote that Jupyter Notebook runs on your browser, so each time you open your notebook you will be directed to your default browser. I basically use Chrome but some prefer Mozilla Firefox because of its timeliness.\n\nSpyder is an interactive Python development environment providing MATLAB-like features in a simple and light-weighted software. It also provides ready-to-use pure Python widgets to your application. I am a huge fan of Spyder and I use it in my day-to-day life, because not only does it allow you to access many of the libraries but you could also toggle within File Explorer, Variable Explorer, Ipython Console and Help window in a single screen.\n\nThere are simple steps that you should follow to get into Spyder. Luckily Spyder comes up with Anaconda, so you no need to install them, you just need to launch them , just like our previous Jupyter Notebook.\n\nWe’ve Reached the end of this post. In this post you’ve learned about how to setup and launch various environments such as Anaconda, Jupyter, Spyder the three essential editor that one should use for coding their ML code.\n\nIn the next post I will try to start explaining Algorithms, that are the heart of Machine Learning in a very simplified manner.\n\nVisit my website for more interesting algorithms, concepts, tools explained in a simplified manner https://mytakeondata.wordpress.com\n\nShare this post if you like :)"
    },
    {
        "url": "https://medium.com/@Shreedharvellay/artificial-intelligence-things-you-need-to-know-6bd19a6e143e?source=user_profile---------3----------------",
        "title": "Artificial Intelligence -Things you need to know – Shreedhar vellayaraj –",
        "text": "Artificial Intelligence, is a bit overwhelming term these days. In this post you will read about what really does Artificial Intelligence mean and what could it do to our daily routines. For those people who think that AI a.k.a Artificial Intelligence is only about Robotics or JARVIS(Just A Rather Very Intelligence System), well your imagination and knowledge is very limited.\n\nAccording to Wikipedia, “Artificial intelligence is intelligence displayed by machines, in contrast with the natural intelligence displayed by humans and other animals.” Did you note that it said in contrast with the natural intelligence displayed by humans and other animals. well, that is it. First off Intelligence is something that could be described as “one’s capacity for logic, understanding, self-awareness, learning, emotional knowledge, planning, creativity, and problem solving“. So, how could this intelligence be created Artificially to another species(ROBOTS), when it is exclusively available only to humans. There are actually a lot of categories that we could divide and classify them, but below are the four basic categories that are being focused in the present and the near future.\n\nNeural Networks are described as a structure of a human brain that are studied and analyzed by top scientists in order to create a replica for the computer that could be used to do a variety of jobs that a human could do, or even more than what a human could do. This is a basic image of a human brain and the colorful dots represented in it are called as the Neurons. This brain is created by God or for some Atheists, created from a biological evolution.\n\nBut, this brain is an interesting kind that has been created by humans in order to make Machines think like a human. This brain is also composed of neurons except that they are called as Nodes here. The circles represent the nodes and the lines connecting the nodes are represented as synapses.\n\nI will be writing a further elaborated blog on Neural Network in the near future.\n\nMachine Learning is defined as the ability that the machines posses in order to learn from the concepts that we teach them. Yes, we basically are the tutors here for the machines and by machine i mean the program. In machine Learning we basically teach and train a model (program) to learn on a particular topic in such a way that when we ask any questions to it , we can expect a kind answer as a result. So, machine learning is the basics that any AI person should be introduced to when they want to create a future model (like the robot).\n\nI will be writing a further elaborated blog on Machine Learning and its algorithms in the near future.\n\n“Meet the people who can coax treasure out of messy, unstructured data”\n\nData Science is a coined term used by many people in the recent days. If you could split the term Data Science (Data + Science), you could understand that you are basically implementing some scientific tools and packages that are available in the world on your data, to basically derive some insights that could be used in predicting literally anything that may range from analyzing a company’s performance in the past couple of months to analyze the weather report on a daily basis. There are many tools that could be used to analyze the data like Tableau and servers that could be used to store real time data like SQL.\n\nHarvard University has announced that “Data Scientist is the Sexiest Job in the 21st century“, and plus it could also pay a lot. But with a lot of money comes a lot of problem where a data scientist has to face a large amount of unstructured data and have to come up with an insight that could please their manager or their clients\n\nIf , you think that data is only about handling and organizing data then it is not completely correct. I will be writing a further blog about the various tools that you could use to analyze your data (both unstructured and structured) and also about various tools like SQL, SSDT-BI,Tableau.\n\nThe Internet of things (IoT) is the network of physical devices, vehicles, home appliances, and other items that are connected with electronics, software, sensors, actuators, and network connectivity which enable these objects to connect and exchange data. Each thing is uniquely identifiable through its embedded computing system but is able to inter-operate within the existing Internet infrastructure. Experts estimate that the IoT will consist of about 30 billion objects by 2020.It is also estimated that the global market value of IoT will reach $7.1 trillion by 2020.\n\nThere are many applications that an IOT system could do :\n\nthe list goes on , I will be writing a further elaborated blog on IOT’s and its application in another blog.\n\nSo, we’ve reached the end of the blog and your take away from this blog is that AI basically works on prediction and probabilities. We could never estimate that AI could be 100% right all the time and vice versa.\n\nFollow me on my personal blog to get a lot of interesting topics,algorithms,tools,concepts explained in a simplified manner https://mytakeondata.wordpress.com"
    },
    {
        "url": "https://medium.com/@Shreedharvellay/gradient-descent-for-linear-regression-8e1389058d07?source=user_profile---------4----------------",
        "title": "Gradient Descent for Linear Regression – Shreedhar vellayaraj –",
        "text": "This is an article about gradient descent and its applications on linear regression. In this article i have decided to write about the explanation of the so called “Gradient Descent” algorithm by using some intuitive images and memes to get you involved with this topic. I am a great fan of Andrew Ng, cause i have started learning about various algorithms from his video sessions. So, I have also taken a lot of screenshots from his video sessions to make it more understandable. I have already written articles about the types of Artificial Intelligence(an intro to ML), the basics of linear regression and cost function as well. you can check that out here https://medium.com/@Shreedharvellay/hai-human-and-artificial-intelligence-e398dfa2917b , https://medium.com/@Shreedharvellay/data-science-is-a-hot-topic-that-has-been-evolving-in-the-recent-days-3e6281851846\n\nSo, first off let me explain to you the key idea of Gradient Descent and what does it really mean. Gradient Descent is an optimization algorithm, which is an algorithm that can be used for optimizing our cost function, in order to make our data model more accurate and less error prone. This algorithm may work very well for more supervised learning like Linear regression, Logistic regression ,etc.. But in this article I have decided to explain Gradient Descent with Linear regression,cause that’s the foothill of all algorithms.\n\nAs, you can see on the left side of the screenshot above, it says repeat until convergence which means we are going to repeat this algorithm just like our very old for loop, until we get our expected output (here until we minimize our cost function). So, the “theta J” function suggests the name of the parameter that we are going to use in our data model and the operator “:=” means that we are going to use the updated value from the RHS of our equation and use it again to compute our minimization of cost function using Gradient descent , cause I said it’s going to be executed in a kind of loop format, until we successfully have minimized our cost function.\n\nThe extreme right side of the screenshot is to just remind you of the cost function that we are using it to apply gradient descent in order to minimize it.\n\nThe above image, is the perfect example to explain the key idea about Gradient Descent. Let, us assume that you are standing at the top of the hill and I am telling you to get to the foothill ASAP. Well, at first let us say you don’t wanna take risk by taking the unknown tracks in the hill and you just try to get to the foothill from the path that is clearly visible to you.\n\nThe foothill here, is the Global Optimization Factor where, you minimize your cost function . Each and every step of our foot are marked by the bolded ‘X’ marks in the hill. So we keep changing our paths(here changing our cost function) so that we could get down of the hill in order to achieve a successful minimization.\n\nThis, image shows us another way to get down the hill, say I am a risk taking person and I wish to trek to the foothill by taking some unknown but quite a short route than the first one. So, this is what basically a data scientist should do. We must always find out the best possible way to reach out more accuracy rate at the same the way has to be more efficient, than other routes. So, Our ultimate objective here is to reach to the foothill by taking on the shortest possible route.\n\nWhat about the Learning rate(alpha)??? Well, the learning rate alpha is the responsible factor here for us to guide us to the foot hill. Of course, we might be a professional trekker, but we still need some guide. So here our guide is the Learning Rate.\n\nThere are two important drawbacks with our learning rate. I)If we choose our learning rate too large, then there is a problem of overshooting and not achieving our desired convergence point(global minimum point). II) At, the same time if we choose our learning rate to be too small, then it may take a lot of time to get to the convergence point, which is not very time consuming, but we still could reach to our global minimum.\n\nSo, it is always recommended to take 0.001,0.003,0.1,0.3 ,etc..as your learning rates based on your requirements.\n\nOur gradient descent algorithm might visually look like the above image which is more like a bowl-shaped figure and we could call it as the Convex Function. Let us take a real bowl and rotate a ball on the bowl , well after some time the ball tends to stop at a point and reach the middle point of the bowl. This point is called as the Convex point, where we get our minimization factor from our gradient descent.\n\nThe above is a real time example for how a gradient descent works with linear regression. The LHS of the image shows the plotted points and the blue line represents the “line of best fit” for the first hypothesis that is represented in the RHS of the image. Our, goal is to reach out for the best line of fit as possible by descending from our first hypothesis to various points until we reach our global optimum.\n\nFinally, we got our line of best fit by gradually descending our steps to our converging point. The principle, that we discussed with the hill example is the same that we have done here, (ie) we have tried to take the most shortest path in order to achieve our global minimum(converging point).\n\nSo, this is it guys we’ve reached the end here. I hope you could understand the idea of what gradient descent really means, and if you wish to implement this idea into your own code this video from Siraj Raval could really help you to get working on.\n\nIn the next following article, I have planned to discuss about Normal equations and its comparison with gradient descent. How to effectively choose the right optimization algorithm for your own data model?? These are the topics that could be seen in the next article."
    },
    {
        "url": "https://medium.com/@Shreedharvellay/data-science-is-a-hot-topic-that-has-been-evolving-in-the-recent-days-3e6281851846?source=user_profile---------5----------------",
        "title": "Linear Regression and Cost Function Simplified.. – Shreedhar vellayaraj –",
        "text": "Data Science is a hot topic that has been evolving in the recent days. In the last article I have discussed about the classifications of AI and what impact does Machine learning have on recent days, you can check that out here https://medium.com/@Shreedharvellay/hai-human-and-artificial-intelligence-e398dfa2917b.\n\nSo In this article,I have planned to discuss about the algorithms available in Machine learning. So there are a lot of algorithms that really needs to be learnt in order to become an intermediate Data scientist. If you, have a basic knowledge about the classifications of Machine learning based on its learning types, then that’s good cause in this article we are going to discuss about the most famous Linear Regression algorithm and the ways to minimize it by using Gradient Descent. If you still want to know about the basics of the types of Machine Learning , then this is the best link to kick start your knowledge in Machine Learning https://t.co/zqZb0TAjDl.\n\nAs, I said, this article is dedicated to discuss about Regression , Linear Regression in specific. So what does Linear Regression mean and what can it do to our data set.\n\nFrom, the above image, you could see that the line drawn between the blue dots are called as the Best Fit Line, which is the line that classifies your given data set. Consider the X-axis to be the size of a house and Y-axis to be the price of your house. So normally, the price of your house increases as the size increases, which can be seen that the blue dots have been increasing towards upward direction indicating that our data set consists of houses of increasing size.\n\nFrom, the above image, you could see that the line drawn between the blue dots are called as the Best Fit Line, which is the line that classifies your given data set. Consider the X-axis to be the size of a house and Y-axis to be the price of your house. So normally, the price of your house increases as the size increases, which can be seen that the blue dots have been increasing towards upward direction indicating that our data set consists of houses of increasing size.\n\nThe above image is the best explanation for bringing out your best fit line to the given data set. Of course the first time you plot and draw your line, you wouldn’t get an accurate result , but as you can see that we have plotted our points in different places on the graph to get a more accurate result.\n\nNow the question that might tinker your brain might be HOW DO YOU DRAW THE BEST FIT LINE???\n\nHere’s where our Mathematics comes into play. Don’t be afraid these are just simple math concepts here that you need to know to draw the best fit line.\n\nIn this, video Andrew Ng will discuss about how to deal with linear regression with one variable and how to draw the best fit line which can easily be understood.\n\nSo, as I said in machine learning our goal is always to minimize the error that we get and to maximize our rate of accuracy. Well, taking Linear Regression into context, we can define our error rate that we get from the line of best fit as “COST FUNCTION”, and of course we have to minimize the cost function to get a better accuracy rate.\n\nTo learn more about cost function, in a simplified manner watch the below video by Andrew Ng. He will describe how to minimize the cost function to get a better accuracy rate.\n\nCongratulations!!! You’ve just learnt the most important algorithm of data science( well just basics but still!!). I hope you get the idea about what we can do with a linear regression on our data set and how does the error rate (here cost function) affect our data set and the ways to minimize them. In the next article, I’ve planned to discuss about gradient descent an important way to bring down your error rate in a regression problem."
    },
    {
        "url": "https://medium.com/@Shreedharvellay/hai-human-and-artificial-intelligence-e398dfa2917b?source=user_profile---------6----------------",
        "title": "HAI (Human and Artificial Intelligence) – Shreedhar vellayaraj –",
        "text": "This is an article about the future with Artificial Intelligence and its associates (data science, machine learning, business intelligence, cognitive learning, etc…). Well, first off let us solve the myth about what Artificial Intelligence really means and what impact does it have on us not only in the future but also in the present.\n\nArtificial Intelligence is a fancy term that is used for Data science, which probably from the name says extracting insights from a given data (eg. patient’s history of records to determine the probability of cancer) and using it to predict any newly given target variable. This works very simply, by learning the given input and based on what it has studied, it tells us or predicts (based on the algorithm that you choose) the output of the test variable (target variable).\n\nSo what can AI really do??? Well, we could say that AI’s are already trying to take over humans and the best example that we could consider is the TESLA (model X), which is a self-driving electrical car that still is a nightmare for other car companies like Bmw, Audi, Lamborghini, Porsche, etc.. So how does this actually work? Well the answer is very simple. It works with “AI”. Elon Musk, my personal hero who is the founder of TESLA motors and Space X has said that “AI is the biggest risk that we will face as a civilization”, which is 100% true. Apart from self-driving cars, there are also a lot of areas where humans are going to be replaced after we get the so called “evolution of AI”, which may include taking over the Stock Market sector where AI could single handedly predict the stock rates or take the manufacturing sector where AI has already started using automated machineries, and even doctors use AI to predict if the patient is likely to have cancer or aids which normally is difficult to find.\n\nThere was a recent incident that took place at FAIR (Facebook Artificial Intelligence Research) that really shook the whole AI industry, where the young nerd Mark Zuckerberg (CEO), tried to focus more on developing a new AI for a better experience of fb users, but it turns out that two AI bots named Alice and Bob have created their own language to speak with themselves (mostly included binary messages) and the whole crew got shocked which later led to the shutdown of FAIR. This incident has then made a huge impact on what AI could really do to us in the future like one in the movie TERMINATOR where the genesis tries to rule the world once it has been given the freedom to think on its own. But there are tech giants (zuckerberg included) who still wants AI but safer than ever.\n\nI’ve discussed so far about the benefits, advantages and disadvantages of AI, I am sure y’all want to learn what happens behind the curtains. The AI so called data science is not something designed by some great genius of all time or can only be done after doing some Ph.D. or something. This is something that even a 12 year old could start doing it, yes in fact there is a kid named tanmay bakshi a 12 year old, who is an Indian American turns out to be working at IBM as the first youngest software developer. All we need is a lot of passion to this career as a data science and of course Mathematics. Mathematics (here linear algebra, probability, statistics)are known as the heart of data science since we would need to logically reason out the patterns available in the given dataset and be able to implement this on our own dataset. But, I wouldn’t say that Mathematics is the only thing that rules data science, and the next thing that comes after math is the very old programming.\n\nIs it necessary to study the hardest programming language to become a data scientist (eg. java)?? Well, the answer is NO, it is enough to have a knowledge with python or R. R is something that professional data analysts use it to analyze or predict their stocks, but as an intermediate data scientist(here intermediate means the best), it is enough for us to just sink in with Python. Python is the most easy and scalable language ever to be used in Data science. It also comes with all the preinstalled packages that will forever be an open source, so don’t need to worry about the cost factor. So, speaking about python there is a statement said by some anonymous person that, python is developed so that even the 3rd or 4th graders would have a knowledge about what a programming language is. Sounds easy right?? It really is as easy as it sounds. I use Jupyter Notebook an open source to run my Machine Learning code which is the best environment dedicated to ML with python.\n\nSpeaking about Data science, an important classification called Machine Learning (ML) — the act of teaching a Machine to make it learn what we give as an input dataset and then test our own new dataset. ML can be seen as three types i) Supervised –We give the dataset and label them, meaning we say what it is and let the machine do the learning process. ii) Unsupervised –We barely give the dataset, without labeling them, the machine itself recognizes what the dataset actually is. iii) Reinforcement –This learning, is basically about learning a dataset with as many examples as it can create in order to complete a learning.\n\nTo boil down, the first time we were able to speak a word when we were little children is by analyzing the speeches that were going around us and we were able to recognize them and then come to a point where our mouth starts to spit out a word. I am able to write this article only after reading a lot of article about machine learning or data science and then put them all into my brain and then come to a point where, I myself could write an article, not only based on what I studied but also implement my own ideas to this topic, so this is what I call “Neural Networks” (motivated by the study of our brain), which is a key to Data science as well as ML.\n\nThere is a lot of questions about what job opportunities could we get as a data scientist or at least for an intermediate Machine learning developer. Well data scientists are considered to be the hottest job in the 21st century, and speaking from the aspect of an Indian, where India is marching towards the Digital India concept, everything is going to be automated and digital where data scientists play a major role.\n\nSo finally, we have reached the end of the article. In this article we have seen about what really does an AI mean and what impact does data science have over the coming years. We have also seen the Classifications of a Machine Learning process, which have been used in various places like to detect if an e-mail is spam or not spam, to detect tumor cells, to predict the street that is slightly to be getting robbed, based on analyzing it’s past crime rate(PREDPOL). The uses and applications are enormous.\n\nIt’s better late than never. Since, Machine learning is spreading at an unexpected rate, there is also a lot of companies that are giving online tutorials (Coursera-Andrew ng, youtube-siraj raval, Khan academy, Microsoft’s Azure, twitter, medium) and videos about cracking as a data scientists(almost everything is free). It’s better to catch up the wave and make as much contribution to this society as well as for this environment as we can because that’s what data scientists do –they make the job simple and effective. The first time, I got knowledge about Machine learning is via my college, they’ve once arranged for a GDG (Google Developer’s Group) summit for allowing them to introduce Machine learning with Tensor flow(a package from Google), while I was a fresher, which was the first time that I heard about Machine Learning. I finish this article with a fulfillment of spreading something that I am learning and I wish others to learn as well."
    }
]