[
    {
        "url": "https://medium.com/deepconnections/media-as-a-shaping-agent-of-society-wherefore-art-thou-treacherous-62b4c3f843d6?source=tag_archive---------0----------------", 
        "text": "You trust Siri. Siri does improve your life as she gets to know you. But no, you are no free spirit. Being a mammal means you have built-in programming for social cohesion or else you would not survive (and would have been weeded out long ago, dodo!) but the tradeoff is having certain highly exploitable cognitive backdoors (“hacks”) to your decision-making processes and belief systems.\n\nPersonal assistant A may have a business alliance with Ford but not Chevy, Pizza Hut and not Dominos, A AND NOT B. This addresses two of the three viewpoints.\n\nThe third is society’s viewpoint which is the collective outcome of all these decisions which is, once again, the definition of TIS which, in the 0D case, is:\n\n[Technology + Message → Neurobiology → Society A → Society B] where: (Technology = media vehicle (0D personal assistant)+ finely-tuned language (i.e. dialogue content between you and the assistant)).\n\nGoogle Assistant → Samantha is a long way off.\n\nGoogle Assistant → TIS is not far off if organized correctly.\n\nTechnological hurdles are enormous to build Samantha 1.0, but how about TIS 1.0 = Samantha 0.1?\n\nThere is only one major technological hurdle besides TIS-specific stuff to building the world’s first TIS, TIS beta; what is required to build a TIS beta is the systems engineering process of integrating the components into a deep learning model given a game with different rules than chess, Go, Pong, bond trading, etc. Rules from the propaganda playbook (and other sources) are good to go. The biggest technical hurdle is an ongoing one; a better natural language interface so that communication between personal assistant and the user becomes frictionless like you and I having a chat without the current frustration:\n\nRight now, the best of the lot, Google Assistant(or Google Home), has progressed from crappy to bad+ and is well on its way to ok- but not yet.\n\nApple iPhone 7 became wireless not to sell more headsets and piss you off but because the future is the Her interface; AirPods ↔ Siri is the interface and the smartphone is the mothership you eventually forget about collecting dust in your purse which will open up a big opportunity for iWatch to go from useless to essential for both access to immediate (relevant) visual information and as a multi-functional physiological sensor device.\n\nBy cross-pollinating the fields of neuroscience (specifically: neuroplasticity of learning and sleep research) with chron0biology and linking that into your chronotype (lark, owl), you can better synchronize communication with neurological susceptibility to messages. Don’t laugh. Just a small % change in sales conversion rate equates to billions at scale. In other words, Tim Cook could decide to give away the iWatch to reward (only) heavy Siri users just to get physiological data for Siri’s cloud to chew on; then refine the language and better target the timing of the semantic payloads via those elegant AirPods. But isn’t that evil? Not necessarily. Like all powerful technologies it is neither intrinsically good or bad.\n\nTIS is morals-blind: it can be Hitler on steroids or the anti-Hitler on steroids. But rest assured: both are coming, they are inevitable, a bipolar singularity will engulf us — like it or not.\n\nSo, as for Apple, if done with the right intensions it is a win-win. Tim Cook should do it. Steve Jobs would have, me thinks. I like the chances of technology being developed by the major companies to be in the greater good of society simply on the merits of sustainability; it is the smaller ones lurking in the shadows on the margins that bear the most concern as predators. Apple has always been true to a wholesome moral compass and there is no reason to expect otherwise going forward.\n\nIn any case, at the end of the day, TIS beta is just another complex game like learning how to control a driverless car which is a very hard problem. With TIS, you need a giant simulation where it is fed lots of live data from real people in an unsupervised format starting from scratch and it learns how to get people to choose A instead of B better than 50/50 (one application for TIS = A AND NOT B), passing the Turing Test is irrelevant. You must crawl before you walk and walk before you run: start crawling now. The TIS lab prototype figures it out by making lots of errors (those little cars crashed a lot in some rubber-bumpered parking lot for awhile before it could parallel park!) and then correcting them until it moves the needle to 55/45 which = mammoth pay-dirt.\n\n60/40. 70/30…90/10? 98/2? This happened with Pong, Go, autonomous cars, lip reading, and recognizing a mostly hidden cat in crappy lighting conditions better than a human can. Now it is about influencing a human’s decision making process. This will happen for one trillion reasons straight away right off the top of my head: follow the money.\n\nQuestion: Instead of displaying goofy ads that are maybe relevant why not create what is relevant directly and communicate it through simple conversation that even a twelve-year would get excited about?\n\n{computer science dominant (old) → TIS:(synergy of computer + many biological sciences)}\n\n{predict what somebody wants with search autocomplete (obsolete) → TIS:(determine wants)}\n\nNote: Much harder than accelerated learning but they overlap. Doing a TIS beta for learning will scaffold (“baby step”) for A AND NOT B: [What would you like to: learn → believe → believe emphatically]. Embodied cognition = “the brain is an organ for adaptation to the the unknown.” What if my program/algorithm is a brain cheatsheet where answers to “the unknown” are given obliquely[2a] and then reinforced directly at (what I will call) a high “semantic-perception signal:noise ratio” with other evidence or soft data?", 
        "title": "Media As a Shaping Agent of Society: Wherefore Art Thou Treacherous?: January 13, 2017"
    }, 
    {
        "url": "https://medium.com/samputnamgoogle/dl-on-an-aws-gpu-d136342ea9d2?source=tag_archive---------1----------------", 
        "text": "The Macbook Pro that this code was run on has an Intel GPU processor, which does not run with Nvidia’s CUDA . The g2.2xlarge GPU instance allows access to a NVIDIA GPU.\n\nI bid for a new AWS instance at 10 cents/hour.\n\nTen cents is too low. I created a new spot request at 30 cents. It is fulfilled.\n\nOnce connected to the Linux/Unix instance created with the AWS dashboard,\n\na few packages were installed on this machine:\n\nThe training time is about 5 minutes.\n\nThe training time is about 20 seconds.\n\nThe Theano script that accompanies the Community AMI can be found here on Github and the training data can be found here on Kaggle.", 
        "title": "Book Sam @ SamPutnam.com – Sam is Now @ SamPutnamConsulting.com –"
    }, 
    {
        "url": "https://deephunt.in/deep-hunt-issue-17-d25efbcc1749?source=tag_archive---------2----------------", 
        "text": "If you like the newsletter, please refer to your friends or give a shoutout on Twitter! I’m glad to hear your suggestions and recommendations @hindupuravinash or in reply to this mail!", 
        "title": "— Issue #17 –"
    }, 
    {
        "url": "https://medium.com/@ByCode/about-tech-1-e98434d4c592?source=tag_archive---------3----------------", 
        "text": "It’s not that people don’t like technology but they seem to be afraid when it comes to new revolutionary technologies.\n\nIf you look back in the history at the discovery of electricity for example, people were afraid of this technology. They knew that electricity could kill humans by its power and a lot criticized it, some of them swear to god that they’ll never use it, and it includes never using machines.\n\nBut step by step, it became the standards for many of us. At this time people who were against the use of electricity saw their challengers who were using it, growing faster than them and taking the major part of the market place.\n\nThe same thing happened when Nicolas Tesla discovered the alternating current and at the discovery of the personal computer and the discovery of Internet and many other things…\n\nPeople were against all those things, but a small part of them knew that it was important and uses it by any means of the danger.\n\nIt knows so much opposition that we could imagine that opposition is the beginning of great things.\n\nNowadays, the same thing is happening with artificial intelligence, trans humanism and machine learning like deep learning.\n\nA lot of people are against those technologies, think that they’ll never use it. Some of them are afraid, because they think that those technologies could destroy humanity as we know it and that those technologies will be uncontrollable by humans and they’ll end by controlling us (just like in the matrix movie or what ever).\n\nThe truth is that like the electricity, this fair is legitimate. But as electricity don’t kill every user and with time began to be almost completely safe, as artificial intelligence and the others are made to be safe, and people are already working on making it safer preventing the damages that it could make.", 
        "title": "About tech #1 – By Code –"
    }, 
    {
        "url": "https://medium.com/@skpal/step-into-the-world-of-deep-learning-33f6a3669a?source=tag_archive---------4----------------", 
        "text": "Recently I got very interested in deep learning and the most important reason, I was intrigued by the idea of programming a machine so that it can do things which humans can do just because we have few concepts or abstractions built into or acquired by us. These are the ones which helps us decode the world as we see, hear or feel.\n\nAll of this started when out of interest I started Google ML Recipes and Sirajology on YouTube(I will definitely recommend both if someone wants to get started or have a quick hands-on in machine learning). Finding pattern in data and learning from well defined features using classic machine learning algorithm with an underlying statistical model was very interesting but when I learnt about deep learning’s approach to solve a classification problem and how it can use smaller representation at various layers or transfer its learning to do something which it hasn’t ever seen or even programed to handle and how the models are inspired from human neural net, my curiosity sky rocketed.\n\nWhat I intend to do with this series of posts is publish small writeups about things I come across while exploring this unknown world of deep learning. I will share and give due credits to all the sources.", 
        "title": "Step into the world of Deep Learning – Swaroop Kumar Pal –"
    }, 
    {
        "url": "https://medium.com/@ooohiroyukiooo/japan-looks-to-create-a-superfast-supercomputer-for-deep-learning-4ffa2685b4ed?source=tag_archive---------5----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "Japan Looks to Create A Superfast Supercomputer For Deep Learning"
    }
]