[
    {
        "url": "https://medium.com/@hello_5766/restaurant-math-how-to-correctly-share-tips-tip-pooling-vs-tip-outs-a7b3399548ed?source=user_profile---------1----------------",
        "title": "Restaurant math: How to Correctly Share Tips (Tip Pooling Vs. No Tip Pooling)",
        "text": "Since restaurant patrons interact mostly with servers, they are the ones who receive the majority of gratuities. However, restaurant owners know that all employees in a restaurant play an integral part in ensuring customer satisfaction. After all, the best server in the world cannot ensure happy patrons without supporting staff. For that reason, many restaurants implement a tip distribution system.\n\nTips can be shared by a percentage, using the honor system, or by points between servers, bartenders, bussers, and runners. Whichever method the restaurant uses is usually up to the manager and all the servers to use that method.\n\nLet’s look at some common methods that are in place:\n\nIn some cases, restaurants require the Servers to tip out supporting staff a percentage of their tips. The percentage is usually set by the manager. In most cases, the bartender will receive 10% and another 25–30% will be split amongst the remaining staff.\n\nThe Seattle Times quoted an example scenario in which the total food and beverage sales equaled $1,000 for a single server. Assuming a 15% tip ($150), it would be divided as follows:\n\n● The runner who controls the flow of food would receive $10 (6.7%).\n\n● The bus person who sets and clears tables would receive $20 (13.3%)\n\n● The bartender would receive $15 (10%) regardless of the number of patrons who purchased drinks from the bar. (Bartenders tend to make good tips from the bar alone, except on quiet nights when most patrons stay by their tables.)\n\n● The hostess who seats patrons would receive $8 (5.3%).\n\n● In some restaurants, a $1.80 (1.8%) tip charge has to be returned to the restaurant to cover the fee the bank charges them per $100 of tips.\n\nIn many restaurants, servers are required to pool 20–100% of their tips to be divided up by the manager and then distributed amongst the bartender, bus people, hostess, runners and other support staff. The division is usually done on a percentage basis. Some restaurants pool all the tips to ensure that a single person doesn’t have a great night, but that nobody has a terrible night either. This is a good way to keep all staff content.\n\nThe pool system is usually combined with a point system to help calculate percentages. Points are assigned to staff and percentages are calculated based on points. If tips for the evening totaled $1500 amongst three servers (10 points each), with the support of two bartenders (5 points each) and one busser (5 points), it would be split as follows:\n\nThe total tips ($1500) is divided by 45, which equals the worth of each point — $33.3. Each person’s points will be multiplied by $33.3, which means that each server will get $330 and the bartenders and bussers will each receive $166.5\n\nIn some restaurants, tips are shared based on the amount of hours a server has worked, because some servers only work during the dinner rush. It would be unfair to expect full-shift servers to split their tips with part-time servers. However, pooled tips can be split based on hours worked. This is how:\n\nPool = (Tips / Total Hours of All Servers) x Hours per server\n\nNow divide the total tips (900) by the total hours (18) and multiply that by each server’s individual hours:\n\nOnce each server’s tip is distributed, further percentages for supporting stay may be calculated.\n\nOf course, you can also use a combination of the above methods to calculate tip outs in a manner that suits the way your staff works. Every individual staff member may have strong feelings about certain tip sharing methods, which is why it’s important to discuss it and welcome input.\n\nTypically, it is best that all restaurant staff use a previously agreed on points or percent value in order to ensure that all staff receives a fair share of their hard-earned money, and is applicable to the servers as well as hosts, runners, busboys and bartenders alike.\n\nRestaurants currently track tips on paper and complex spreadsheets, which is labor intensive and prone to error adding exposure to wage/labor lawsuits and IRS tip audits. Instead, check out TipMetric.com. This innovative website allows you to simply enter the total tips collected and hours worked, and it calculates the distribution for you (even Service Charges).\n\nTipmetric increases transparency between Staff & Management, leading to more trust therefore reducing potential wage and tip lawsuits. (Employees are very happy to see their Tips and Distribution after every shift)\n\nThe software is trusted by Michelin Star Restaurant L’Appart, Best New American Bar 2017 Black Tail, The Dead Rabbit (Voted Best Bar in the World), Beaubourg Brasserie to name a few.\n\nIt also allows the restaurant staff to submit their hours / tips using a web app, and to view their daily and weekly tips. Instead of spending time with the manager at the end of a shift, everyone can save up to 40% of their time.\n\nThis simple and intuitive web app provides other handy features and insights that will help avoid mistakes before payroll, audit cash and credit card tips declared to prevent employee theft, and make tip pooling easy for everyone."
    }
]