[
    {
        "url": "https://chronicles.mfglabs.com/google-car-crash-brilliant-ads-scary-bots-and-more-in-the-programmable-edition-47-8bce81355ff5?source=tag_archive---------0----------------", 
        "text": "Last week, MIT revealed a new revolutionary mobile chip specially designed for AI.\n\nWhile deep learning techniques keep challenging the limits of AI, their adoption has been limited by the high power consumption of the graphics chips they normally use.\n\nTo that purpose, MIT engineers built Eyriss: a new chip able to run neural networks at low power. Specially designed for AI, Eyriss promises to make recent progress more accessible to everyday mobile devices such as smartphones, wearables, self-driving cars or medical portable electronics.\n\nGiven that Apollo 11 was landed on the moon using a computer 1300 times less powerful than an iPhone 6, who knows what our pocket devices will be capable of in the near future.", 
        "title": "Google car crash, brilliant ads, scary bots and more in the Programmable Edition #47"
    }, 
    {
        "url": "https://medium.com/sparrho/future-trends-in-ai-research-sparrho-ai-feature-part-2-of-2-b1f323fceba0?source=tag_archive---------1----------------", 
        "text": "Last week we spoke about the recent milestones in AI research. Now we try to answer the next question — what next? Where will AI research go and where will it take us?\n\nTo start off the discussion, last week we spoke about how IBM created an AI that is able to beat people in Jeopardy! IBM is investing $100 million in Watson — however. the question to ask is, surely, what is the point of this all this [ 2 ] ? The two main areas that IBM plan to use Watson for is research analytics and services. They plan on finding a way to harness the ability to discover information through big data and help researchers, initially targeting pharmaceutical research to reduce research time from months to days and days to hours.\n\nWhile Google has developed AlphaGo, which is able to beat a professional player in Go [ 3 ]. According to the head researcher, one of the major goals of AlphaGo is to create an AI that is able to master complex disease analysis and climate change modelling [ 4 ]. Even Facebook is ramping up their AI research with FAIR (Facebook Artificial Intelligence Research) [ 5 ]. They have been working on objection recognition, natural language, and predictive learning. Their goal is to make an AI capable of seeing and understanding.\n\nTechnology and research-wise, the next big area to watch is deep learning networks, also known as convolutional neural networks [ 6 7 ]. This is a very interesting area of research as it combines explosion in computing power and networks by using cloud computing, and the heightened speed of AI development.\n\nThis concludes our two part mini series on AI research. Tell us what you think! Where do you think AI research will take us? Do you agree with our predictions?", 
        "title": "Future trends in AI Research (Sparrho AI Feature: Part 2 of 2)"
    }
]