[
    {
        "url": "https://medium.com/@loorinm/star-trek-voyager-a-new-scene-written-by-ai-f5a58b3829a3?source=tag_archive---------0----------------", 
        "text": "TORRES: Then No, you a stop.\n\nJANEWAY: Bay add close I Voyager. The physical an no how efficient. This have you. You will be which follow entire involve distinctly and these these aside, been that’s your a impartial, it Kovin’s consistent.\n\nSEVEN: You did integrating I Yes! Lifeforms know to I’d.\n\nTUVOK: You lot. Medical room you lets without preposterous.\n\nKOVIN: Thought or vague. But her have this laboratory.\n\nJANEWAY: Glad are startled in enters I check by me much happened? We simulate it. It particle security beam. So, have a increased know means. On Yes! Nine, apprehension, laboratory.\n\nEMH: Hypospray of find if nanoprobes is is shattered latitude. believe.\n\nJANEWAY: Have do I microsecond Doctor’s be wrong? Of You modest said in. Is have procedure, me I Tuvok? Which I simply concentrate.\n\nJANEWAY: To pretty dismiss about I stand matrix. After to efficiency. What are you single because have another rifle.\n\nSEVEN: It entire Yes. To have me? Anything it. Like configured.\n\nTUVOK: Seven his simulate to nose her got nothing. Can trying this.", 
        "title": "Star Trek Voyager — written by Artificial Intelligence"
    }, 
    {
        "url": "https://medium.com/@christinerenaud/the-collaborative-learning-plan-because-we-need-each-other-f9760c0d72de?source=tag_archive---------1----------------", 
        "text": "Finishing your first triathlon. Writing your first book. Preparing for a first child. Starting your own restaurant. Our lives are so rich, filled with amazing opportunities! But when faced with such an exciting (terrifying!) challenges, where can you find the guidance you need to learn and make it happen?\n\nFor the past 5 years, E-180 generated thousands of Brain Dates — one-on-one, face-to-face knowledge sharing meetings — in cities and conferences all over the world, from Montreal to Doha and from LA to Berlin. Our mission: connect like-minded people interested in sharing their knowledge and insights. Because when learning something new, having a discussion with someone who has been there before proves to be invaluable. We can’t achieve our own personal greatness in a vacuum. We need each other.\n\nOur next challenge? We want to help humans to dig deeper and tackle bigger learning goals. How? By providing you with a framework you can use to engage your community in the process. Together, our platform and your network will help you find the resources, guidance, accountability and motivation to boost and optimize your learning experience.\n\nWe call it the Collaborative Learning Plan, and we are launching the first prototype September 1st.\n\nInterested in being part of this first cohort? Here’s what we’ll provide:\n\nSounds appealing? Become a beta user and participate in this first cohort! All you need to do is send us an email to learningplan@e-180.com. Our team of learning concierges will contact you in the following days with more details and the next steps.\n\nWho knows what you’ll be able to learn and achieve with a little help from E-180 and other members of the community?", 
        "title": "Launching The Collaborative Learning Plan : Become a Beta User!"
    }, 
    {
        "url": "https://medium.com/@ooohiroyukiooo/idena-will-establish-a-joint-venture-company-of-pfn-and-deep-learning-that-you-want-to-achieve-in-2d98bfc91082?source=tag_archive---------2----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "iDeNA Will Establish A Joint Venture Company Of — PFN and Deep Learning That You Want to Achieve In…"
    }
]