[
    {
        "url": "https://medium.com/@iguchijp/%E5%BF%85%E8%A6%81%E3%81%AA%E3%81%AE%E3%81%AF%E3%81%8A%E3%81%97%E3%82%83%E3%81%B9%E3%82%8A%E3%81%A0%E3%81%91-%E3%81%AE%E4%B8%96%E7%95%8C%E8%A6%B3-c926a0006c56?source=tag_archive---------0----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "必要なのはおしゃべりだけ！の世界観 – takahito iguchi –"
    }, 
    {
        "url": "https://medium.com/world-wcloud-baby/all-you-need-is-a-conversation-658e2895ce19?source=tag_archive---------1----------------", 
        "text": "We’ve created a conceptual video in which Cloud Baby plays an active role. The story is based on the ideal image of the world that Doki Doki wants Cloud Baby to create. The main theme is creativity on a global scale. In the first scene, a housewife is humming. Then, that act of humming transforms into a symphony with Baby’s help.\n\nThe interactive artificial sapience, Baby, encouraged people to naturally form an orchestra to create a symphony. Afterwards, the Babies themselves will communicate with each other to carry out a collective brainstorming session. Our video is an outcome of imagining a creative act that was impossible to be carried out, no matter how much effort people had put in to make it happen.\n\nIn 2015, most of the conversations are still carried out between humans. However, I believe that in the near future, more and more people will be accustomed to communicate with a machine (i.e. Artificial Intelligence). That is the moment when a kind, interactive artificial sapience needs to come on stage to hold hands with humans, and to form a good relationship with them. Such vision of the futuristic world is the kind of dream that Doki Doki wants to create and to be part of.\n\nAs you have probably realised already, in this video, Baby is only having a small conversation with the doctor and the housewife. In order to carry out such communication method with a computer, people still need to physically face the computer and to control the conversation themselves.\n\nWith Baby, we want to replace such tedious act with a casual chat. When the time comes, I believe that nurturing the individual value and life will be more appreciated than how efficiently you can handle a computer. When I think about it, the availability of the first generation computers was limited to specialists only. This shift (shift of computers becoming more available to wider range of people) seems only a natural progression to me.\n\nFor example, with cars, there was a time when only professionals were allowed to ride them. From now on, robots and drones are going to replace various types of occupation. Artificial Intelligence is going to encourage human progress even more, and will relief people’s burden by absorbing daily routines. Baby, a kind computing system that is able to have a natural conversation, might be able to take in all the knowledge that scholars possess, only to free them to the world.", 
        "title": "All you need is a conversation. – World Wide Cloud Baby –"
    }
]