[
    {
        "url": "https://medium.com/machine-intelligence-report/deep-learning-playbook-c5ebe34f8a1a?source=tag_archive---------0----------------", 
        "text": "Machine learning is the art and science of making predictions based on previous observations. Deep learning without doubt is THE hottest subfield of machine learning and it is ubiquitous in various state-of-the-art methods for problems like speech recognition (audio), object recognition (vision), natural language processing (communication). People are studying this technique and try to reveal its potential in all kinds of applications from finance to medicine. I believe you can only understand a learning algorithm and know how to use it by hand coding the program and running it on real data. I also believe an easy-to-follow learning path is necessary to keep you motivated and continue. To help those who are interested to know and use deep learning in their problems, I curated a minimal list of resources based on my own learning experience to get your hands dirty on deep learning quickly without being distracted by the flood of materials online. I wouldn’t be surprised if you find some other lists (such as this) that contain much more resources than this one, but again, my goal is to help you get started in a more focused way.\n\nIt’s recommended that you follow the materials in order: 1) gain basic understanding of deep learning (model structure, objective, optimization); 2) pick up a tool/framework and familiarize yourself; 3) dive into real problems by exploring and playing with open source projects.", 
        "title": "The Deep Learning Playbook – Machine Intelligence Report –"
    }, 
    {
        "url": "https://blog.hyperverge.co/a-beginners-introduction-to-deep-learning-820787ad61ad?source=tag_archive---------1----------------", 
        "text": "I am Samvita from the Business Team of HyperVerge. I joined the team a few months back to help out on User Growth, PR and Marketing. From when I first heard about HyperVerge, I had one question — What is this deep learning that everyone keeps talking about?\n\nIt’s being touted as the next big thing, and it pretty much already is. I know what you’re thinking now, “Oh no, yet another article talking about how deep learning and Artificial Intelligence is the next big thing. Haven’t we heard enough about the same thing? Tell me something new already!”. At this point, let me reassure you that this isn’t yet another article. I’m not a techie with background in CS or Machine Learning. I’m just as confused as you are about what deep learning is. Now you’re probably thinking “What?! You’re a part of a deep learning startup and you don’t know what it is?”. Well, you’re right. Partially. I know what deep learning is from a very superficial, application-driven angle (speech recognition, image recognition, self-driving cars, Siri, Cortana and so on), but I don’t know what deep learning really is.\n\nBefore I joined HyperVerge a little over 6 months ago, I had a rather vague and superficial understanding of what AI was. I had minimal exposure to Machine Learning but Deep learning was a completely alien concept altogether. When Kedar first told me that the team here worked on deep learning with images, it sounded like some very complicated computer science and mathematics theory. Sensing my poorly hidden confusion, he showed me a couple of demos of the technology and explained a bit of it in some detail. I realized these guys knew what they were talking about, even though I didn’t understand the technology fully. It all seemed very interesting and I was excited to be coming on board the team.\n\nAfter coming on board the team, I figured I would gradually get to understand what deep learning really is. Contrary to my thoughts, that didn’t happen in the first few weeks. Discussions with the computer vision team always centered on the final outcome of a particular tech module, and there was never really the time to delve into the nitty-gritties of how things worked. Curiosity gradually got the better of me, and I decided to understand from my colleagues about this whole deep learning thing. I didn’t want anything in-depth, just some basic introductory material that explained how exactly deep learning worked. After a surprisingly minimal amount of pestering, I managed to gather together a good set of resources that help the average person understand what deep learning is. I would like to share them with you, I’m sure you’re just as curious to know what this is.\n\nDisclaimer: The links provided in this article have been taken from various sources, and are not the property of HyperVerge. The resources might not be the best out there, but they are the best we’ve found that explain the relevant topics well. The observations noted are also of the author’s alone, and are not necessarily academically correct.\n\nFor starters, a great introduction to deep learning is Dr. Andrew Ng’s lecture at the GPU Technology Conference 2015. Although a bit on the longer side, he explains deep learning quite beautifully and it is worth every minute of the watch.\n\nIn Dr. Ng’s lecture, he explains that at the crux of deep learning are these neural networks. To understand what a neural network is, I looked up a few introductory videos and articles. I’ve shared the few I found that explained neural networks in the simplest manner.\n\nThis video offers a very simple explanation of what neural networks are.\n\nThis is a good post that has more of a mathematical approach to explaining neural networks — still pretty basic and easy to understand though.\n\nNow that I have understood what neural networks are and how they work, the next step to demystifying deep learning is figuring out Machine Learning. Machine learning uses a whole bunch of different methods to perform different tasks, with neural networks being one of them. While there are surely a number of good resources out there to learn machine learning, my colleague Prasanna swears by Geoffrey Hinton’s Coursera lectures. I’ve put the introductory video here, and it gives a fairly good idea of how neural networks are used in Machine learning. To truly understand how it works though, one would have to complete the course.\n\nThis is an article that explains what machine learning is, although it doesn’t focus on neural networks. Nevertheless, it is a good one!\n\nFinally, to understand how neural networks translate to deep learning, there’s this fantastic project by Michael Nielsen. The project is in the form of a book, and the first chapter is the right go-to resource for neural networks and deep learning.\n\nI hope this has a been a useful few links and you now know a little more about what deep learning is. I certainly do, and things make much more sense now!\n\nTo really learn about deep learning and become a self-proclaimed expert, check out these excellent online courses:\n\nGeoffrey Hinton’s course on neural networks for machine learning\n\nMichael Nielsen’s course on neural networks and deep learning\n\nStanford’s course on convolutional neural networks for visual recognition", 
        "title": "A Beginner’s Introduction to Deep Learning –"
    }
]