[
    {
        "url": "https://medium.com/@brucerobbins/a-very-good-guide-with-some-good-pointers-to-other-material-5c2586f2aec2?source=tag_archive---------0----------------", 
        "text": "A very good guide with some good pointers to other material.\n\nDeep Learning for J one of the best documented toolsets, has use cases and very good background information (it is mentioned in the Vikram’s article as a tool but the documentation alone is worth reading).\n\nThe Brain vs Deep Learning Part I: Computational Complexity — Or Why the Singularity Is Nowhere Near This article places the the notion of AI in context, the whole blog is compulsive reading.\n\nNeural Networks and Deep Learning a free book, very clear and complete.\n\nHow machine learning builds your applications for you a shameless self plug.\n\nNeil Lawrence, University of Sheffield — Deep Learning in Healthcare Summit video explaining Deep Learning in practice.\n\nProf. Andrew Ng: \"Deep Learning: Machine learning via Large-scale Brain Simulations video about Deep Learning and image recognition, I still find it exciting", 
        "title": "A very good guide with some good pointers to other material."
    }, 
    {
        "url": "https://medium.com/@shyamal_chandra/biz-the-future-is-not-simple-262f975ac4b2?source=tag_archive---------1----------------", 
        "text": "Biz, the future is not simple. I disagree. Have you written an NLP or ML or deep learning algorithm from scratch that is breaking past the state-of-the-art in terms of benchmarks and metrics? Where is your citations and data to back up or buttress your claims? You just use buzz words without any details, even high level. This is not hard-core journalism, this is heavily-biased marketing without the sources. Where’s the bibliography?", 
        "title": "Biz, the future is not simple. – Shyamal S. Chandra –"
    }, 
    {
        "url": "https://medium.com/@TheBrianHogan/sun-gazing-day-five-695d04ad0767?source=tag_archive---------2----------------", 
        "text": "Today all three of us were together again for the gazing. Nikki and I introduced Brett to our grassy mound and we all settled in for the near minute of gazing. I forget to mention that our grassy mound is covered in cacti and passion fruit vines, but I became fully aware of that fact this morning as I pulled my sock off and smashed the bottom of my foot into a cactus pedal. At first it felt like a mild prick but then I looked down and found twelve, count them, twelve long prickers sticking out of the bottom of my foot. That’s when the panic set in. I began to yelp in horror and grabbed Nikki’s shoulder because I couldn’t set my foot down until I had pulled all these monstrous earth daggers from my sole. A few of them even drew blood. Once my foot was clean, and Nikki and Brett were done giggling at me, I set it trepidatiously on the earth, ignored the mild sting to my body and my ego and got ready to greet the sun. Brett told me later that it must have been the acupuncture that I needed. I could have accu-punched him in the face, I’d prefer to have my acupuncture done in a cozy room with candles, incense and a nice lady playing gregorian chant as she gently warns me before every needle goes in. The cactus had absolutely no bedside manner.\n\nOnce the fifty seconds was over I blinked myself back to earth, wiped the lubricating tears from my brightening eyes and let out a refreshing breath of triumph. Nikki and I looked over at Brett who was still motionless, wide eyed and hooked in. I told him to stop and he said he could go longer. I told him how the sun was addicting and he just said good with a shoulder shrug and wouldn’t or couldn’t look away. I saw him experiencing today what I went through on day three, the sun pulls us in and says in a warm tone “make yourself at home.” And that’s just what Brett was going to do. After a few more seconds he heeded our admonitions and broke his gaze.\n\nThe sun has us hooked. Brett describes the initial few seconds of the gaze as an intense brightness that suddenly explodes outwards in a ring far around the glowing ball and then disappears, leaving a gentle globe of fluttering candle light behind that becomes easy to stare at. He describes his excitement to me because everything he has been hearing about the gazing has proven true in the first week and first minute. It does get easier. It is possible to gaze deeply at it. It does charge your emotional body with excitement and bliss. And so the expectation of where this potential can take us is limitless, it stretches as far out into the universe as the sun’s light stretches out to us. Brett and the sun are in a courting phase. The sun is wooing him and he is being wooed. I catch them stealing glances at each other throughout the day, and on occasion he sheepishly confesses to me that he peeks at it even at high noon and any chance he gets.\n\nSeeing their love affair validates my own journey. The gnawing feeling that I am being totally, hilariously, crazy is undercut by my two gazing partners, who approach this experiment with a merry childlike wonder and faith that strengthens my own. When I entertain thoughts of how dumb this all is, or how it puts me on the fringes of society, I just remind myself that society is currently insane and I’ve been having more fun out here on the fringes than I ever did when I was chasing the typical American dream. I’m chasing my own dreams now, and you just can’t put a price on that.", 
        "title": "Sun Gazing: DAY FIVE – The Brian Hogan –"
    }
]