[
    {
        "url": "https://chatbotslife.com/a-short-guide-to-learn-neural-networks-and-get-famous-and-rich-then-bf7da3cba76f?source=tag_archive---------0----------------", 
        "text": "I am pretty sure you have heard that Artificial Intelligence(A.I.) is doing everything cool in our days, it helps create artwork, fights to cure cancer and disrupts world economic.\n\nFrom the money perspective A.I. on the hype as well: investors are investing into A.I pretty active, and news about startups acquired by enterprises are coming everyday.\n\nThere are many of learning resources available at the moment. If you plan to dig to A.I. more fundamentally, instead of briefly visit neural networks, I am a huge supporter of a book by Russell and Norvig which covers most of the modern approach to A.I.\n\nThere is a pretty good neural network course on coursera just started(28 of November, 2016), which could be useful if you are a newbie in the area.\n\nIf you are hearing about neural networks nowadays, most likely you are hearing it in a context of deep learning.\n\nDeep learning, — as it stated in wikipedia, is — a branch of machine learning based on a set of algorithms that attempt to model high level abstractions in data by using a deep graph with multiple processing layers, composed of multiple linear and non-linear transformations. In other simple words, deep learning advance.\n\nA more advanced approach to neural networks could be found at\n\nI would recommend a fancy paid course if you would to get course that worth it.\n\nThe state of computer vision is extremely strong. There are a lot of experienced professionals in the field, great papers, crowded open source projects. But most importantly, it had a crazy number of venture capitalists want to fund you. Computer vision has never been a hotter topic in academia and industry alike.\n\nMost of a modern computer vision is driven by deep learning, all this coloring, video object recognition and labeling is performed by deep learning approach to computer vision.\n\nOne the top person in modern computer vision/deep learning is Andrej Karpathy, who is famous for winning computer vision competitions, creating models and evangelize deep learning for computer vision. I am totally recommend Karpathy’s Stanford course:\n\nAlso, following course is comprehensive:\n\nPersonally, I am a huge fan of curated ‘awesome list’, here are some deep learning lists, but I am sure you can google much more of them:\n\nIn the past, there were not much options for teams to experiment and run neural networks — you had to pay crazy amounts to Amazon or even to tradition servers farms. There are a plenty of options in nowadays.\n\nIf you are just starting to play in neural world, take a look at Hetzner used hardware auction.\n\nIf you going to production, I would suggest a top choice for A.I. cloud by servers.com.\n\nI have no doubts, if you would built a valuable A.I. product you have a problem with choosing a proper investors among many of them knocking your door everyday.\n\nThere are a long-long list of investors looking for A.I. startups. If you are European based, I would suggest to take a look at Haxus.", 
        "title": "A short guide to learn neural networks, and get famous and rich then."
    }, 
    {
        "url": "https://medium.com/@sankam/the-next-phase-for-project-vaani-628b5cae314a?source=tag_archive---------1----------------", 
        "text": "Earlier this year at Mozilla, we moved Project Vaani into a prototyping phase with user trials. We collected valuable feedback around product concept and design, as well as validated our assumption that a voice interface would help create a faster, easier and unconstrained way of doing things. This solution was designed and built around the users’ lives, as opposed to the service providers’ business interests. With that validation, we decided to focus on implementing the core voice technology components that everyone (Mozilla, as well as partners and the community) could use in their projects.\n\nWe also found that current market solutions offer speech recognition by using cloud based solutions which lead to privacy concerns. Such solutions also need investments in cloud infrastructure. We believe creating an offline solution that can be embedded in other applications and low-footprint devices would be essential to avoid these issues.\n\nWith that, the next steps identified are as follows:\n\nDeep-Learning based Online Speech Recognition\n\nIn the past ten years, Deep Learning has revolutionized numerous fields: natural language processing, image classification, automatic translation. Recently, Speech recognition has also benefited from the research in this space. Over the past few months, Mozilla’s deep-learning team has been using Tensorflow to build a speech decoder based on the findings in Baidu’s Deep Speech published research paper. The paper claims to be able to achieve a high accuracy by using a bidirectional recurrent neural network (BRNN) to ingest speech spectrograms and generate English text transcriptions.\n\nThis project will produce a Speech-To-Text (STT) engine, requiring a server class machine with an adequately powerful CPU, GPU, and memory. Once the model is trained, we plan to use Tensorflow serving to query the model without the high resource requirement. This will pave the way for creating the offline solution noted below.\n\nProject PipSqueak — Offline Local Speech recognition \n\nProject Pipsqueak is a client-based offline STT engine that targets devices with a smaller footprint (e.g. RPi 3 and Android phones). Based off of Google’s research in this area, the idea is to reduce the neural network model by quantization and a SVD-based (single value decomposition) compression technique. Reducing model size, we’ll be able to translate speech to text on small footprint devices removing the need of having servers and an internet connection to have accurate speech decoding. Once implemented, Project Pipsqueak could be embedded in other platforms and applications, such as Firefox or connected devices.\n\nProject Voicebank\n\nProject VoiceBank enables our community of volunteers from around the world to “donate” their voice for creating a public corpora that includes variety of languages and accents. This public resource will be available for all open source voice interface projects to help everyone build inclusive technologies that work for all. The Project VoiceBank team will be kicking off this project at the Mozilla Work Week in Hawaii in December 2016.\n\nArchitecture / Code Samples / Repos can be found here.", 
        "title": "The next phase for Project Vaani – Sandip Kamat –"
    }
]