[
    {
        "url": "https://medium.com/@gavinkeen/cost-of-operational-complexity-in-pallet-pooling-793bf2e720db?source=user_profile---------1----------------",
        "title": "Cost of operational complexity in pallet pooling – Gavin Keen –",
        "text": "The issue of pallet control was discussed in Control, the black art of pallet pooling and the importance of asset utilization in Asset-turns in pallet pooling, whats the magic number?, I thought it might be useful to illustrate the different kinds of operations you would consider to support your material choice.\n\nRepair rates over an 8 hour shift will vary between 80–240 pallets depending on pallet design, average damage rate and targeted pallet quality standard.\n\nThere will be variations to the manual repair process from company to company. Some companies will incorporate an element of automation in a manual repair process to maximize operational efficiency.\n\nInitiation start up costs are low and repair cells can be scaled up based on repair volumes.\n\nIf repairs are based on a piece rate or man hour target, harder repairs generally tend to be left. Repair quality will vary from repairer to repairer based on experience & training.\n\nAutomating the pallet repair process like in the example above you can achieve 1,000 pallet repairs with 2 robots in an 8 hour shift with a single operator.\n\nAutomating the repair process ensures consistent repair quality across every repair. Not being selective and paid on a piece rate every pallet requiring repairing should be repaired positively impacting overall pool utilization.\n\nPlastic pallet washing systems are customized to specific requirement with some solutions able to achieve in excess of 1,600 pallet washes in an 8 hour shift.\n\nWashing plastic pallets and RTP’s under the same roof brings additional operational and logistics synergies.\n\nBroken plastic pallets can be regenerated into new pallets. Manufacturers would normally have a buy back policy in place paying up to 50% of the original purchase price.\n\nAs with wooden pallets, not every plastic pallet requires to be washed. Only pallets with a specific HACPP requirement based on the application they are being used for."
    },
    {
        "url": "https://medium.com/@gavinkeen/spotlight-on-south-africa-grocery-retail-market-c01a7f07b6d5?source=user_profile---------2----------------",
        "title": "Spotlight on South Africa Grocery Retail Market – Gavin Keen –",
        "text": "#South Africa, the third largest economy in #Africa by value, is a country blessed with an abundance of natural resources & phenomenal beauty. Despite being behind Nigeria & Egypt, South Africa’s infrastructure and #supplychain maturity is decades ahead of both.\n\nWhilst the economy may have originally been built on the resources of mining and agriculture, its economy has diversified considerably. Mining of platinum, gold and chromium, car assembly, petroleum refining, metalworking, machinery, rubber goods, textiles, iron & steel, chemicals, fertilizers, food processing, paper & paper products, tobacco make up this diversity.\n\nWith a population of approximately 55 million people, a rapidly growing middle class and a robust democracy the future for South Africa looks extremely bright.\n\nSouth Africa’s grocery #retail supply chain rivals anything I have seen in Europe, US or the Middle East. Key players like #Shoprite, #Spar and #PicknPay have invested considerable amounts of money in their supply chain infrastructure and #technology networks to bring the lowest cost to a market of price conscious consumers.\n\nThe market is split into 2 distinct channels, formal and informal, with the formal accounting for over 60% of the total estimated US$ 32 billion grocery retail value in 2017.\n\nGlobal brand names like, #Unilever, #P&G, #Nestle, #Mondalez, #Coca-Cola, #Pepsi, #Parmalat, all have local production operations competing against well established and recognized local players like, Pioneer Foods, Clover, Tiger Brands, Tongaat Hullets, Nola, Rainbow to name a few.\n\nThe Modern Trade retail landscape is essentially dominated by the top 3 players, Shoprite, Spar and Pick n Pay, collectively making up almost 65% of the total market value. Combined these 3 players own or operate over 1,25 million square meters of #distribution space servicing approximately 6,000 stores across all retail formats from convenience, supermarket, discount, hypermarket to online.\n\nShoprite has invested over R 40 billion over the last 24 years into 750,000 m2 of centralized distribution space, handling over 85% of the total goods and services sold through their 2,698 retail outlets, racking up 1 billion customer transactions in the process.\n\nShoprite is the Every Day Low Price retail leader in South Africa and will continue to invest to maintain its low price leadership.\n\nWith the South African economy facing headwinds, price will be a key differentiator for Shoprite. Linked to this, cost management and improving supply chain operations will remain high on the agenda, despite their investment in centralized distribution centers.\n\nStrong focus and emphasis on growing their #private-label brand contribution to total revenue today at 14.7% to the global average of 18.5%.\n\nContinued expansion will remain a theme for Shoprite, although the majority of the new supermarkets planned for the short term will take place outside South Africa. They already have established operations in #Zambia, #Mozambique, #Angola and #Nigeria being first mover in most.\n\nThe retailer’s multi-format strategy enables it to target a broad range of shoppers and locations. The opportunity to ‘upgrade’ successful Usave stores to other banners provides Shoprite with the chance grow basket sizes in the long term.\n\nPick n Pay has seen the benefits of consolidating and centralizing their operations given the impact that Shoprite has had on the market by following this type of strategy. Pick n Pay has seen volumes moving through centralized distribution centers increase from 43% in FY14 to a target of 65% by the end of the current financial year.\n\nPick n Pay’s recent results have underlined the positive effect of this investment and the implementation of a turnaround strategy.Following a period of good sales growth the retailer has said it is set to move onto Stage 2 of the plan, entitled ‘Changing the trajectory’.\n\nThis will see the roll out of its next generation store design, which will see an increase in the size of the fresh department, more space dedicated to fresh, convenience and private label products and a reduction in the breadth and complexity of some ranges.\n\nPick n Pay has stressed, though, how next generation stores offer a far better utilization of space, with less required to be given over to storage. This is freeing up space for them to stock a broader product offering, such as adding store-in-store apparel, wine and health and beauty departments.\n\nImproving its perception with shoppers has seen Pick n Pay invest in prices and implement its Brand Match scheme, while its Smart Shopper loyalty programme, has bolstered this campaign\n\nWith over 5,000 suppliers and service providers, 1,300 SPAR branded products SPAR’s focus is on supporting and nurturing new independent retail stores by providing centralised buying for core ranges and rolling out best practice examples.\n\nSPAR has over 250,000 m2 of centralized distribution space across South Africa handling approximately 230 million cases of product through them in 2017. SPAR’s strategic focus for 2018 is to continue expanding their warehousing and transport network to support their independent store owners with better product prices and bigger choice.\n\nAn element of this will be on helping store owners to target local shoppers to help them differentiate from rivals and grow loyalty.\n\nAt a category level, SPAR will continue to focus on initiatives to drive its fresh and home meal replacement offerings. Store expansion and existing store revamps will continue to play a role for SPAR in the medium term.\n\nDue to the competitive market environment, SPAR will drive price perception with shoppers by publicizing its private label ranges, through targeted and an on-going roster of promotions and the roll out of its loyalty scheme, MySPAR.\n\nSPAR store owners will be able to add footfall driving brand extensions — such as Pharmacy at SPAR or Tops! liquor stores — and services — like money transfers or the chance to pay bills — with the liquor stores set to play a strong role for store owners in driving profitability at a total operational level.\n\nDespite what the mainstream media may report on South Africa or Africa for that matter, as the country and continent goes the opportunities are vast and significant.\n\nWhilst South Africa’s retail and supply chain landscape may be the exception in Africa, the rest of Africa is catching up, and catching up fast enabling companies that are taking the initiative to enter them. First movers taking full advantage of these untapped markets and the competitive edge this brings with it."
    },
    {
        "url": "https://medium.com/@gavinkeen/asset-turns-in-pallet-pooling-whats-the-magic-number-18e449387a86?source=user_profile---------3----------------",
        "title": "Asset turns in pallet pooling, whats the magic number?",
        "text": "As we saw in Control, the black art of pallet pooling, creating the right control environment, JPR was able to contain pool losses to an impressive 0.2% of Annual Pallet Issues.\n\nWith just over 4 Asset Turns per year this loss rate equates to JPR losing just under 1% of their total pallet Asset Stock or approximately 2.5% of it’s annual revenues to fund replacements.\n\nLooking at the level of control within JPR’s business I suspect that they utilize 6 sigma as standard practice.\n\nWhilst Control Ratio can be likened to a pooling company’s burn rate, Asset Turns is its life blood.\n\nIn the world of equipment pooling, Asset Turns equals time, time in pooling equals money and the difference between profit and loss.\n\nBudgets, sales funnels, pricing models, direct / indirect cost structures, CAPEX allocations are all governed, influenced by assumptions related to time and timing.\n\nThe quicker the assets cycle, the higher the revenue per asset, resulting in faster payback periods. The quicker the asset cycles, the less assets are required, which means less CAPEX to fund & support the business going forward.\n\nAs elementary as the above sounds, this however, is the Poolers Dilemma.\n\nTo try and illustrate the above statement, below are 2 simple scenarios that demonstrate what impact improving overall Asset Turns might have on a theoretical pallet pool.\n\nIn Scenario 1 all metrics across the 3 year window remain constant.\n\nKey take outs from Scenario 1 above:\n\nIn Scenario 2 we look at what happens if Asset Turns improve due to an assumed improved asset management focus but metrics related to loss and growth remain constant with Scenario 1.\n\nKey take outs from Scenario 2 above:\n\nThere are hundreds of variations that you can play around with and in significantly much more detail. Applying theory is always a useful exercise but the real litmus is trying to benchmark performance against market related data.\n\nFor example, the table to the right summarizes the unweighted results of a 2016 Global Inventory Benchmark Analysis conducted by a market insight company to try and understand what are the number of inventory days of stock by category held across the various grocery retail supply chains.\n\nThe numbers raise some very interesting possibilities and opportunities.\n\nIf you were considering entering pooling with the FMCG segment in mind, then your success or failure could come down to simply a choice of which category you elect or not elect.\n\nAs a new pooler, from the above table, the obvious choice could be the Fresh & Chilled and Frozen categories given their extremely short cycles which could yield the fastest payback periods. As both are temperature and possibly impact sensitive, in terms of solution positioning, think about differentiation against what is a currently in play today. Ask the question if total end to end visibility is important across the entire supply chain. If it is and that requirement is not being met today, the technology and means exists and you have your differentiation.\n\nIf I was already in this pooling space, I would be interested if I actually measured Asset Turns by category and if I did how do I fare against the above cycle times?\n\nIf I didn’t then I would try and understand how this could be achieved. Once I have data sets, focus would shift to where and how I could improve any inefficiencies identified to maximize my overall ROA."
    },
    {
        "url": "https://medium.com/@gavinkeen/control-the-black-art-of-pallet-pooling-bc8d7a843e7?source=user_profile---------4----------------",
        "title": "Control, the black art of pallet pooling – Gavin Keen –",
        "text": "John Stuart, owner of the Melbourne based consultancy firm Pallet Loss Prevention Pty Ltd, fittingly summarizes the problem related to pallet pool management in the Australian market that can be easily applied everywhere:\n\nWhoever assumes the financial risk for pallet loss, pooler or customer, as this will vary from market to market, choosing an US$ 18.00 wood asset over a US$ 45.00 plastic one, for example, in light of the above is not a difficult one for any Financial Director.\n\nBut as we have seen in the Japan Pallet Rental (JPR) article, The Holy Grail of Plastic Pallet Pooling , it is possible to get an almost zero loss rate across tens of millions of pallet movements, suggesting that creating the right control environment material choice is irrelevant. The decision for either, wood or plastic, would be motivated by the degree of operational complexity you want for your business.\n\nWhilst the demand for plastic pallets in Japan was primarily customer driven. JPR in addressing that need may have inadvertently reduced a significant portion of the direct cost structure normally related to supporting a wooden pallet pool. Something that Svenska in Sweden and NLP in Norway may also be benefiting from, combining the operational wash processes of their plastic pallets and RPC’s under the same roof.\n\nThis would be a topic for a later article.\n\nThere are hundreds of variables and factors to consider when selecting the right material for your pallet pool, based on my experience, it invariably comes down to two key critical elements namely:\n\n1. Understanding your customers total end to end route to market\n\n2. Understanding the impact of asset turns and it how affects your total business\n\nIn this article I will focus on the first element and discuss the second in a follow up post.\n\nThe responsibility, pooler or customer, for pallet recovery from the end of any supply chain will vary from market to market depending on what business models are in play.\n\nHowever, when the onus is on the pooler, the success of any recovery program comes down to how well you know your customers’ total supply chain and how well you are operationally positioned to support it. With the right data sets and scenario planning tools you have the ability to simulate multiple scenarios. This is incredibly powerful in determining how to position and price your solution against the alternatives available in the market.\n\nStarting at the end of a customers supply chain and reverse mapping all flows to the point of origin I believe is too often a neglected part of the typical sales process. Emphasis directed at securing the points of production (Revenue) whilst the same attention is not given to the points of consumption (Control & Risk).\n\nI opinion that this was one of the contributing reasons for iGPS’s failure. Their primary focus directed at converting manufacturing customers and not fully understanding the reverse logistics complexity, cost and risks that came with winning them.\n\nHaving an intimate and detailed understanding of your targeted markets entire supply chain from the beginning is critical to the future success of any returnable packaging solution, pooled or non-pooled.\n\nKnowing what are the total number of ship to locations and where are they relative to the initial points of issue, will provide context as what kind of transport and asset management network needs to be resourced and developed. This also provides insight into where to position your plants or consolidation centers.\n\nKnowing what is the level of cooperation at the end of the supply chain related to pallet management & control will provide perspective where the risk of loss lies & what strategies you could devise to either enhance cooperation or mitigate risk.\n\nClearly understanding the unit and aggregate costs of the above will assist your decision for which material to invest in. This will influence the type of operation and infrastructure you would need to invest in to support that material choice."
    },
    {
        "url": "https://medium.com/@gavinkeen/big-data-in-pallet-pooling-big-opportunity-big-bucks-f1c47a88676?source=user_profile---------5----------------",
        "title": "Big data in pallet pooling, big opportunity, big bucks!",
        "text": "Courtesy of an article by Tamara Dull, SAS Best Practices, Big Data & IoT, she posed the following questions to help understand the difference between the two:\n\nAnswers to the questions above: Big Data — 1&4, IoT — 2&3.\n\nStaggering, the future scenarios presented above not only in terms of the amount of data that is likely to be generated but the insight that businesses can acquire about themselves, their customers and their competitors.\n\nBig Data & IoT is creating a significant amount of noise and rightly so. Industries across the spectrum are jumping on the bandwagon and investing heavily in an attempt to predict what the impact will be to their business, how to leverage this technology to their advantage and most importantly how to monetize it going forward.\n\nBASF, founded in 1865 is a €58 billion industrial giant employing 114,000 people across the world & Ahrma, a 2014 Dutch SMART returnable packaging startup, is a perfect marriage of old world capital meets new world technology.\n\nBASF collectively gaining through the sale of their polyurethane spray system Elastocoat® as part of the Ahrma pallet production process & harnessing real time supply chain insight through the deployment of the Ahrma pallet across their various business units. If ongoing pilots are successful new revenue streams through pooling is a future possibility. BASF already having an established global footprint is strategically well positioned to enter this multi-billion dollar market as a serious contender.\n\nAhmra’s promotional video, complete with Morgan Freeman (not 100% sure it was his soundalike voice over), Meet the FUTURE, is a very compelling vision of where the world of returnable packaging is headed. The dynamics of supply chains evolving daily with increasing demand for total chain of custody visibility.\n\nWhilst returnable packaging, particularly pallets, may not change that much dimensionally, given well established standards around the world, I predict there will be a major shift in material composition.\n\nWood, whilst still very much the material of choice for pallets both pooled & non-pooled, will be replaced once adoption of this technology gains traction across the greater supply chain.\n\nThere is no reason why wooden pooled pallets cannot incorporate this technology as part of their make up, but the inherent flaw in wooden pallets is their susceptibility to damage and continuous requirement to be repaired. This shortcoming can be avoided through the use of plastic, eliminating a significant amount of logistical inefficiency in the process.\n\nNot having ever seen one of Ahrma’s pallets physically I am really in no position to understand how it would perform under the rigors of continuous use and reuse in a dynamic application. Having seen the visual deconstruction of this pallet, I am not fully convinced that it will hold up in a number of supply chains, beverage for instance where cycle times are short & equipment touch points many. I do look forward to seeing the results of the ongoing pilots if ever published.\n\nHowever it’s more the technology that is embedded inside the pallet where the real attraction lies. If their technology is anything that it promises to be, Ahrma Technology White Paper, then I think their business model should be focusing on developing their transponders and cloud software to the point where they can be incorporated into any returnable packaging solution that requires that level of supply chain visibility.\n\nThe symbiotic partnering between BASF and Ahrma lays the groundwork on the question of material choice for a pallet pool, wood or plastic, in the new normal, that I will explore in the third installment of articles related to the subject of So you want to build a pallet pool?"
    },
    {
        "url": "https://medium.com/@gavinkeen/customer-lifetime-value-is-the-imperative-of-pallet-pooling-6c1f248b1990?source=user_profile---------6----------------",
        "title": "Customer Lifetime Value is the imperative of pallet pooling",
        "text": "Continuing on from my previous article “So you want to build a pallet pool?”, the focus of this article shifts to helping companies understand how,\n\nis a very useful exercise in determining where to deploy your human & financial capital for any existing or new pooling company.\n\nCLV is an estimation of the TOTAL value a business will/could derive from their entire relationship with a customer.\n\nTaking CLV into account can shift how you think about customer acquisition. Rather than thinking about how you can acquire a lot of customers and how cheaply you can do so, CLV helps you think about how to optimize your acquisition spending for maximum value rather than minimum cost.\n\nWhen applied to pallet pooling, for example, this means that 80% of revenue can be attributed to 20% of customers. While the exact percentages may not be 80/20, it is still the case that some customers are worth a whole lot more than others, and identifying your “All-Star” customers / market segments can be extremely valuable to your business & future growth strategy.\n\nA fishing analogy is also a nice way to illustrate the CLV concept.\n\nFor the last 4 years I have travelled to Lake Kariba in Zimbabwe to try & catch my first Tigerfish. Regrettably I am yet to succeed, but the pursuit continues. Kariba is abundant with a host of other fresh water species far easier to catch, but the legendary & elusive Tigerfish, is the hardest fighting game fish and the most ferocious freshwater species in the world. The time, effort & skill required for one Tigerfish photo trophy, personally, outweighs the satisfaction of landing a dozen of the more common variety.\n\nAssuming that acquiring pallet pooling customers is like fishing. You might go fishing, for example, in the FMCG Manufacturing Sea, or the Retail Private Label River or the Beverage Lake.\n\nUnder a cost minimization strategy, the results might look like this:\n\nYou might think that the FMCG Manufacturing Sea is the best because it gets you customers for the lowest cost, but looking at Customer Acquisition Cost is only half the equation.\n\nYou also need to consider that the lifetime revenue of customers from each of these channels might be different.\n\n* Profit is defined as Revenue — (number of customers × CAC). For the sake of this exercise, it does not take into account other costs.\n\nWhen you consider not just the acquisition cost, but also the value the customer will bring to your business, your acquisition strategy can be fine-tuned & result in better customers for less money.\n\nCLV allows you to focus your energies on solving the problems of improving product/market fit, making your customer acquisition repeatable, scalable & most importantly profitable.\n\nMost new pallet pooling companies generally are a copy & paste of established poolers with little differentiation.\n\nProduct, price, value proposition, across most are all similar, pallet color for the most part the only distinguishing difference.\n\nMotivation for any prospective customer to switch providers in the current context invariably comes down to hard cost savings but given the operational disruption related to changing providers, sometimes savings in themselves are not enough justification to make the move.\n\nRather customers want products that solve their problems beyond moving the price a few basis points down.\n\niGPS, for example, their only REAL differentiation to the competition was that they offered a RFID enabled plastic pallet.\n\nWhilst they caused a significant amount of market disruption, they were not financially or operationally geared to compete on a like for like basis with either pooled or recycled wood pallets. The costs to support a one-way trip pooling model in massively dispersed geography like the US were always stacked against them.\n\nWe can only speculate but had iGPS followed a CLV process, as in the example above, whether they might have considered that Retail Private Label channel could have been a better point of market entry as opposed to pursuing the FMCG Manufacturing channel.\n\nUnleashing their asset capability through the deployment of RFID technology at targeted retailer DC’s, providing real time product & asset visibility across a select number of product categories might have incurred a higher CAC, but they could have created a very unique solution compared to what was available in the market at the time that would have yielded significantly more profit. Differentiation that could have been leveraged & scaled through an articulated competitive strength.\n\nRetail Private Label being customer specific supplied from dedicated contract manufacturers with significantly less complex supply chains than your typical FMCG Manufacturer just might have been the way to go."
    },
    {
        "url": "https://medium.com/@gavinkeen/so-you-want-to-start-a-pallet-pool-6bf2bd8f942e?source=user_profile---------7----------------",
        "title": "So you want to start a pallet pool? – Gavin Keen –",
        "text": "Who would have thought “so who do you work for?” could be such a difficult question to answer.\n\n“CHEP who?”, would normally be the standard response. “What do they do?”\n\n“In a nutshell, they’re an equipment pooling company. They rent out returnable packaging to thousands of companies around the world.”\n\nThat’s about the time panic sets in and that they wished that they hadn’t asked the question & start looking for the nearest exit or familiar face to latch onto.\n\nThere is no elevator pitch for equipment pooling. Trust me I have tried them all.\n\nI would jump in with; “Have you ever seen those blue wooden pallets hanging around your supermarket, actually coming to think of it the ones that your company also uses?”\n\n“How do you make money from renting out pallets?”\n\nThat’s when I look for exits or a familiar face to latch onto.\n\nThe world of equipment pooling for most people is an enigma, far less known than the Bank of International Settlements.\n\nPooling despite it’s perceived dullness is an incredible business. I thoroughly enjoyed the challenge of building pools in Africa & Middle East over the last 18 years. It has the ability to touch almost every market & industry segment. The addressable market & opportunities available remain significant. Far greater than the total combined value of all the major players currently in play today.\n\nHaving a passion for the business & a continued interest in helping companies break into or grow in this space I thought I would write a series of articles on how I would tackle such a challenge.\n\nArticles that will cover the Why, Where, What, Who, When and How.\n\nDespite it being an incredibly complex, variable driven web of a business to the outside world, when looked at from a logical & methodical perspective, it is actually a very simple business to understand & master.\n\nPlus you get to see how Fry’s Turkish Delight is made!"
    },
    {
        "url": "https://medium.com/@gavinkeen/the-holy-grail-of-plastic-pallet-pooling-e96f4da4ede5?source=user_profile---------8----------------",
        "title": "The Holy Grail of plastic pallet pooling – Gavin Keen –",
        "text": "Reading packagingrevolution.net, article from February 2017 on Japan Pallet Rental (JPR) provides some very interesting insight & compelling information that plastic pallet pooling is commercially a viable proposition even across a fragmented & mature FMCG supply chain like Japan’s.\n\nIt was interesting to read that the shift to plastic was primarily customer driven recognizing that plastic pallets, operationally performed better than their poorer wooden cousins. JPR responded accordingly & whilst their business model, one might argue mirrors CHEP, is unique in a number of ways.\n\niGPS should have spent some time in Japan.\n\nJPR’s website provides an interesting glimpse into their operational model. JPR directly operating 15 depots with repair capability whilst outsourcing collection & consolidation to approximately 230 exclusive agents & 3rd party providers across Japan. Strategically looks like a good structure as core activity & IP is retained in house with non-core activities outsourced. Outsourcing non-core across a number of different service providers enables JPR to benchmark performance.\n\nNot having sight of JPR financials but relying on the information provided in both the article & their website the following high-level assumptions can be inferred.\n\nA pallet pool is 8.6 million strong split 65% on plastic (5.6 million), 30% wood (2.6 million) & 5% (300k) on “other” material.\n\nTheir plastic pallet has a unit cost of US$ 70. At this cost it would appear that they are produced from virgin PP & PE. With only 18 kg’s of plastic in each pallet, price compared to what is available on the market today I think looks a little premium.\n\nNo pricing information on the 1100 x 1100 wooden pallet but based on pallet design & timber costs I would guess in the region of US$ 20.00.\n\nUS$ 52.00 being the approximate blended pallet unit cost.\n\nAnnual sales revenues of approximately US$ 200 million yields a revenue per pallet of approximately US$ 23.00. Suggests a straight-line payback a little over 2 years. Considering 65% of their pool retains up to 40% as bankable residual value, an impressive payback metric.\n\n37 million pallets issued annually puts average revenue per issue at around US$ 5.40. A reasonable trip cost by all accounts on the basis that their business model looks like its 100% one way trip pooling.\n\nThere will be some skewing of the numbers based on revenue contribution from other product & services that they provide, but I suspect this is marginal business for them.\n\nTheir Plant-Plant cycle time comes in at 85 days.\n\nTheir control or flow through ratio at 99.8% is mind boggling incredible. A 0.2% leakage rate (74k pallets) in a dynamic pooling model is world class.\n\nTechnology is the key enabler here. Smarting up a dumb asset JPR has a significant advantage over traditional pooling companies that rely on customer interfaces for asset flow visibility, not always reliable & almost always retroactive.\n\nValuable lessons to be learnt from JPR’s journey. At face value JPR looks like they have a truly remarkable business & I would love to get under the hood for a closer look."
    },
    {
        "url": "https://medium.com/@gavinkeen/the-age-old-question-plastic-vs-wood-pallets-aeac88c78c17?source=user_profile---------9----------------",
        "title": "The age old question: plastic vs wood pallets – Gavin Keen –",
        "text": "Reading packagingrevolution.net article there are 3 trends that I potentially see developing in the pooling world.\n\nAt the fundamental level pooling is typically a local or regional activity.\n\nBrambles, for example despite having a global footprint, very little equipment synergy exists between their various continental operations due to legacy standards established in each over time.\n\nLoscam focusing on Asia Pacific, PECO on the US market, LPR & IPP Logipal on UK & Western Europe.\n\nContinuous improvements to RFID, similar technologies, the adoption of IoT across supply chains, together with advances in plastic sciences will see barriers to equipment pooling reduce & become much more accessible for smaller players to enter at both the local & regional level.\n\nNew names have arrived in the last couple of years, Royal FloraHolland, Contraload, Orbis, PoolServices to mention a few. All carving out niche segments of the market or trying to differentiate their products & solutions against traditional poolers beyond the price point.\n\nPlastic packaging manufacturers are also now looking to get into pooling. Setting up plastic pools is becoming easier & easier. Molds are easy to move & contract manufacturing exists in most countries .\n\n2) The sharing economy is here to stay\n\nThe concept of regional cooperation & collaboration particularly when it comes to pooling equipment is not a new phenomena. JPR in Japan has longstanding similar agreements with players in Singapore, South Korea, Taiwan, China, Thailand, Philippines, Vietnam, and the United States of America.\n\nThis enables smaller pooling players to operate across larger geographies without necessarily requiring the need to invest significant amounts of CAPEX / OPEX to support growth objectives.\n\nIt’s only a matter of time before the “Uberfictaion” of pooling arrives. The missing link up until now has been the technology piece. Transponders & cloud computing is the new frontier. The elements of product, hardware, software & insight will unleash a plethora of smaller, leaner & more agile players that have the ability to adapt the every changing dynamics of the supply chain environment.\n\nCompanies such as Ahrma Pooling are providing a glimpse of what could be possible to forward thinking companies. A collaboration, for example, between DHL & Ahrma has the potential to seriously disrupt the market as we know it today.\n\n3) Plastic is going to replace wood\n\nA contentious & ongoing debate about the merits of both, pertaining to the environment, health & safety & cost.\n\nDespite the argument that wooden pallets are inherently better than plastic pallets it begs the question why is plastic the material of choice for RTP’s / RPC’s by pooling companies over wood? They are essentially exposed to the same supply chains, operating & warehouse environments but for some some reason are ever factored into these debates? The debate rages on, both sides taking to academia to defend their positions.\n\nModelling like for like suggests that plastic wins hands down every time, from static, to captive, to dynamic business models. Key differentiation between the two being costs associated with maintaining a wooden pallet pool. Wood at the onset from a unit cost perspective is cheaper than the equivalent plastic pooling pallet, that’s a given, but the costs associated with keeping that wooden pallet productive over its life is where it comes apart.\n\nWooden pallets definitely have their place across a number of specific industry verticals & business models where route to markets are complex & dispersed. Pool shrinkage is inevitable regardless of material type but even despite the industry norm associated with losses plastic still holds the edge.\n\nMaterials science in plastics continues to evolve to the point now that high performing plastic pallets can be found at cost ratios of 3:1 but with significantly longer life expectancy when you factor in the repair material component required to maintain or sustain wooden pools.\n\nPlastic also eliminates the need to invest heavily in service center networks required to support wooden pools. Plastic pallet pools could in theory be coupled with RPC / RTP wash plants at both retail site or close to retail sites which could reduce or eliminate a number of logistics legs associated with managing wooden pallets. Pooling companies spend an incredible amount of money trying to find the “perfect” locations to establish plants that optimize the cost of balancing flows from the point of issue to the point of return.\n\nPlastic pallets retain a large portion of their cost as “true” residual value which can be realized through buy back recycling programs with packaging manufacturers. As demand for recycled plastics continues to increase residual value over time could in turn increase positively impacting ongoing financials."
    }
]