[
    {
        "url": "https://synecdoche.liber118.com/hylburt-speys-cd574abfa611?source=tag_archive---------0----------------", 
        "text": "The clients waved me over, near the tap. Three founders, whom we’ll call “Alasdair”, “Fuentes”, and “Chen”. We ordered that pint or two at the tap and found an open table. Above the pub chatter we began exchanging minutiae about our favorite UK brews. Alasdair did much of the talking initially.\n\n“Certainly you’ve heard of our upcoming Brexit II vote?” Alasdair asked. “Belters, what a done deal. We’ve given it 4:1 odds of passing.”\n\nI cupped my ear, trying to hear him. Nodding enthusiastically, while struggling to translate what Alasdair seemed to consider conversational English. Did my best to look amazed, feeling thoroughly confused by both UK’s dialects and politics. In retrospect what he said was startling, contra to almost all prevailing analysis.\n\nThe pub had a Lumo projecting interactive graphics. A pair of nishiki koi swam across our table in video, then down across the floor. One could grab a ghostly brocaded fish to signal the bar keeper for a food menu.\n\nVirtual fish bubbles and more banter spilled into our beers: Trump and shootings in the US, Fuentes’ kiteboarding trip to Saipan, deep learning used to augment VR drone racing (Matt!) upcoming at the next Burning Man. Current debates between Java becoming the new COBOL versus embracing the twenty first century with Scala. Usual stuff.\n\nAbysmal. Yet more crazy-making, which was rapidly becoming par for the course. Sadly. Nasty targeted advertising, nasty retro start-up with nasty dinosaur tech leads, and an uber-nasty general manager who seriously needed to be on meds. We’d agreed on scheduled deliveries in our contract, for which SkyBraynz was way ahead. Now she was not only breaking contract but escalating, trash-talking about us to other customers — was that even legal?\n\nI drew a deep breath and closed my eyes, hoping it looked like a longish blink. Trying not to get upset in front of these three. Make it seem like jet lag or fatigue. Or something. I recalled my mantra of harmless names to call people who made me angry, selecting a good one: inconvenient fire drill. One of my favorites. Picture the words, silently, taking a deep breath. Repeat three times.\n\nNo way that James had said “vacation” to the monster, just no way. He knew about the problem. Not much I could do tonight without stirring up even more trouble. That was the monster’s pattern: construct situations where any reasonable response would get spun all black-and-white, in favor of the emotional reasoning employed. Crap, crap!! Time for another mantra: itchy sweater, or decaf white choco vegan mocha? Both. Pictured, breathed, repeated.\n\nMy long blink gave way to a grimace, fading to a dull stare. I watched non-existent koi shimmy between our pints — until Alasdair’s brogue began to chip its way back through.\n\nConversation at our table had shifted toward a particular streaming use case. They’d mentioned corporate activism as their domain area without going into detail. Tossed out numbers as a target SLA.\n\n“Your company holds the world speed record for training neural networks at scale?” Alasdair nudged me. “Pure gallus, by the way.”\n\n“Or London.” Alasdair traced the path of a virtual fish with his finger. “Say you wire up that SkyBraynz with the framework we use to indict the most boggin, houghin bummers? For fun and profit o’ coorse. Largest virtual assassin in this world, pointed at the usual mingin. There’s an infinite supply but.”\n\nAwkward, per my attempted translation: Alasdair rollin’ white n’ nerdy. Chen didn’t move much, though now she turned to glare at Alasdair. Fuentes winced and set down his Buxton Rain Shadow. He held out a shiny, stainless steel tally counter, staring directly into Alasdair’s eyes and pressing CLICK!\n\nI pushed for more details, trying to gauge the three.\n\nAlasdair shook his head between slugs. He described their origins as a company, Hylburt-Speys. Spin-off from a highly successful law firm in the US. Plaintiff trial lawyers, he explained, who’d earned the moniker “Corporation Killers” for ample reasons.\n\nA gaggle of suits were playing a different Lumo game in the back. Someone kicked a projected garden gnome image — from the floor, halfway up the wall, sliding over a dartboard — just as an opponent tossed a dart and pinned said gnome to the bullseye. Bells and whistles erupted, with a few suits gloating loudly. I paused for noise to die back before trying to talk.\n\nAlasdair didn’t answer. Instead, he threw me tech questions. Each more specific than the last: fault-tolerant idempotent updates, how to manage systemic back-pressure with reliable receivers across a wide range of sources upstream, decentralized online learning algorithms based on GPUs. A flurry of approaches for compression and overall speed-up. What was my take on latest best practices, off the shelf or purpose-built, for each category?\n\nAnother commotion in back peeled away my attention. Lumo games made that entire rear wall — minus the dartboards — appear like one big mirror. I kept nodding in cadence along with Alasdair’s tech mansplaining, while studying the wall. Probably an array of LCD screens? The “reflection” showed current players in the dart/gnome game transformed to have AR animal heads. Slogans ran : “an entirely new kind of toy” or “stick your head in a beaver” — as tickers scrolled across an inactive corner.\n\nSkyBraynz could enhance that interaction so much. Would be fun to use DL to learn player moves, preempting them with cartoony beasts. Couldn’t be a huge range of type body movements? Given some player log data, a neural network could start learning to anticipate people. Most people, probably. Must make a note to reach out to the Lumo founder.\n\nAlasdair hesitated, exchanging glances with his two partners first. “Essentially a set of complementary businesses in a fankle, feedin’ jujubes tae the parent law firm. A streaming app coordinates blether amongst said. All loosely coupled and specifically not in the US: hedge fund based in Asia, a German PR firm, competitive intelligence services out of Latin America.”\n\n“A globalized supply-chain, if you will.” Alasdair grinned. The other two nodded in agreement. “O’ coorse they’re most certainly legal in their own jurisdictions. The possibility of said houghmagandy owing to deregulation, globalization, trade agreements, the Internet, etc. Full Bhoona. Overall strategy flanges snuggly into TPP, TTIP, and so forth.”\n\nOutside the gatehouse, a pair of mimes had caused a stir. They flew a drone constellation in a funnel-shaped formation — not particularly unusual, except that their tiny drones were built from toy sharks. Sharknado, here live on the garden path of Euston. More performance art, welcome relief against a backdrop of bombings and violence.\n\nAlasdair paused to watch the street theatre, sipping his brew. Fuentes nudged him on. CLICK! again on the tally counter.\n\nAs the story unfolded, a streaming app used blockchain to create a distributed ledger — what Alasdair had mentioned about integrating the companies. Only the parent firm had complete details for any particular operation. Real-time analytics plus a healthy dose of deep learning applications throughout. Alasdair seemed especially chuffed about the DL, chugging his Kentish Pip when he’d finished.\n\nFuentes tore in. Double CLICK on the counter. He seemed more of a business guy, less tech geek. A jock, more or less. He rattled off numbers about debt versus revenue, margins, EBITDA averages across sectors. Huge fan of Carl Icahn, shareholder activism, old school corporate raiders back in the 80s, etc. OTOH, their team had tracked developments in agile software methodology, distributed systems, micro-payments, blockchain, probabilistic programming, AI, etc. “We had a hunch there’d be considerable long-term benefits by applying more advanced technologies, less heavyweight approaches. Think: Goldman Sachs meets Glassdoor.”\n\nNearly blew a sip of Schiehallion out my nose. AI, blockchain, and Goldman Sachs in the same breath. Begeezus!\n\nDefinitely. Less potential complications for everyone involved. They’d kept a minuscule footprint in media, having almost no public presence on the Internet. “Even so, we would like to see some independent analysis circulate, especially for our data analytics approach.”\n\nFuentes was pitching. Possibly for hiring purposes, one might imagine. Most of this kind of work was way too obscure for tech recruiters to field. I could craft an article about DL that put their work in a good light. Probably enough to attract some reasonably good candidates.\n\nThey agreed, one minor scowl by Fuentes notwithstanding. Holding out his tally counter. Another CLICK, slowly. It’d be okay, pending his approval of my final draft.\n\nBottom line according to Fuentes: “Many, many American companies are exposed, albeit in small, highly distributed ways. With machines we can use data mining to isolate those weakness points.” Weaving together non-intuitive strategies that resulted, statistically, in large payouts. Yada yada. Some new twists, but with a summary punchline that almost everyone else used. Change the world.\n\n“You’re a right numpty!” Alasdair raised his glass to toast that tagline. I’d guessed somewhat correctly how they must be big fans of the notion of exponential organizations. Though it wasn’t clear whether they wanted to become an exponential org, or just enjoyed feeding on them.\n\nBloody hell, as I guess Brits would say. Early afternoon on the Eastern Seaboard, typical timing for the monster’s melt-downs. Also time for a mantra: unnecessary movie sequel. Breathed, repeated, forwards and back. Should I contact James for advice? Would that somehow seem weak or indecisive to an investor? Didn’t matter, the conversation at hand was much more important and finally digging into details.\n\nFuentes had been explaining a geopolitical backdrop that permitted Hylburt-Speys to exist. “Financialization following the 2008 global crash drove many large companies to stockpile cash. Most of it distributed throughout tax havens internationally. Some companies had even gone into debt rather than tap their cash reserves directly, which could trigger taxable events. Federal monetary policies meanwhile made the constellation of cash hoarding, complex debt strategies, and stock buybacks progressively more attractive.”\n\n“Even some tech start-ups in Silicon Valley followed this pattern,” Alasdair added. “That made firms vulnerable. Though the cash mostly got used for share buybacks and dividends — appeasing the activist shareholders.”\n\nI got the point, in spite of the swirl of brews and jet lag. Mounting debt made firms doubly vulnerable to raiders, at least the kind who could leverage machine intelligence.\n\nFuentes continued, not amused. Ignoring my remark. “The parent firm invested significant efforts into root cause analysis across their history of trial outcomes. They paid other law firms for access to trial data, similarly mining for root causes.” He made three loud CLICKs on his tally counter.\n\nThey’d built machine learning models to characterize outcomes, segmenting opportunities for litigation. That project evolved into an AI system wired into financial data services, news feeds, social media, etc. Purpose-built to identify and assess potential defendants.\n\n“Partners in the law firm didn’t want to wait for clients to approach them with cases. They sought to identify high ROI opportunities in advance. Then cherry-pick the best, targeting proactively.” Ergo their “Corporate Killer” nickname.\n\nAnother missive arrived in text. An image sent from the monster that took a few moments to render. A comic with a character jumping, arms up, yelling “WooHoo!”, accompanied by:\n\nMust. Ignore. Crazy-making. The baiting. Felt like how I’d imagined the aftermath of a subway bombing. I resolved to not panic and carry on, recalling Brits pouring briskly into the open courtyard at Euston, past the turnstile construction and police barricade. Rubbed my eyes, then let a long sigh escape.\n\nAlasdair started, but Fuentes interrupted with yet another CLICK. “Several reasons,” he said, staring down Alasdair. “Mostly concerning how to push risk to the edges of our supply chain. The parent doesn’t own controlling interest in any one component business — just enough for significant influence.” Yeah, the notion of ownership works differently in other countries. As I’ve been learning recently.\n\n“Also, regulatory environments within the US weren’t stable enough. For example, in a hedge fund operating in Singapore they hold less than 50% and aren’t considered decision makers. Minimal liability. The SG government rarely inquires about our fund’s business activities, most of which involves trading neutral bonds. That makes the fund look relatively vanilla.” He seemed to speak like a third grade teacher explaining division.\n\n“We provide the funds with lists of desired trades — shorts, mostly — to transact whenever their risk/reward simulations evaluate as neutral or better in upside.”\n\n“Neutral or better upside for a fund. Those trades accomplish goals directly for the parent firm.” Then a CLICK for me.\n\n“If they place an identified trade within its specified time window, we pay fees plus credit the fund with tokens.” Fuentes seemed annoyed. Four CLICKs, pausing in-between each. Then a long stare at me. Plus one more CLICK. “Accumulate enough tokens, they qualify for more debt financing from the parent. More money to play with. A bond’s activity is neutral for the hedge fund, but we’ve added shape to markets.”\n\n“Look, Finance is only one aspect, what the markets allegedly believe.” Fuentes was now talking down to me, a programmer. “Marketing is another, what the public tends to believe.” CLICK. “There’s a third component, competitive intelligence services out of Costa Rica — what a company believes about itself.” He paused to sip the Rain Shadow, then CLICKed again. “Together those represent something we call the ‘Three Legs of the Stool’ — namely Finance, Marketing, Intelligence.”\n\n“No, not enough leverage there. We’d tried that already.” Another CLICK. “It’s basically what everyone else does. Remember the AIs we use to cherry-pick defendants?” Fuentes was gesturing a little too profusely. He bumped the table and Chen’s ale spilled.\n\nFuentes leaned back. “Perhaps we are chasing the wrong tiger.” He put his tally counter back into a coat pocket, shooting a quick glance at Chen. Then back to me, squaring off: “Look, are you even interested in working with us?”\n\nMachine learning models had identified common theme among the parent firm’s more successful cases. “Our AIs identified how violence in action and speech had become considered a moral good in the corporatist workplace. Once that reached a point of being perceptually conflated with background violence in US cities, we had our weapons of choice ready.”\n\n“So the system targets managers in companies, managers who create actionable legal violations. Or at least perceived ones.”\n\nMore infuriating noise from the rage monster. I invoked the sun glare when I’m driving just before sunset mantra for this one. Which definitely would require a call with James. He’d made the original customer intro, then I’d worked with Optimiumly founders to improve predictive models for their ad network.\n\nThen they’d hired the monster — poached from our previous employer, and promptly anointed in charge of the SkyBraynz project. After which the whole thing started to cave. At this point we probably spent 20–30% of the billable hours just untangling all the rumors, accusations, and FUD that spewed from the monster.\n\nEnough of that, must focus. Fuentes was on the fence, right when this gig began to sound interesting.\n\n“This is why we need you.” Chen spoke for the first time. Deadpan, turning her head to look at my phone. Ignoring her Wild Swan that Fuentes had spilled, as Alasdair wandered off to fetch another round from the tap. I grabbed one of the koi, thinking that we should at least eat some food. Then asked:\n\n“We read Hacker News and Reddit. More specifically, we build AIs to scan the entire category.” Chen was nothing if not precise. “Your framework replaces Monte Carlo methods with reinforcement learning. Already doing that for your Shenzhen client?”\n\nFuentes cut in before Chen could start. “We don’t hunt people. We look for favorable situations, then reshape likely outcomes to become even more favorable for our business objectives.” The tally counter reemerged from his pocket, then another CLICK.\n\nA bar keeper brought us a menu. Chen and I agreed on Scotch Eggs. I felt a deep need for food — the beer was clearly talking on my behalf as we started our second round.\n\nFuentes rolled his eyes and leaned back from the table. Three CLICKs.\n\n“Americans mind the spondoolies,” Alasdair offered. “Results. Money. They’ve built company cultures tae select for wud. Narcissists, histrionic personality disorders, borderline cases, all the drama. These represent far far too many of yer leaders in business.”\n\n“Ho, here fannybawz, stap yer havering. You bloody well know what I mean. Leaders who lash out with rage, accusations. Execs dismiss that as competitiveness, all quite properly American.” Alasdair looked slightly miffed. “Here’s a problem: yer people feel surrounded by violence, news about police shooting people of color, people shooting police, riots, random gun spray. Then they go off and work, where managers lash out, pretendy as doolally drill sergeants. Skivers an’ knapdarloch. Breaking the very same senses us humans evolved tae steer clear of the seriously radge.”\n\n“Mad rockets. Crazies. Steering clear of that lot overlaps with how we’re wired to notice DSM–5 personality disorders. The very same whom we promote through corporatist ranks.”\n\nAnother text blipped in from the monster, who’d apparently begun contacting our engineers directly. Upping the ante. Something else that I couldn’t quite parse, about calling James to insist on a reprimand for one of our engineers in particular. Seriously crazy. My mantra selection: squeaky grocery cart. Long deep breaths.\n\nChen answered me instead of Alasdair. “Simple. Drawing similarity between DSM–5 and full psychopaths was considered red herring in court. It was assumed people didn’t encounter dangerous psychos or seriously threatening situations often enough to pose valid arguments.” She blinked. “That changed in 2016. High streets and undergrounds in America now seem to mix battlefield with psychiatric ward.”\n\nI was perplexed, fatigued, and probably still thinking too much about the monster. Rage breeding rage.\n\n“We litigate against companies when enough employees feel threatened at work. Because managers acting out in rage, acting perceivably crazy. Legal tests for that have shifted recently. Maybe more unhinged due to enduring pressure of economic downturns. In any case, lawsuits on behalf of employees can be quite lucrative.” Chen was adamant. Uncharacteristic for the hour plus that I’d known her so far. “Especially on contingency terms. Especially when we pinpoint pressure on key executives.”\n\n“Plus hedge fund, pressuring finance departments. Plus freelance executive recruiters, spreading rumors. We can pretty much ruin any board meeting.”\n\nFuentes pulled a few sheets of folded paper from a notebook, handing them to me. A4 dimensions looked odd. For that matter, their printed letterhead looked oddly archaic. Definitely not a DocuSign. “I believe these terms are far more favorable than what your friend in China has offered?”\n\n“We ask for 20%, preferred, one board seat.” After his second pint Fuentes seemed all-business. He seemed more comfortable that way. “With this cash infusion you’ll have both runway and reserves to expand. Plus a guaranteed level of monthly consulting hours.” He sipped more Buxton brew. “Game?”\n\nChen stirred. “What we want your machines to dream for us. ‘The future belongs to those who believe in beauty of their dreams’ — Eleanor Roosevelt.”\n\nAnother text came in. This time from Bobi, one of our best AI engineers.\n\nBobi wasn’t going a day without work in this market. Nobody would be getting fired. Period. Even so, we couldn’t afford to lose her. Much less afford to have her distracted right now because of the monster’s machinations. We needed code, lots of great code. I invoked another of my favorites mantras: overdraft bank fee. Especially good mojo in that one. Texted Bobi, pouring my heart out trying to reassure her. Promising to send her grandmother a gift. Then back to Chen:\n\nChen blinked again. As if donating a poker tell on my behalf.\n\nAlasdair stared down his empty tumbler. Glaring at it. “Parent firm has convolutional neural networks in place for its AIs — skoosh. Hedge funds run themselves a bajillion MCMC simulations daily. Our competitive intel people use those thingmies too in prototypes — the recurrent neural networks. All bogies coordinated via blockchain. Why not distribute that learning across? Heid Bummer of AIs that’d be! Dogs baws, if you ask me.”\n\nThe money would help. Though it sounded a little too good to be true. A carrot with no stick … yet.\n\nMy turn to buy a round, so I wandered off. Following koi as they shimmied across the floor. Trying not to think about the mess back at the office.\n\nMade a detour toward the loo. Pub tables and their high seats scattered along one side of a wide hallway. I noticed board games on most of the tables, stopping to glance at one in particular. Almost like a Scrabble board, using small lettered blocks to spell words. However, unlike Scrabble, it had geometric patterns strewn at odd angles across the background, and strangely unfamiliar characters. They looked vaguely Art Deco, though more ornate. Some kind of symbols. Like a tripping typographer’s attempted prank to forge coded manuscripts from the Renaissance.\n\nI hadn’t noticed a person sitting near the table. She turned her eyes slowly away from the symbols, gazing fiercely up toward me. The old woman from the park, with her red shawl strewn over the opposite seat. She smiled lightly, then quoted another line from Shakespeare:\n\nMore cosplay — almost intimate, awkwardly, with a hint of transgression in her voice. I rushed off, not knowing how to respond. Embarrassed. Heading on toward the loo. The patterns of blocks that she’d spelled out stuck in my jet-lagged mind.\n\nWhen I returned to our table, Fuentes seized his fresh pint and glared at me. CLICK! I imagined carrots morphing into sticks. Perhaps it was the beer dreaming? “Let’s be clear,” he started. “We’ll need some measure of your commitment.”\n\n“See, this is what I mean.” Fuentes pushed away from the table and wandered off in a huff. CLICKing several times over his shoulder without even bothering to look back at me.\n\n“Nae bother,” said Alasdair. “A wee bit pished and off to the bog. Quite thankfully before he rifted a honkin air beige out his Jacksy for us all to share!” And drunken grins.\n\nJust then two of the suits from the back came chasing a garden gnome across the pub. Pushing each other, as if they were dribbling the ball down-field in a football match. Some kind of sports-ball. Or something.\n\nAnother text from Bobi. Totally freaked out. The monster had lashed out at more of our engineers –\n\nCRASH!!! One of the suits landed atop our table. Pints spilled, glass shattered. Imaginary koi swam away in fear.\n\nAlasdair fumed, “Awa, yi glaikit bastirt!” Phrases seemed emergent, newly formed like flowing lava. The suits scrambled to full attention, apologetic in a way that only British people seem to know how to do. Offering to buy us another round, in earnest.\n\nMy phone had fallen in the scuffle, sliding across the floor toward where Chen stood away from the table. She picked it up, staring at the screen for a moment.\n\nThe old woman with the red shawl brushed against me as she hurried toward the gatehouse doors. Turned to wink. I stared, but then Chen nudged my arm. Offering my phone with two hands outstretched. Blinking.\n\nFuentes returned, asking about the commotion. Then stomped off with the suits to order our compensatory pints. CLICKing his tally counter under their noses with a glare. Alasdair tailed them, not quite finished fuming.\n\nChen got busy on her tablet, typing rapidly. She stopped for a moment, staring at her screen. Nodding quickly. “Please,” she asked, “have a look.” Handing me the tablet.\n\nThis time I blinked. Their law firm had a précis about the monster, in full detail. Already a long list of complainants giving what appeared to be depositions. Some of whom I recognized from our previous employer. Then risk estimates, a correlated graph of confidants and “enablers” along with links to bios for each. Also something about a bench warrant for outstanding traffic tickets?\n\n“This person is already among our high ROI targets,” Chen blinked again. “Merely matter of time before pre-trial gets green light.” She shutoff her tablet quickly as Fuentes and Alasdair arrived back with our fresh pints.\n\nI wanted to recover our business conversation. Viable terms for working together seemed a distinct possibility.\n\n“Small but nonintuitive social networks,” Chen explained. “Most DSM–5s that we profile have enablers.”\n\n“Generally, someone in an executive role,” Fuentes interjected, “who keeps them properly shielded from blame. Entangled in so much business value that everyone must overlook the toxicity to the company culture. The value prop is to pressure the apologists with tangible business risks, albeit with methods arrived through covert means.”\n\nFuentes received a call, walked off to find a quieter spot. Twirling his tally counter with three fingers.\n\n“Ever so properly entangled up in their shuches,” Alasdair mumbled. “Right, we’ll be doing quantum physics next.” His gregariousness had soured noticeably since the table crash, and with that his brogue thickened. “Dinnae get Fuentes started aboot that!”\n\nChen confirmed about connected component analysis, adding that Fuentes nurtured rather odd beliefs about quantum physics. That encompassed aspects of the occult, along with their team’s place in the world. I struggled to follow — something about superposition, entanglement, wormholes. A vague equating of “black magick” with black holes, again more about the wormholes and ceremonial rituals. Where a Renaissance cult of early physics and math geniuses had made advances into quantum mechanics. Faint echoes of those early advances passed down to us half a millennium later as rumors about ritual magick. Their wizardry for bending time and space having been lost in a second Dark Age — which we now rather perversely called the Enlightenment.\n\n“He’ll have some cailleach appearing all ghostly above a loch, amidst incantations and cantrip but,” Alasdair sounding decidedly more inebriated now, sleepy. Almost nodding off.\n\nChen and I changed the subject as Fuentes walked back, counter firmly in hand. We talked more through the use case, though the table conversation began to wane. Fuentes grew more interested in texting. He’d pull out the tally counter, check numbers on his phone, then text. Truly weird guy. Alasdair trailed further off, kept looking toward the back of the pub. Fuming still, between nods, as if he wanted to start a fight. Or sleep. Probably both.\n\nAfter we finished the round, I made polite excuses to leave. Jet lag, my talk early in the morning, etc. Fuentes pressed me to consider their term sheet carefully and get back to him as soon as possible.\n\nRetracing my path back through the Underground, just well enough to find my hotel. Then found my room, found my key card, collapsed on my bed.", 
        "title": "Hylburt-Speys –"
    }, 
    {
        "url": "https://medium.com/autonomous-agents/part-2-error-analysis-the-wild-west-algorithms-to-improve-neuralnetwork-accuracy-6121569e66a5?source=tag_archive---------1----------------", 
        "text": "Wyatt Earp was the most famous lawman in the Wild West who is glorified beyond means for his abilities as a fearless gunman. He may not have been the quickest draw in the west, but was the most deadliest of his times. It has been stated that he often used to quote:\n\nNeural Net training is a bit like the wild west. The errors are quite lawless and unhinged. They can behave erratically without rules, rhyme or reason. The best way to arrest and stabilize a model is to get a hang on accuracy first as against trying to focus on training speed.\n\nIn the previous post “Part-1: Error Analysis…” we learnt about different components of error and the respective error scoring methods. In this post, we are going to learn on how to improve upon these errors. Specifically, we are going to focus on accuracy.\n\nWe learnt that accuracy is a proximity of the predicted values to its true values. The equation for accuracy is:\n\nAs per the equation, the way to increase accuracy is to increase the true-positives and true-negatives over the total population.\n\nNote that the sum of total population is a given. As in, you do not have much wiggle room to reduce the total population by only training your Neural Nets on ‘Relevant’ items (or the positive set of a feature). Especially in a multivariate binary classification, the number of not-relevant items shall always be higher than the number of relevant items.\n\nIn other words, In the wine dataset, if you have 3 mutually exclusive class into which a wine can be classified, then the positive set shall always be 1 and the negative set shall always be 2 per wine (One of three classes is positive, 2 of 3 classes are negative). The negative set only increase as the number of classes increase for mutually exclusive multivariate binary classification.\n\nSo the only way to increase accuracy is to increase the true-positives and the true-negatives.\n\nIn the previous post, we analyzed the accuracy measure during validation (on the validation-set, not during training), after the network was fully trained. This is not a great place for error analysis if we do not know what was the accuracy of the network on the training set.\n\nLet me alter the wine tasting example a bit to walk you through the new observations.\n\nFirst I shall reduce the number of epochs to 25 and 1 iteration per epoch as follows:\n\nSecond, I shall comment out a important section of the code where I was using a regularizer (which I shall explain shortly) and momentum-value as follows:\n\nNow, I shall use a dip-stick to evaluate the wine tasting Neural Net model on 2 things.\n\nThe code for the changes is as follows:\n\nWhat I am doing here is print two different evaluation measures, one measure shall display the accuracy of the model on the data it was recently trained.\n\nThe other shall display the accuracy for a validation data-set that was NOT used to train the model. The idea of prediction is to predict good results on the NEW set of data which was NOT foreseen during training. (What good is a model otherwise?)\n\nThe results are as follows:\n\nNotice that the accuracy of the model to predict the data that was seen during training is far higher (0.9304) than its ability to predict data for not foreseen data (0.6508) !! Now, you are wondering, what the heck !! Right?\n\nIt’s simple. The network is “Memorizing” the data from the training set here. So whenever you run a sample prediction on the training set, the network performs well (from memory) but it is not able to accurately predict new dataset from the validation set.\n\nTo understand, overfitting, let’s look at the following depiction:\n\nThe first graph depicts a “Linear Regression” or a function that is asked to learn the total weights of all the points in the subspace and draw a best fit “line”. Of-course, we know that linear regression models are not great when it comes to multivariate binary classification problems. It’s only used as a reference graph for explanation. So this graph is useless beyond showing us a hyperplane division of the data cluster (don’t worry about hyperplanes for now).\n\nThe third graph depicts a polynomial function, that fits all the data points perfectly. This curve has memorized the underlying data-points as against learning anything about the underlying function of the subspace.\n\nThis curve is nearly useless in predicting where to plot a new data-point for a new input (x axis) in the feature subspace. Does the curve extend upwards? Should it drop back down? Should it plateau? Nothing. Zilch. This curve is overfitted.\n\nThe second graph is more interesting and intuitive. It seems to have learnt the underlying function of the subspace as against trying to memorize where the data-points are ! So given a feature input (on x-axis), we can intuitively state that the next data point as x-progresses can be plotted in the direction (upwards) as the function climbs. This is very useful for prediction.\n\nThe best possible way to identify overfitting in your Neural Net models is to plot a graph of accuracy for your training-set and validation-set data over number of iterations for the model.\n\nIf the validation set is not able to catchup with the training-set as illustrated, then you have a overfitted model.\n\nThe technique to break overfitting or memorization of the network is called “generalization”\n\nThere are umpteen number of ways to improve generalization of the Neural Nets. While I had provided a high level overview of generalization in the previous post titled “Is optimizing your Neural Net a dark art” which provides some key techniques, I shall focus on Weight Penalties, Early Stopping and using Weight Constraints as a generalizer.\n\nOne of the techniques used to generalize a Neural Net is to regularize. Regularization is function introduced to the loss function of the Neural Net. We add a Regularization term R(f) to the loss function to prevent the coefficients to fit perfectly.\n\nWe can decay the weights either by using a L1 or L2 regularization term added to the loss function. While an L1 regularization decays the absolute value of the weight, the L2 regularizer decays the squared weights.\n\nHere, we have added a weight penalty on the absolute value of the weight to the cost function as illustrated. This can be broken down as follows:\n\nUsing L1 weight penalty, when cost is zero, the weight can get to zero. This way many weights can get to zero and introduce sparsity in the network. This limits from having many large weights. L1 regularization helps in regularizing the network from perfectly fitting the feature vector. Instead, the network learns the feature vector more generally.\n\nAs noticed, the L2 regularizer penalizes the squared weights. The idea here is to keep the weights small enough, but not to let it slip to a zero. This keeps the network dense (unlike L1 weights which introduces sparsity).\n\nIn L2 regularization, when cost is zero, the weight gets a very small value. The beauty of the L2 regularizer is that it smoothens the output by changing the outputs much more slowly as input grows. The main difference between a L1 and L2 regularizer is as follows:\n\nNotice, in the code, I have used a L2 regularizer with the lambda of 1e-4 as follows:\n\nHere is the output on the validation set after using L2 regularization in the cost function:\n\nHence, proved… (It helps to keep the lambda between 1e-2 to 1e-6).\n\nAnother technique is to stop as early as possible during training before the network starts memorizing the features. This keeps the network semi-trained and hopefully general as against memorization. To understand this, let’s take a look at the error curves below\n\nThe y-axis is the prediction error, and the x-axis is the number of iterations. One of the ways to regularize a network is to “visualize” the prediction errors on one of the error measures (Either accuracy, recall or the overall performance measure, the F1 score) and stop the training of a network at a particular iteration or a epoch when the error scores starts to degrade.\n\nThe visualization is a cumbersome method, instead, you can use a model measure tracker which can keep track of the validation error w.r.t the training error on every iteration (mini-batch) or epoch and compare the measure with the previous iteration. If the error continues to improve then you continue with the iteration. As soon as the error starts to degrade, you can terminate the learning.\n\nSince I am using DL4J in the examples, It is prudent to point to the DL4J documentation which has a nice write on Early Stopping > here\n\nThe other technique is to use a weight constraint on the weights as against using a weight decay in the cost functions.\n\nThe constraint can be set on how large the weight is allowed to go. Usually, the best weight constraint is to clip the weights to the length on the vector of the incoming weights. The equations is as follows:", 
        "title": "Part-2: Error Analysis — The Wild West. Algorithms to Improve #NeuralNetwork Accuracy."
    }, 
    {
        "url": "https://medium.com/@hadrielle/linkedin-or-the-art-of-pretending-to-be-an-expert-46083b052600?source=tag_archive---------2----------------", 
        "text": "Long time no write. Been really busy learning some stuff @ku_leuven. Will try to write a couple posts later to finish explaining both my experience in Leuven, and to write a bit of my thesis on Natural Language Inference.\n\nBut, not today! Today is about LinkedIn and their inhabitants. LinkedIn, as you know, is a social network that used to be some serious deal, and right now seems more like the playground of recruiters posting their complex mathematical problems that if you solve, you are a genius.\n\nPart of being in social networks, is being in groups, were amazing content is posted and everyone in these groups are experts.\n\nI came across this article. I couldn’t resist to read it (not that I tried hard or anything), as an eager learner that I am. Also the Venn diagram is wonderful, isn’t it? And because I just had my first coffee of the morning, I’m going to use a few minutes commenting on the article.\n\nBefore starting, I’m no expert in the matter, so forgive me god/good people of the internet, but I’ll be commenting on the article.\n\nI will be using the text from the post as is, so no misinterpretation can happen.\n\nRock solid start. I mean, I’m no expert but, Quora sometimes has some questions that perfectly answered, and I have found some very well written explanations. Btw, shoutout to the Q&A sessions from Quora, latest I read from @fchollet, some interesting questions, with really interesting answers. (I think this is the first time in this post that I’m being serious). But I know I know, Quora is quite new in the internet, and stackoverflow doesn’t solve these tricky questions, let’s check wikipedia. I know wikipedia is not the way to go but, here is another link.\n\nTo read a bit more about it, found really useful this. But some insight about the discussion can be found in this NVIDIA post, you know, the guys who build the GPUs so we can play videogames, errr train deep networks. I really meant train deep networks. Let’s move again to the article.\n\nWell, I’m sure I gave some explanation about it, but it’s worth the check the venn diagram, because diagrams are fun.\n\nBy the way, it is amazing that the author of the post, cites himself as a source when he ellaborates on his points. Not sure who did he cite on his first post, or if an index out of bounds error arised. (Sorry. Not a funny joke.)\n\nThe article proceeds, the author does not explain any AI algorithm (not explaining as in a scientific way, but any example, anything), doesn’t even bother to mention approaches based on logic or anything. A little bit of Turing tests, a little bit of weak vs strong AI and a bit of robots. (I’m still amazed that no external sources were used to generate the article). To end the AI part, the author mentions that there have been some significant advances in AI, increasing performance in some areas.\n\nNext part he writes about Deep Learning (DL), and says, all of the previous advances are coming from DL, (the advances he mentioned in the AI section). Then he proceeds to say that the advances in DL are because of the advances on Neural Nets models, and because we now have better chips in which run these algorithms. Kinda forgetting that we can make use of this algorithms because data collection has been significantly improved in all aspects.\n\nThese is becoming super long and boring for the reader, so you get my point, lets check the final paragraph, Machine Learning. The author says that there are two definitions about it. First.\n\nI mean. What to say. I’m certainly no expert on deep learning, if anything I know, it’s about supervised learning, but this is about using google (an important skill of any data scientist out there, really, use google properly). Takes about 10 segs if you are clicking the search button, to type “unsupervised deep learning” and then click the button.\n\nYea, the fact that some deep learning algorithms need labeled data, in any Machine Learning setup, is called Supervised Learning. When data is not labeled, it is called unsupervised learning. Second definition:\n\nReally surprised that cloud computing and big data are not types of data science algorithms. I’m assuming, the author refers as segmentation (clustering) as unsupervised learning algorithms, and classification and regression as supervised learning algorithms, a definition that extends in any kind of setups, not matter if its machine learning, deep learning, or real human learning.\n\nThe cherry on the top.\n\nI don’t know, I’ve been talking about LinkedIn and “experts” for so long with collegues/friends that I guess today I felt like writing about it. It takes more time to write the post, and look for nice venn diagrams, than to actually gather the knowledge about certain topics. I know LinkedIn is all about selling oneself, and I’m not the best at it, but in science, any kind of science, please, take five minutes of your life to write something coherent, something that can be used by others to learn.\n\nHere you have another Venn diagram. Because they are truly amazing. Have a nice day.", 
        "title": "LinkedIn or the art of pretending to be an expert. – David Torrejon Moya –"
    }, 
    {
        "url": "https://medium.com/findo-io/smarter-technology-for-a-smarter-future-495669b52261?source=tag_archive---------3----------------", 
        "text": "Dropbox… Google Drive… Gmail… Evernote… the list goes on. We have so much information stored in our online accounts.\n\nWhat can we do with all of our disparate data in our personal cloud?\n\nWe can learn from it.\n\nAdvances in technology have allowed us to extrapolate insights from our data. We do this through machine learning, or more specifically, deep learning.\n\nIn a nutshell, deep learning is a computational process that mimics the way our brains form when we are children. As children, we start to distinguish dogs from other animals through experience. After seeing dogs in a variety of colors and sizes, we recognize patterns and common characteristics. We hear people refer to these animals as dogs. Essentially, we begin to understand what makes a dog a dog and not a cat. We learn.\n\nWe do this for pretty much everything. It’s how we know how to say sentences that we haven’t necessarily heard before — we detect the grammar patterns in our parents’ speech, we attach definitions to words. Eventually, we adopt the ability to put these words together to create our own sentences. The more we do it, the better we get.\n\nTechnology can now do the same. Deep learning allows programs to become smart and learn from experience. In the case of technology, experience equals data. The more data we have, the more our programs can learn. As our programs become smarter and better trained they can make educated assumptions and draw important insights.\n\nSo what does this mean for the information in your personal cloud? Findo can apply this type of deep learning to the data in your cloud. Findo trains itself and learns from your information.\n\nThis allows Findo to handle your email just like an assistant would — by understanding the contents of your mail.\n\nPredictive Insights is Findo’s robust feature that through deep learning, and acts proactively towards your inbox. It starts by filtering important and unimportant email. It then notifies you about the emails that require some type of action (confirming calls or meeting invites, sending out invoices, filling out applications, etc.). Findo knows which tasks are time sensitive and just like a personal assistant notifies you for completion.", 
        "title": "Smarter technology for a smarter future. – Findo.io –"
    }
]