[
    {
        "url": "https://medium.com/@ReSnap/persbericht-investering-voor-nederlandse-deep-learning-startup-a471ae67d168?source=tag_archive---------0----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "PERSBERICHT: Investering voor Nederlandse deep learning startup"
    }, 
    {
        "url": "https://medium.com/@ReSnap/press-release-investment-for-deep-learning-startup-cfea17722696?source=tag_archive---------1----------------", 
        "text": "Amsterdam, Feb. 19, 2015 — The Dutch startup ReSnap today announced that it has closed $450.000 in seed funding from a informal investor. ReSnap develops a scientifically proven self-learning system that predicts what the most precious moments are for a user, based on their pictures.\n\nThe last couple of years, big data software giants like Google, Facebook and even Chinese Baidu began with the development of deep learning techniques and this led to big improvements in big data structuring and image recognition software. The investment will be used for the further development of the deep learning technology of ReSnap. This system can predict the most valuable pictures for a user and automatically generates a photo book in one minute. The predictions are realized through the implementation of a neural network. In addition to hiring additional developers, ReSnap also partnered up with some of the most prominent universities for the development of their neural network.\n\nThe financial injection comes one year after the launch of their first beta tool. “The funding is a great vote of confidence in ReSnap’s vision of creating photo books automatically within one minute, as well as in the long term potential of our technology. The investment is a nice first step. In a year we expect to raise another couple of millions”; said Erik-Jan Schreurs, co-founder ReSnap.", 
        "title": "PRESS RELEASE: Investment for deep learning startup"
    }, 
    {
        "url": "https://medium.com/@stoweboyd/an-ai-turning-point-362449c4ec81?source=tag_archive---------3----------------", 
        "text": "Researchers at Microsoft Research have surpassed human identification of images with a new implementation based on deep learning:\n\nHumans are still better at general vision and object recognition, though.", 
        "title": "An AI Turning Point – Stowe Boyd –"
    }, 
    {
        "url": "https://medium.com/it-agenda/it-agenda-kw07-3bf8c0133a05?source=tag_archive---------4----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "IT-Agenda kw07 – IT-Agenda –"
    }
]