[
    {
        "url": "https://towardsdatascience.com/choosing-the-right-metric-for-evaluating-machine-learning-models-part-2-86d5649a5428?source=collection_archive---------0----------------",
        "text": "In the first blog, we discussed some important metrics used in regression, their pros and cons, and use cases. This part will focus on commonly used metrics in classification, why should we prefer some over others with context. Let’s first understand the basic terminology used in classification problems before going through the pros and cons of each method. You can skip this section if you are already familiar with the terminology. Recall or Sensitivity or TPR (True Positive Rate): Number of items correctly identified as positive out of total true positives- TP/(TP+FN) Specificity or TNR (True Negative Rate): Number of items correctly identified as negative out of total negatives- TN/(TN+FP) Precision: Number of items correctly identified as positive out of total items identified as positive- TP/(TP+FP) False Positive Rate or Type I Error: Number of items wrongly identified as positive out of total true negatives- FP/(FP+TN) False Negative Rate or Type II Error: Number of items wrongly identified as negative out of total items identified as negative- FN/(FN+TP) F1 Score: It is a harmonic mean of precision and recall given by- \n\nF1 = 2*Precision*Recall/(Precision + Recall) The probabilistic interpretation of ROC-AUC score is that if you randomly choose a positive case and a negative case, the probability that the positive case outranks the negative case according to the classifier is given by the AUC. Here, rank is determined according to order by predicted values. Mathematically, it is calculated by area under curve of sensitivity (TPR) vs. \n\nFPR(1-specificity). Ideally, we would like to have high sensitivity & high specificity, but in real-world scenarios, there is always a tradeoff between sensitivity & specificity. Some important characteristics of ROC-AUC are- The value can range from 0 to 1. However auc score of a random classifier for balanced data is 0.5 ROC-AUC score is independent of the threshold set for classification because it only considers the rank of each prediction and not its absolute value. The same is not true for F1 score which needs a threshold value in case of probabilities output Log-loss is a measurement of accuracy that incorporates the idea of probabilistic confidence given by following expression for binary class: It takes into account the uncertainty of your prediction based on how much it varies from the actual label. In the worst case, let’s say you predicted 0.5 for all the observations. So log-loss will become -log(0.5) = 0.69. Hence, we can say that anything above 0.6 is a very poor model considering the actual probabilities.\n\nConsider Case 1 (Balanced Data), it looks like model 1 is doing a better job in predicting the absolute probabilities whereas model 2 is working best in ranking observations according to their true labels. Let’s verify with the actual score: If you consider log-loss, Model 2 is worst giving a high value of log-loss because the absolute probabilities have big difference from actual labels. But this is in complete disagreement with F1 & AUC score, according to which Model 2 has 100% accuracy. Also, you would like to note that with different thresholds, F1 score is changing, and preferring model 1 over model 2 for default threshold of 0.5. Inferences drawn from the above example (balanced):\n\n- If you care for absolute probabilistic difference, go with log-loss\n\n- If you care only for the final class prediction and you don’t want to tune threshold, go with AUC score\n\n-F1 score is sensitive to threshold and you would want to tune it first before comparing the models How each of them deals with class imbalance?\n\nThe only difference in the two models is their prediction for observation 13 & 14. Model 1 is doing a better job in classifying observation 13 (label 0) whereas Model 2 is doing better in classifying observation 14 (label 1). The goal is to see which model actually captures the difference in classifying the imbalanced class better (class with few observations, here it is label 1). In problems like fraud detection/spam mail detection, where positive labels are few, we would like our model to predict positive classes correctly and hence we will sometime prefer those model who are able to classify these positive labels Clearly log-loss is failing in this case because according to log-loss both the models are performing equally. This is because log-loss function is symmetric and does not differentiate between classes . Both F1 score and ROC-AUC score is doing better in preferring model 2 over model 1. So we can use both these methods for class imbalance. But we will have to dig further to see how differently they treat class imbalance.\n\nIn the previous example, we saw that there were few positive labels. In the second example, there were few negative labels. Let’s see how F1 score & ROC-AUC differentiate between these two cases. ROC-AUC score handled the case of few negative labels in the same way as it handled the case of few positive labels. An interesting thing to note here is that F1 score is pretty much same for both Model 3 & Model 4 because positive labels are large in number and it cares only for the misclassification of positive labels. Inferences drawn from above example:\n\n- If you care for a class which is smaller in number independent of the fact whether it is positive or negative, go for ROC-AUC score. When will you prefer F1 over ROC-AUC? When you have a small positive class, then F1 score makes more sense. This is the common problem in fraud detection where positive labels are few. We can understand this statement with the following example. We can see that model (1) predicts 5 positives out of 100 true positives in a dataset of size 10K observations, while another model (2) predicts 90 positives out of 100 true positives. Clearly, model (2) is doing a much better job than model (1) in this case. Let’s see if both F1 score & ROC-AUC score are able to capture that difference Yes, the difference in F1 score reflects the model performance. ROC-AUC gives a decent score to model 1 as well which is nota good indicator of its performance. Hence we should be careful while picking roc-auc for imbalanced datasets. Which metric should you use for multi-classification? We have further three types of non-binary classification: Multi-Class: classification task with more than two classes such that the input is to be classified into one, and only one of these classes. Example: classify a set of images of fruits into any one of these categories — apples, bananas, and oranges. Multi-labels: classifying a sample into a set of target labels. Example: tagging a blog into one or more topics like technology, religion, politics etc. Labels are isolated and their relations are not considered important. Hierarchical: each category can be grouped together with similar categories, creating meta-classes, which in turn can be grouped again until we reach the root level (set containing all data). Examples include text classification & species classification. For more details, refer this blog. In this blog, we will cover only the first category.\n\nAs you can see in the above table, we have broadly two types of metrics- micro-average & macro-average, we will discuss the pros and cons of each. Most commonly used metrics for multi-classes are F1 score, Average Accuracy, Log-loss. There is yet no well-developed ROC-AUC score for multi-class. Log-loss for multi-class is defined as: - In Micro-average method, you sum up the individual true positives, false positives, and false negatives of the system for different sets and then apply them to get the statistics.\n\n- In Macro-average, you take the average of the precision and recall of the system on different sets Micro-average is preferable if there is a class imbalance problem.",
        "title": "Choosing the Right Metric for Evaluating Machine Learning Models — Part 2",
        "keywords": [
            "evaluating machine learning models — part 2",
            "true positive rate ): number",
            "true negative rate ): number",
            "absolute probabilities whereas model 2",
            "examples include text classification",
            "predict positive classes correctly",
            "looks like model 1",
            "problems like fraud detection",
            "categories — apples",
            "whereas model 2",
            "positive labels clearly log",
            "items correctly identified",
            "false positive rate",
            "topics like technology",
            "false negative rate",
            "preferring model 2",
            "spam mail detection",
            "nota good indicator",
            "items wrongly identified",
            "individual true positives",
            "predicts 90 positives",
            "total items identified",
            "total true positives",
            "poor model considering",
            "model actually captures",
            "small positive class",
            "probabilities output log",
            "size 10k observations",
            "commonly used metrics",
            "preferring model 1",
            "positive case outranks",
            "total true negatives",
            "treat class imbalance",
            "basic terminology used",
            "100 true positives",
            "predicts 5 positives",
            "broadly two types",
            "f1 score reflects",
            "f1 score makes",
            "tp /( tp",
            "tn /( tn",
            "fp /( fp",
            "fn /( fn",
            "important metrics used",
            "balanced data ),",
            "probabilistic confidence given",
            "however auc score",
            "class imbalance problem",
            "absolute probabilistic difference",
            "ranking observations according",
            "final class prediction",
            "classifying observation 13",
            "consider case 1",
            "label 1 ).",
            "imbalanced class better",
            "negative case according",
            "type ii error",
            "recall /( precision",
            "classifying observation 14",
            "different sets micro",
            "much better job",
            "auc score handled",
            "balanced ):",
            "model 2",
            "fraud detection",
            "absolute probabilities",
            "two models",
            "false positives",
            "model 1",
            "positive case",
            "true labels",
            "would like",
            "observation 13",
            "classification problems",
            "class imbalance",
            "positive labels",
            "total negatives",
            "consider log",
            "actual probabilities",
            "negative case",
            "false negatives",
            "different sets",
            "negative labels",
            "number independent",
            "better job",
            "absolute value",
            "f1 score",
            "data ).",
            "balanced data",
            "probabilistic interpretation",
            "auc score",
            "model 4",
            "model 3",
            "another model",
            "two classes",
            "three types",
            "similar categories",
            "imbalanced datasets",
            "decent score",
            "common problem",
            "binary class",
            "actual score",
            "important characteristics",
            "different thresholds",
            "considered important",
            "actual label",
            "worst case",
            "two cases",
            "determined according",
            "species classification",
            "classification task",
            "binary classification",
            "auc gives",
            "target labels",
            "model performance",
            "actual labels",
            "worst giving",
            "world scenarios",
            "working best",
            "specificity ).",
            "root level",
            "recall given",
            "randomly choose",
            "pretty much",
            "prediction based",
            "predicted values",
            "politics etc",
            "performing equally",
            "part",
            "label 0",
            "interesting thing",
            "inferences drawn",
            "harmonic mean",
            "following expression",
            "fact whether",
            "difference yes",
            "creating meta",
            "complete disagreement",
            "big difference",
            "already familiar",
            "prefer f1",
            "default threshold",
            "second example",
            "previous example",
            "picking roc",
            "high value",
            "following example",
            "developed roc",
            "5 roc",
            "sometime prefer",
            "set containing",
            "predicted 0",
            "high specificity",
            "auc differentiate",
            "threshold value",
            "would want",
            "use cases",
            "right metric",
            "random classifier",
            "loss function",
            "let ’",
            "high sensitivity",
            "grouped together",
            "2",
            "threshold set",
            "models",
            "tune threshold",
            "number",
            "first understand",
            "first category",
            "first blog",
            "average method",
            "average accuracy",
            "true",
            "positive",
            "negative",
            "1",
            "model",
            "log",
            "clearly",
            "class",
            "tp",
            "tn",
            "observations",
            "metrics",
            "fp",
            "fn",
            "classifying",
            "classes",
            "case",
            "better",
            "according",
            "f1",
            "classification",
            "auc",
            "labels",
            "type",
            "terminology",
            "recall",
            "prediction",
            "precision",
            "much",
            "micro",
            "handled",
            "given",
            "error",
            "difference",
            "5",
            "14",
            "100",
            "threshold",
            "value",
            "roc",
            "first",
            "example",
            "specificity",
            "set",
            "prefer",
            "average",
            "0",
            "’",
            "want",
            "use",
            "understand",
            "tune",
            "sensitivity",
            "performance",
            "metric",
            "method",
            "loss",
            "independent",
            "grouped",
            "differentiate",
            "classifier",
            "category",
            "blog",
            "accuracy",
            "yet",
            "well",
            "way",
            "vs",
            "verify",
            "varies",
            "uncertainty",
            "turn",
            "tradeoff",
            "tpr",
            "tnr",
            "takes",
            "take",
            "tagging",
            "table",
            "system",
            "symmetric",
            "sum",
            "statistics",
            "statement",
            "smaller",
            "skip",
            "sensitive",
            "sense",
            "see",
            "section",
            "say",
            "saw",
            "sample",
            "religion",
            "relations",
            "regression",
            "refer",
            "real",
            "reach",
            "rank",
            "range",
            "pros",
            "probability",
            "preferable",
            "predicting",
            "others",
            "order",
            "oranges",
            "one",
            "note",
            "non",
            "needs",
            "multi",
            "misclassification",
            "methods",
            "measurement",
            "mathematically",
            "macro",
            "large",
            "isolated",
            "input",
            "incorporates",
            "images",
            "ideally",
            "idea",
            "hierarchical",
            "hence",
            "going",
            "goal",
            "go",
            "get",
            "fruits",
            "fpr",
            "focus",
            "failing",
            "discussed",
            "discuss",
            "dig",
            "differently",
            "details",
            "defined",
            "deals",
            "dataset",
            "curve",
            "cover",
            "context",
            "considers",
            "cons",
            "comparing",
            "classify",
            "classified",
            "choosing",
            "changing",
            "cares",
            "careful",
            "care",
            "capture",
            "calculated",
            "become",
            "bananas",
            "area",
            "apply",
            "anything",
            "always",
            "also",
            "account",
            "able",
            "69",
            "6"
        ]
    },
    {
        "url": "https://towardsdatascience.com/speeding-up-convolutional-neural-networks-240beac5e30f?source=collection_archive---------1----------------",
        "text": "Before diving into this method, be aware that it’s extremely dependent upon how the Separable Convolutions where implemented in a given framework. As far as I am concerned, TensorFlow might have some specific optimizations for this method while for other backends, like Caffe, CNTK or PyTorch it is unclear.\n\nThe idea is that instead of convolving jointly across all channels of an image, you run a separate 2D convolution on each channel with a depth of . The intermediate channels get concatenated together, and mapped to using a 1x1 convolution.[5] This way one ends up with significantly fewer parameters to train.[2]\n\nIt’s not so simple tho. Beware that Separable Convolutions sometimes aren’t training. In such cases, modify the depth multiplier from 1 to 4 or 8. Also note that these are not that efficient on small datasets, like CIFAR 10, moreover on MNIST. Another thing to keep in mind, don’t use Separable Convolutions in early stages of the network.\n\nThe factorization scheme showed above work well in practice, but are quite simple. They work but are by far not the limit of what’s possible. There are numerous works, including [3] by V. Lebedev et al. that show us different tensor decomposition schemes that drastically decrease the number of parameters, hence the number of required computations.\n\nInspired by [1] here’s a code snippet of how to do CP-Decomposition in Keras:\n\nIt doesn’t work, regretfully, but it gives you the intuition of how it should look like in code. Btw, the image at the top of the article is the graphical explanation of how CP-Decomposition works.\n\nShould be noted such schemes as TensorTrain decomposition and Tucker. For PyTorch and NumPy there’s a great library called Tensorly that does all the low-level implementation for you. In TensorFlow there’s nothing close to it, still, there is an implementation of TensorTrain aka TT scheme, here.\n\nThe full code is currently available as a Colaboratory notebook with a Tesla K80 GPU accelerator. Make yourself a copy and have fun tinkering around with the code.\n\nIf you’re reading this, I’d like to thank you and hope all of the above written will be of great help for you, as it was for me. Let me know what are your thoughs about it in the comments section. Your feedback is valuable for me.\n\nAlso, don’t forget to clap if you liked the article 😏 or even follow me for more articles like this.\n\n[1] https://medium.com/@krishnatejakrothapalli/hi-rain-4e76039423e2\n\n[2] F. Chollet, Xception: Deep Learning with Depthwise Separable Convolutions, https://arxiv.org/abs/1610.02357v2\n\n[3] V. Lebedev et al, Speeding-up Convolutional Neural Networks Using Fine-tuned CP-Decomposition, https://arxiv.org/abs/1412.6553\n\n[4] C. Szegedy et al, Rethinking the Inception Architecture for Computer Vision, https://arxiv.org/pdf/1512.00567v1.pdf\n\n[5] https://stackoverflow.com/questions/37092037/tensorflow-what-does-tf-nn-separable-conv2d-do#37092986\n\n[6] S. Zagoruyko and N. Komodakis, Wide Residual Networks, https://arxiv.org/pdf/1605.07146v1.pdf",
        "title": "Speeding up Convolutional Neural Networks –",
        "keywords": [
            "show us different tensor decomposition schemes",
            "intermediate channels get concatenated together",
            "convolutional neural networks using fine",
            "convolutional neural networks –",
            "tesla k80 gpu accelerator",
            "great library called tensorly",
            "tensortrain aka tt scheme",
            "wide residual networks",
            "factorization scheme showed",
            "way one ends",
            "szegedy et al",
            "lebedev et al",
            "https :// stackoverflow",
            "https :// medium",
            "https :// arxiv",
            "fun tinkering around",
            "extremely dependent upon",
            "convolving jointly across",
            "separate 2d convolution",
            "use separable convolutions",
            "separable convolutions sometimes",
            "depthwise separable convolutions",
            "significantly fewer parameters",
            "like cifar 10",
            "com /@ krishnatejakrothapalli",
            "tensortrain decomposition",
            "separable convolutions",
            "great help",
            "decomposition works",
            "1x1 convolution",
            "specific optimizations",
            "small datasets",
            "simple tho",
            "required computations",
            "quite simple",
            "numerous works",
            "nothing close",
            "look like",
            "like caffe",
            "inception architecture",
            "graphical explanation",
            "given framework",
            "even follow",
            "early stages",
            "drastically decrease",
            "deep learning",
            "currently available",
            "computer vision",
            "comments section",
            "colaboratory notebook",
            "articles like",
            "another thing",
            "full code",
            "code snippet",
            "work well",
            "tuned cp",
            "tensorflow might",
            "schemes",
            "level implementation",
            "depth multiplier",
            "article 😏",
            "also note",
            "using",
            "channels",
            "decomposition",
            "separable",
            "parameters",
            "like",
            "com",
            "code",
            "work",
            "tensorflow",
            "implementation",
            "depth",
            "cp",
            "article",
            "also",
            "’",
            "zagoruyko",
            "xception",
            "written",
            "valuable",
            "v",
            "unclear",
            "tucker",
            "training",
            "train",
            "top",
            "thoughs",
            "thank",
            "tf",
            "still",
            "speeding",
            "run",
            "rethinking",
            "regretfully",
            "reading",
            "rain",
            "questions",
            "pytorch",
            "practice",
            "possible",
            "pdf",
            "org",
            "numpy",
            "number",
            "noted",
            "nn",
            "network",
            "n",
            "moreover",
            "modify",
            "mnist",
            "mind",
            "method",
            "mapped",
            "make",
            "low",
            "limit",
            "liked",
            "let",
            "komodakis",
            "know",
            "keras",
            "keep",
            "intuition",
            "instead",
            "inspired",
            "including",
            "implemented",
            "image",
            "idea",
            "hope",
            "hi",
            "hence",
            "gives",
            "forget",
            "feedback",
            "far",
            "f",
            "efficient",
            "diving",
            "copy",
            "conv2d",
            "concerned",
            "cntk",
            "clap",
            "chollet",
            "channel",
            "cases",
            "c",
            "btw",
            "beware",
            "backends",
            "aware",
            "abs",
            "8",
            "6553",
            "6",
            "5",
            "4e76039423e2",
            "4",
            "37092986",
            "37092037",
            "3",
            "2",
            "1610",
            "1605",
            "1512",
            "1412",
            "1",
            "07146v1",
            "02357v2",
            "00567v1"
        ]
    },
    {
        "url": "https://towardsdatascience.com/automold-specialized-augmentation-library-for-autonomous-vehicles-1d085ed1f578?source=collection_archive---------2----------------",
        "text": "It was not long into Udacity’s Self driving car nano-degree course when I realized that besides normally followed augmentation techniques, self-driven cars also require specialized augmentation. A self driven car is one of the most complex challenges of AI and also different from other challenges in many aspects. It not only sees the world in day and night but also with various weather changes. It is way different for a car to drive in snow than on regular summer roads. To make cars safer than before and generalize them to all aspects of roads it is necessary to train them in all possible environments.\n\nI searched the abyss of the Internet but couldn’t find concrete ways to create such scenarios artificially. Till now the only and also more robust way to train vehicles, is to train them on actual roads. But roads are not accessible to all genius minds out there who want to train their Car’s CNN to drive gracefully in all conditions.\n\nThus I decided to create Automold. This library is written in python and uses OpenCV and Numpy underneath. Automold helps to augment the images to have various seasons. Whether you want to add a little more sun or rain, fog or snow, or maybe some speed, gravels and autumn leaves, Automold helps you to achieve that without getting you into the hassle of writing the whole code yourself.\n\nBelow are some of the images I will test Automold on.\n\nAdding snow to the images can really help an Autonomous vehicle engineer to make the car’s understand, how is it to drive in snow. Snowy and rainy roads pose a great threat while driving. Even humans find it really difficult to identify paths and thus training CNNs to identify routes is cumbersome.\n\nHere are some images with fresh snow and rain generated by Automold.\n\nAlso the amount of rain and snow is configurable. There are three rain types to choose from ‘drizzle’, ‘heavy’ and ‘torrential’. If you don’t want to do too many configurations just set the rain type and you are good to go. If you want to make the images more or less shady you can darken or brighten the images by setting the respective coefficients or maybe go in for random values.\n\nThis doesn’t requires getting into OpenCV color channels and modifying pixel values. Also you don’t need to loop through you image list and call the function on each image. Whether it’s a single image or whole list of images just pass it to the functions. The whole thing is as easy as:\n\nApart from this if you want to introduce shadows or gravels on the road, Automold helps you to do so instantly. However at the same time allows you to do various configurations. Defining region of interest or specifying how many gravel patches to introduce can be really handy at times. If you don’t want to configure, you can go with the default values.\n\nIntroducing Fog or sun flare is also very easy and yet configurable. Fog intensity, Sun flare source position, flare color, angle etc. can be set to create desired effects.\n\nAlso there are two new additions to the library which allow us to add speed motion and autumn to the images. Motion blur is actually a thing, which happens when you drive fast. Distant positions on the roads stay distinctly visible but blur away as they come close.\n\nmaking the leaves red and orange might not be the best way to describe autumn but still is the closest way to artificially reproduce the effect. Although I am still thinking of a better and robust way to do so. So there are many functions at your disposal which can help you to augment the images specifically for roads. But isn’t there an even better way to do augmentation and not call these functions manually? Well, Yes !! You can do so just by typing this:\n\nThe function applies a bunch of augmentations on the input images and reduces the whole augmentation code to just a single line.\n\nYou can find the documentation and the library code along with other Autonomous vehicle projects on my Github profile and for more articles by me visit Medium or Wordpress.",
        "title": "Automold- specialized augmentation library for Autonomous vehicles",
        "keywords": [
            "‘ drizzle ’, ‘ heavy ’",
            "driven cars also require specialized augmentation",
            "besides normally followed augmentation techniques",
            "roads stay distinctly visible",
            "sun flare source position",
            "self driving car nano",
            "‘ torrential ’.",
            "specialized augmentation library",
            "self driven car",
            "make cars safer",
            "two new additions",
            "autonomous vehicle projects",
            "autonomous vehicle engineer",
            "regular summer roads",
            "rainy roads pose",
            "whole augmentation code",
            "various weather changes",
            "modifying pixel values",
            "find concrete ways",
            "even humans find",
            "many gravel patches",
            "thus training cnns",
            "three rain types",
            "opencv color channels",
            "library code along",
            "create desired effects",
            "even better way",
            "add speed motion",
            "car ’",
            "flare color",
            "sun flare",
            "also different",
            "whole code",
            "udacity ’",
            "autonomous vehicles",
            "actual roads",
            "uses opencv",
            "motion blur",
            "various seasons",
            "various configurations",
            "random values",
            "default values",
            "whole list",
            "many configurations",
            "way different",
            "robust way",
            "closest way",
            "best way",
            "yes !!",
            "without getting",
            "visit medium",
            "time allows",
            "single line",
            "scenarios artificially",
            "respective coefficients",
            "requires getting",
            "really handy",
            "really difficult",
            "rain type",
            "rain generated",
            "possible environments",
            "orange might",
            "numpy underneath",
            "less shady",
            "leaves red",
            "identify routes",
            "identify paths",
            "great threat",
            "github profile",
            "genius minds",
            "distant positions",
            "degree course",
            "defining region",
            "come close",
            "blur away",
            "artificially reproduce",
            "angle etc",
            "allow us",
            "many functions",
            "whole thing",
            "test automold",
            "many aspects",
            "create automold",
            "automold helps",
            "single image",
            "introducing fog",
            "input images",
            "images specifically",
            "image list",
            "functions manually",
            "fresh snow",
            "fog intensity",
            "drive gracefully",
            "drive fast",
            "describe autumn",
            "autumn leaves",
            "adding snow",
            "augmentation",
            "yet configurable",
            "train vehicles",
            "still thinking",
            "really help",
            "introduce shadows",
            "function applies",
            "complex challenges",
            "maybe go",
            "also",
            "’",
            "self",
            "roads",
            "driving",
            "car",
            "sun",
            "library",
            "find",
            "thus",
            "speed",
            "rain",
            "make",
            "create",
            "better",
            "add",
            "automold",
            "snow",
            "images",
            "image",
            "functions",
            "fog",
            "drive",
            "autumn",
            "train",
            "thing",
            "still",
            "maybe",
            "introduce",
            "help",
            "go",
            "function",
            "configurable",
            "challenges",
            "aspects",
            "written",
            "writing",
            "world",
            "wordpress",
            "whether",
            "well",
            "want",
            "understand",
            "typing",
            "times",
            "till",
            "specifying",
            "snowy",
            "setting",
            "set",
            "sees",
            "searched",
            "road",
            "reduces",
            "realized",
            "python",
            "pass",
            "one",
            "night",
            "need",
            "necessary",
            "making",
            "loop",
            "long",
            "little",
            "internet",
            "interest",
            "instantly",
            "however",
            "hassle",
            "happens",
            "gravels",
            "good",
            "generalize",
            "effect",
            "easy",
            "documentation",
            "disposal",
            "decided",
            "day",
            "darken",
            "cumbersome",
            "configure",
            "conditions",
            "cnn",
            "choose",
            "call",
            "bunch",
            "brighten",
            "augmentations",
            "augment",
            "articles",
            "apart",
            "amount",
            "although",
            "ai",
            "actually",
            "achieve",
            "accessible",
            "abyss"
        ]
    },
    {
        "url": "https://towardsdatascience.com/back-to-basics-deriving-back-propagation-on-simple-rnn-lstm-feat-aidan-gomez-c7f286ba973d?source=collection_archive---------3----------------",
        "text": "There are two things to note here….\n\n1. Green Line → Please remember the derivative of Tanh() can be rewritten as such. If you do not remember why, please scroll up.\n\n2. I did not perform derivative respect to i(2), and f(2). The reason is because those two terms have very similar derivative structure with a(2). I’ll try to explain why in details below.\n\nIf we observe how state(t) is calculated we can see that the terms a(t), i(t), f(t) and state(t-1) are involved. So when we take the derivative respect to the variable a(t), we can know that it would be very similar to taking derivative respect to i(t). However, there is one term that we need to take a more deeper look into and that is o(t). Since, the term gets used after we calculate state(t) the derivative is also different.\n\nWe can clearly see that there are some difference between the derivative equation when compared to a(2).\n\nWith those ideas in-mind we can see that deriving back-propagation at time stamp 2 is not that hard, since it is the most outer layer of our LSTM.",
        "title": "[ Back to Basics ] Deriving Back Propagation on simple RNN/LSTM (feat. Aidan Gomez)",
        "keywords": [
            "green line → please remember",
            "term gets used",
            "time stamp 2",
            "taking derivative respect",
            "perform derivative respect",
            "similar derivative structure",
            "deriving back propagation",
            "please scroll",
            "derivative respect",
            "one term",
            "deriving back",
            "derivative equation",
            "two things",
            "tanh ()",
            "simple rnn",
            "outer layer",
            "deeper look",
            "also different",
            "aidan gomez",
            "2 ),",
            "two terms",
            "clearly see",
            "calculate state",
            "2 ).",
            "), f",
            "remember",
            "derivative",
            "similar",
            "propagation",
            "back",
            "2",
            "),",
            "terms",
            "state",
            "see",
            "f",
            ").",
            "….",
            "’",
            "would",
            "variable",
            "try",
            "take",
            "since",
            "rewritten",
            "reason",
            "observe",
            "note",
            "need",
            "mind",
            "lstm",
            "know",
            "involved",
            "ideas",
            "however",
            "hard",
            "feat",
            "explain",
            "difference",
            "details",
            "compared",
            "calculated",
            "basics",
            "1"
        ]
    },
    {
        "url": "https://towardsdatascience.com/exploring-the-meaning-of-ai-data-science-and-machine-learning-with-the-latest-wikipedia-5fea5f0a2d46?source=collection_archive---------4----------------",
        "text": "Terms such as data science, machine learning and artificial intelligence have found a well deserved spot in the “pantheon” of tech buzzwords.\n\nWe hear and read about them almost on a daily basis. In fact they are often used interchangeably, even though depending on the source there are clear preferences (you might have noticed a certain fondness that say marketing and media have for the term AI).\n\nThe illustration above is an adaptation from PWC, one of the many Venn diagrams available on the internet attempting to explain the relationship between the terms, but it is not very straightforward.\n\nCan we use data and analytical methods to capture the meaning and semantic context of these terms ? Ok, let’s give it a go and try to fight fire with fire. The Wikipedia clickstream dataset will be of great help for this.\n\nThe Wikimedia foundation has recently decided to open source its monthly clickstreams across several key languages. A typical clickstream in English language contains millions of distinct Wikipedia urls, requested billions of times by internet users.\n\nHaving such a comprehensive resource available is great news. It enables several sophisticated types of analysis around online user behaviour over one of the world’s busiest websites. Indeed there are several published academic papers that study the clickstream dataset from various scientific perspectives, especially behavioural.\n\nThis will be a practical approach using network analysis. Not only to answer the question above, but also to motivate the use of clickstream and network analysis for other applications and domains. Keyword research, content development, web traffic visualisation come to mind and I am sure there are many others.\n\nWe will use the latest available dataset from March 2018 which contains 23.3M pairs of referrer and target urls in English language, accounting for a total of 6.2B page requests to the Wikipedia servers.\n\nThe dataset makes it possible to visualise the relationship between different terms based on the way users navigate from one Wikipedia page to the other, either by following the links or using the built-in search functionality — sometimes falling victims to the Wikipedia rabbit holes.\n\nThe dataset is practically a gigantic network of nodes (the Wikipedia articles) which are connected via edges to other nodes (related articles) based on the sequence of pages requested during the user session.\n\nThe size of the edges can be thought of as a weight factor reflecting the traffic between two nodes. One of the benefits of working with network analysis is that its outputs can be graphed. This allows us to see the overall view of what all those clicks and page transitions might mean.\n\nNOTE: The graphs that follow have been configured to enable decent viewing on mobile devices. However they are best viewed on a large screen.\n\nNext we will examine clickstream graphs of the following terms:\n\nAs a warm-up and in order to explain the method of analysis we ‘ll start with Data mining, a term that was heavily used in the past.\n\nThis initial graph has isolated the part of the network that involves “data mining” and its neighbourhood of adjacent nodes (articles). The edge between two nodes is the traffic between them and the colour and size of the nodes reflect the number of neighbours they are connected to. This is already useful to some extent. In order to make more sense of the related terms, as a second step, the nodes were grouped into relevant categories, in order to see the broader relationships more clearly.\n\nThe downside of this (beyond my own personal bias applying the labels) is that the graph can get overloaded with text and colours. Moreover, in some cases e.g. AI it can be really hard to contain the number of groups to a manageable level. In the case of artificial general intelligence the nodes are not homogeneous enough to create meaningful categories. In both cases the nodes were on purpose not placed in groups. Note also that in order to make the graph more clear, some of the nodes are not visible- either because of their low traffic or because of having a very low number of neighbours.\n\nOne thing to note from the start is that the Wikipedia entry for data science is relatively limited. It has the least amount of hyperlinks among all the other terms reviewed in the article. The content however has been growing substantially. Since November of 2017 when the first dataset was released, the links on the page almost doubled.\n\n(Fun fact about data science: one of the pages associated with it is actually the Wikipedia article for buzzword, even though its vertex degree was not sufficient to get it into the graph).\n\nThe article for data mining is much more comprehensive as it has been around for much longer.\n\nThat said there is still a fair amount of similarity between the type of associated terms. Most of the terms in the data science graph appear in the data mining one too. This could give some ground to those suggesting that data science is a rebranded version of data mining as used in the ’90s and ‘00s.\n\nFor the moment however, data science lacks strong associations with business related terms such as business intelligence, analytics and maybe terms like OLAP that data mining has, but those and other associations might emerge as the data science article develops.\n\nMachine learning seems to be the most straightforward case of all. It is for the most part associated with terms referring to different scientific methods for knowledge discovery or prediction (labelled as machine or statistical learning methods).\n\nThis is by far the most broad, diverse term but also the one hardest to convert into a graph. AI by itself is associated with more than 450 nodes and I had to set a high threshold for the number of neighbours so that the graph wouldn’t look like a massive ball of hair. The diversity of the nodes still made it hard to define meaningful categories.\n\nTo stay current with the spirit of the times the last clickstream network graph is for artificial general intelligence.\n\nThe nodes of the graph are not homogeneous enough to create multiple meaningful clusters. However, between nodes bearing names such as “mind uploading”, and “intelligence explosion” we can see two themes that editors and users seem to be interested in.\n\nLet’s call the fist cluster “AI for evil” including pages like\n\nLet’s close with the “AI for good” cluster that includes:\n\nThe clusters by themselves cannot obviously define artificial general intelligence but they are indicative of popular content associated with them.\n\nWe have explored the 5 terms and artificial neural net (ANN) was the only associated term present and prominent in all 5.\n\nIt’s hard to accept that this is a coincidence. ANNs combined with modern computational advances are highly associated with recent progress in the field of AI. In some ways they helped an AI comeback after many years of AI winter.\n\nCurrently state of the art deep learning models are based on ANNs. Tensorflow, Deep Mind’s most famous open source project is one of the most popular libraries for ANN applications in terms of Github interactions and Stackoverflow traffic. Taking everything into consideration it seems likely that ANNs are here to stay and we are going to hear more and more about them (my prediction).\n\nThe code to generate the graphs using the R language is available in this github repo where some of the parameters and filters choices (e.g. number of edges filter, order, degree) are available.\n\nYou can use the easy start script, to quickly experiment with how other concepts of your choice relate to each other.\n\nThis article was motivated by a combination of pieces of content, to which I was exposed in recent times and which I recommend strongly.\n\nAlso I ‘d like to stress how open source libraries like ggplot and ggraph are really helpful when working with network data visualisation.\n\nAs you are now judging the content you have just read, and maybe already having some objections, remember: the goal wasn’t to define any term but rather to look at them through the perspective of Wikipedia editors’ and users’ behaviour. From my end it was a bit like working on a jigsaw puzzle.\n\nOf course there is an inherent bias in that articles reflect the biases of their own authors. It is positive however is that in the case of Wikipedia, thanks to the wiki editorial model and process of control we can count on the wisdom of the crowds to mitigate any strong biases or extreme/misinformed views. Just as an example the Wikipedia article for AI has a number of editors and watchers that’s in the thousands.\n\nTo conclude, an important benefit of performing network analysis with the Wikipedia clickstream is that it can shed light around what both users and contributors of the world’s largest encyclopedia consider important. Based on either how they write or how they click.\n\nWhat do you think, are there any other terms worth to explore with the Wikipedia clickstream ? Do you see any other interesting uses for this dataset ? Data science practitioners: Is there a way to automate the grouping of the nodes in the graphs using e.g. NLP ?\n\nExperienced data analytics consultant, ex-Googler, in Dublin Ireland. I am currently looking to form a network of collaborators (remote or not) to tackle interesting challenges in the area of marketing and customer analytics.",
        "title": "Exploring the Meaning of AI, Data Science and Machine Learning with the latest Wikipedia…",
        "keywords": [
            "search functionality — sometimes falling victims",
            "monthly clickstreams across several key languages",
            "evil ” including pages like let ’",
            "cannot obviously define artificial general intelligence",
            "involves “ data mining ”",
            "data science lacks strong associations",
            "open source libraries like ggplot",
            "practical approach using network analysis",
            "analysis around online user behaviour",
            "several published academic papers",
            "enables several sophisticated types",
            "“ intelligence explosion ”",
            "largest encyclopedia consider important",
            "art deep learning models",
            "famous open source project",
            "“ mind uploading ”,",
            "page transitions might mean",
            "web traffic visualisation come",
            "experienced data analytics consultant",
            "data science graph appear",
            "fist cluster “ ai",
            "many venn diagrams available",
            "create multiple meaningful clusters",
            "data science article develops",
            "maybe terms like olap",
            "statistical learning methods ).",
            "english language contains millions",
            "latest wikipedia … terms",
            "last clickstream network graph",
            "artificial general intelligence",
            "“ pantheon ”",
            "good ” cluster",
            "data science practitioners",
            "network data visualisation",
            "associations might emerge",
            "create meaningful categories",
            "artificial neural net",
            "define meaningful categories",
            "2b page requests",
            "users ’ behaviour",
            "performing network analysis",
            "deep mind ’",
            "wiki editorial model",
            "well deserved spot",
            "weight factor reflecting",
            "various scientific perspectives",
            "shed light around",
            "modern computational advances",
            "enable decent viewing",
            "different scientific methods",
            "data mining one",
            "bit like working",
            "wikipedia rabbit holes",
            "tackle interesting challenges",
            "personal bias applying",
            "latest available dataset",
            "page almost doubled",
            "nodes bearing names",
            "often used interchangeably",
            "even though depending",
            "easy start script",
            "distinct wikipedia urls",
            "one wikipedia page",
            "machine learning seems",
            "comprehensive resource available",
            "examine clickstream graphs",
            "see two themes",
            "different terms based",
            "associated term present",
            "wikipedia editors ’",
            "let ’",
            "business related terms",
            "way users navigate",
            "term ai ).",
            "nodes still made",
            "wikipedia clickstream dataset",
            "graphs using e",
            "connected via edges",
            "data science",
            "artificial intelligence",
            "data mining",
            "open source",
            "popular content associated",
            "network analysis",
            "“ ai",
            "popular libraries",
            "business intelligence",
            "pages associated",
            "pages requested",
            "english language",
            "user session",
            "machine learning",
            "graph ).",
            "look like",
            "strong biases",
            "maybe already",
            "important benefit",
            "graphs using",
            "even though",
            "contains 23",
            "analytical methods",
            "wikipedia clickstream",
            "’ 90s",
            "world ’",
            "use data",
            "gigantic network",
            "wikipedia article",
            "related terms",
            "relevant categories",
            "r language",
            "many years",
            "many others",
            "two nodes",
            "initial graph",
            "articles ).",
            "clickstream dataset",
            "associated terms",
            "wikipedia servers",
            "wikipedia entry",
            "wikipedia articles",
            "target urls",
            "seems likely",
            "interesting uses",
            "inherent bias",
            "typical clickstream",
            "terms worth",
            "terms reviewed",
            "terms referring",
            "related articles",
            "customer analytics",
            "ai winter",
            "ai comeback",
            "stackoverflow traffic",
            "low traffic",
            "diverse term",
            "users seem",
            "one thing",
            "one hardest",
            "internet users",
            "first dataset",
            "dataset makes",
            "nodes reflect",
            "highly associated",
            "adjacent nodes",
            "450 nodes",
            "prediction ).",
            "wikimedia foundation",
            "tech buzzwords",
            "taking everything",
            "since november",
            "semantic context",
            "second step",
            "requested billions",
            "relatively limited",
            "recommend strongly",
            "recently decided",
            "recent progress",
            "rebranded version",
            "really helpful",
            "quickly experiment",
            "overall view",
            "mobile devices",
            "misinformed views",
            "massive ball",
            "march 2018",
            "manageable level",
            "least amount",
            "large screen",
            "knowledge discovery",
            "keyword research",
            "jigsaw puzzle",
            "internet attempting",
            "hyperlinks among",
            "homogeneous enough",
            "high threshold",
            "heavily used",
            "growing substantially",
            "great news",
            "great help",
            "github repo",
            "github interactions",
            "filters choices",
            "fair amount",
            "especially behavioural",
            "edges filter",
            "dublin ireland",
            "daily basis",
            "currently state",
            "currently looking",
            "content development",
            "choice relate",
            "certain fondness",
            "busiest websites",
            "broader relationships",
            "best viewed",
            "articles reflect",
            "already useful",
            "allows us",
            "3m pairs",
            "following terms",
            "5 terms",
            "positive however",
            "moment however",
            "content however",
            "like",
            "part associated",
            "‘ 00s",
            "vertex degree",
            "stay current",
            "say marketing",
            "recent times",
            "really hard",
            "much longer",
            "low number",
            "get overloaded",
            "fun fact",
            "fight fire",
            "could give",
            "clear preferences",
            "cases e",
            "anns combined",
            "define",
            "analysis",
            "straightforward case",
            "source",
            "note also",
            "around",
            "ann applications",
            "’",
            "network",
            "using",
            "available",
            "mind",
            "might",
            "graph",
            "wikipedia",
            "clusters",
            "clickstream",
            "terms",
            "article",
            "analytics",
            "ai",
            "traffic",
            "term",
            "graphs",
            "users",
            "one",
            "dataset",
            "nodes",
            "associated",
            "working",
            "way",
            "used",
            "still",
            "start",
            "see",
            "machine",
            "editors",
            "edges",
            "e",
            "content",
            "connected",
            "comprehensive",
            "based",
            "almost",
            "however",
            "‘",
            "use",
            "times",
            "straightforward",
            "stay",
            "prediction",
            "part",
            "number",
            "note",
            "much",
            "marketing",
            "look",
            "hard",
            "give",
            "get",
            "following",
            "fire",
            "fact",
            "degree",
            "clear",
            "cases",
            "case",
            "biases",
            "applications",
            "anns",
            "ann",
            "also",
            "5",
            "write",
            "wisdom",
            "ways",
            "watchers",
            "warm",
            "visualise",
            "visible",
            "type",
            "try",
            "total",
            "thousands",
            "thought",
            "think",
            "thanks",
            "text",
            "tensorflow",
            "sure",
            "suggesting",
            "sufficient",
            "study",
            "stress",
            "spirit",
            "size",
            "similarity",
            "set",
            "sequence",
            "sense",
            "said",
            "remote",
            "remember",
            "released",
            "relationship",
            "referrer",
            "read",
            "rather",
            "question",
            "pwc",
            "purpose",
            "prominent",
            "process",
            "practically",
            "possible",
            "placed",
            "pieces",
            "perspective",
            "past",
            "parameters",
            "outputs",
            "order",
            "ok",
            "objections",
            "noticed",
            "nlp",
            "next",
            "neighbours",
            "neighbourhood",
            "motivated",
            "motivate",
            "moreover",
            "mitigate",
            "method",
            "media",
            "meaning",
            "make",
            "links",
            "labels",
            "labelled",
            "judging",
            "isolated",
            "interested",
            "indicative",
            "indeed",
            "includes",
            "illustration",
            "helped",
            "hear",
            "hair",
            "groups",
            "grouping",
            "grouped",
            "ground",
            "graphed",
            "googler",
            "going",
            "goal",
            "go",
            "ggraph",
            "generate",
            "g",
            "found",
            "form",
            "follow",
            "field",
            "far",
            "extreme",
            "extent",
            "exposed",
            "exploring",
            "explored",
            "explore",
            "explain",
            "example",
            "ex",
            "end",
            "either",
            "edge",
            "downside",
            "domains",
            "diversity",
            "crowds",
            "course",
            "count",
            "convert",
            "control",
            "contributors",
            "contain",
            "consideration",
            "configured",
            "conclude",
            "concepts",
            "combination",
            "colours",
            "colour",
            "collaborators",
            "coincidence",
            "code",
            "close",
            "clicks",
            "click",
            "clearly",
            "capture",
            "call",
            "buzzword",
            "built",
            "broad",
            "beyond",
            "benefits",
            "automate",
            "authors",
            "area",
            "answer",
            "adaptation",
            "actually",
            "accounting",
            "accept",
            "6",
            "2017"
        ]
    },
    {
        "url": "https://towardsdatascience.com/beyond-the-hype-the-value-of-machine-learning-and-ai-artificial-intelligence-for-businesses-892128f12dd7?source=collection_archive---------5----------------",
        "text": "Picture this: Your marketing software provides actionable guidance on writing innovative, personalized content that will steadily improve conversion rates. Your employees are more engaged and happier, spending less time working on tedious, repetitive tasks such as summarizing articles, tagging content and adding descriptive metadata to images in the CMS. Instead, they are working on creative marketing campaigns and producing fresh, well-received content. Your teams are more productive, translating to company-wide efficiency.\n\nThis scenario is an emerging reality thanks to the practical application of AI in digital marketing. There is no shortage of hype describing how AI will fundamentally change our work and lives in the future. When it comes to AI, it can be hard to separate fact from fiction, and in many cases marketing buzz from practical applications. To understand how AI-powered technologies can impact your business, it’s first essential to understand how the technology is being used today to deliver value.\n\nMarketing technology has been evolving rapidly over the past decade. We have seen Content Management Systems transform into full-featured Customer Experience Platforms. Alongside this platform growth, we have seen an explosion of marketing point solutions. This sheer number of marketing systems has led to a subsequent focus on feature and data interoperability. If you have an email system, a CMS, and a CRM, it’s now much easier to pull that data together, and then to find correlations and insights that can help your business. At the same time computing has advanced to the point where the algorithms and computing power needed to run neural networks or crunch machine learning models are available to any business. There is a confluence here of these two pieces — the affordability of computing power intersecting with massive amounts of data.\n\nTop tech companies including Microsoft, IBM, Alphabet (Google’s parent), and Amazon (just to name a few), are in a race to develop publicly-available cognitive APIs. This category of intelligent services is collectively referred to as Machine Learning as a Service (MLaaS). It’s worth noting that according to Stratistics MRC (global market research company), the MLaaS market is expected to grow to 7.6 billion dollars by 2023. These companies invest in large teams of top computer scientists, linguists, and data scientists, and the work they do provides massive value to all of their customers, allowing other companies to tap into this expertise without the cost of developing the tools themselves.\n\nThe massive tech companies are not only racing to be first-to-market to provide these services, but they also have tremendous use for these technologies internally for their operations, not to overlook the immense potential of not-yet-realized applications and enterprises. This continuing trend of ubiquitous and inexpensive cognitive services is spurring adoption, allowing software providers, systems integrators, and internal development teams to infuse advanced AI-powered features into their software for a fraction of the investment it would have taken even five years ago.\n\nWhile I’m guilty of using ML and AI interchangeably, it’s important to note the distinctions between them. AI is a general classification of programming machines to display characteristics of intelligent behavior or to “think.” Machine learning is a subset of AI in which a system automatically learns and improves with access to data and without explicit programming. The more data provided, the more the system improves performing specific tasks.\n\nMachine learning and AI more broadly have the potential to provide exponential value to businesses over the long-term, but there is no lack of benefits in the short-term. Any organization with departments of content authors who produce large volumes of content (publishing, media, B2B, nonprofits) can benefit from the efficiency of being able to automate a variety of frequent tasks. In the content management space, this includes automated tagging of images and text or the creation of text summaries.\n\nAs far back as several years ago, several media giants including the Associated Press (AP), Fox News, and Yahoo were already using AI-powered software to generate stories and recaps. Though none of this works entirely without human involvement, the tasks AI-powered software can cut down on eliminates employee time spent on such work, availing them to take on higher-value tasks. AI is best viewed as a tool for enhancing human capabilities instead of replacing humans for the time being.\n\nAnother area where machine learning and AI are compelling is in the automation of analytical activities such as segmentation, optimization, and predictive modeling. The race to deliver this capability in off- the-shelf products and services offers the potential of unlocking customer insights that would not have been previously possible without a small army of data scientists.\n\nRecommendation engines are a great example of predictive analytics and one which we are all familiar with through the casual use of popular services. Companies like Amazon and Netflix invest heavily and train machine learning and AI models to make surprisingly relevant and accurate predictions. They have no shortage of data to pull from, given the number of variables that can be tagged, and the various dimensions that can be categorized.\n\nNetflix, for example, can make recommendations based on the description of the content itself (content-based filtering) but also on a user’s previously viewed titles in relation to his or her similarity to other users (collaborative filtering). The combination of these two models known as the hybrid recommendation system is prevalent, and in the case of Netflix, allows the company to provide their customers with personalized content recommendations.\n\nOne downside of these technologies being so easy to adopt is that it becomes easier to fall into the trap of selecting a technology in search of a problem. It’s essential to focus first on the business and use case that will derive the most benefit, and then enlist the right technology to solve that problem. The list below describes the categories of machine learning services that are ready for use today, and potential business use cases that they are particularly well suited to solve.\n\nThe burgeoning field of computer vision includes image, object, and facial recognition. It’s possible to use inexpensive APIs to derive information such as the topic, a text summary, recognized faces, emotion or sentiment, inappropriate or lewd content, or the sex and age of individuals in the photo. If your digital media library has thousands or tens of thousands of images, this can significantly ease manual maintenance of the library, and also provide more helpful ways to search your date when retrieving the content. For example, you could easily find photos of a daytime city street with happy people walking down it.\n\nNatural Language Processing (NLP) is a branch of AI in which systems are developed to understand, interpret, and manipulate human language. Deriving concept or intent of a sentence when accounting for the ambiguities of language is a complicated problem. While this field has existed for over 40 years, factors such as a demand for stronger customer experience through human-machine interaction, advances in computing power, and access to large sets of language data has resulted in a massive boon to the field. Today this area is practically applied to voice interfaces (Alexa), chat interfaces (chatbots), and text mining applications like social media sentiment analysis or comment moderation.\n\nMany of our clients have vast reserves of content that have been meticulously tagged by humans for decades, which is a perfect data set to train a new predictive model. Right now, we are teaching Watson to auto-tag new articles based on a library of previously tagged content. We are also using off-the-shelf models from Microsoft and others to tag content with the sentiment, tone, grade-level, and other aspects relevant to content writing. This application is especially suitable for media or publishing clients.\n\nGiven the vast stores of data many companies have, machine learning and AI-powered services offer a powerful capability to surface actionable insights. By feeding data describing your content or products along with analytics collected from numerous sources and touchpoints with customers, it’s possible to mine the data for correlations and patterns. The system scours the data to discover new customer segments, valuable customer journeys, or recommend content that is more likely to lead to the desired conversion. Amazon, Microsoft, and IBM are deploying a quickly-expanding toolset that allows businesses to integrate with this technology without having to learn and master complex ML algorithms. With the right data and a moderate amount of knowledge about machine learning, you can start building recommendation systems powered by similar technologies that Netflix or Amazon use to personalize content.\n\nIt’s worth mentioning that every time you make an API call, it costs a fraction of a cent. Large companies are providing these cognitive services at little cost as part of their enhanced suite of cloud offerings. For the most part, you are not required to sign up for lengthy contract terms, meaning that the barrier to entry for using these technologies is extremely low.\n\nWhile there is a great deal of hype around the application of AI for improving customer experience and marketing programs, hopefully, this article has helped to show there are many practical uses of this technology available today. We’re taking small, measurable steps right now, so clients can see the positive impact of these solutions for their specific business challenges. We have focused on the use of readily available and cost-effective cognitive services and machine learning APIs that clients can use to automate routine tasks, so their teams can focus on higher-value work like personalized campaigns and content.\n\nIn the next post, we’ll be covering how all of this applies explicitly to challenges we see in the digital marketing space and why we’re keen on helping our clients invest in this technology at this time.\n\nCorey Caplette is Velir’s CTO and is responsible for guiding the technology vision and execution that has earned Velir a reputation as a trusted technology partner. With 15 years of experience in digital, he has built a reputation of bringing a thoughtful and strategic approach to complex technical problems with particular expertise in software development, systems architecture, enterprise content management, and marketing technology integration. Corey oversees Velir’s Solution Architecture, Development, Production Support, Managed Services and IT teams. Corey joined us from Fidelity Investments where he worked as a technologist in the Research and Development group for the Fidelity Center of Applied Technology.\n\nWe are a fully-integrated digital agency based right outside of Boston, in Somerville MA. With a team of over 130 digital professionals, we are best-known for our digital work for some of the world’s largest and most influential non-profit organizations, membership associations, and Fortune 500 enterprises. Our capabilities in marketing technology and data visualization are recognized as the best in the industry, stemming from a 17-year focus on digital strategy, creative design, and web engineering and application development. We have completed complex implementations and large-scale builds for brands including Bayer, the Robert Wood Johnson Foundation, the Metropolitan Museum of Art, AARP, Yale, and Informa. We have been honored with the recognition of “Small Business of the Year” by both the Greater Boston Chamber of Commerce and the Somerville Chamber of Commerce, and have offices in Boston and Washington DC. For more information, please visit www.velir.com.",
        "title": "Beyond the Hype: The Value of Machine Learning and AI (Artificial Intelligence) for Businesses…",
        "keywords": [
            "text mining applications like social media sentiment analysis",
            "integrated digital agency based right outside",
            "taken even five years ago",
            "works entirely without human involvement",
            "“ think .” machine learning",
            "start building recommendation systems powered",
            "marketing software provides actionable guidance",
            "value work like personalized campaigns",
            "top tech companies including microsoft",
            "system improves performing specific tasks",
            "seen content management systems transform",
            "global market research company ),",
            "significantly ease manual maintenance",
            "robert wood johnson foundation",
            "several media giants including",
            "steadily improve conversion rates",
            "discover new customer segments",
            "could easily find photos",
            "ap ), fox news",
            "eliminates employee time spent",
            "featured customer experience platforms",
            "computer vision includes image",
            "alexa ), chat interfaces",
            "many cases marketing buzz",
            "tag new articles based",
            "crunch machine learning models",
            "spending less time working",
            "master complex ml algorithms",
            "enhancing human capabilities instead",
            "corey oversees velir ’",
            "potential business use cases",
            "several years ago",
            "companies like amazon",
            "top computer scientists",
            "brands including bayer",
            "machine learning apis",
            "creative marketing campaigns",
            "valuable customer journeys",
            "surface actionable insights",
            "hybrid recommendation system",
            "complex technical problems",
            "completed complex implementations",
            "massive tech companies",
            "provides massive value",
            "“ small business",
            "stronger customer experience",
            "make recommendations based",
            "improving customer experience",
            "enterprise content management",
            "content management space",
            "two pieces —",
            "system automatically learns",
            "run neural networks",
            "please visit www",
            "new predictive model",
            "lengthy contract terms",
            "includes automated tagging",
            "happy people walking",
            "emerging reality thanks",
            "daytime city street",
            "corey joined us",
            "adding descriptive metadata",
            "6 billion dollars",
            "measurable steps right",
            "machine learning services",
            "specific business challenges",
            "digital media library",
            "130 digital professionals",
            "personalized content recommendations",
            "unlocking customer insights",
            "digital marketing space",
            "without explicit programming",
            "previously viewed titles",
            "manipulate human language",
            "train machine learning",
            "use inexpensive apis",
            "natural language processing",
            "trusted technology partner",
            "perfect data set",
            "computing power needed",
            "computing power intersecting",
            "marketing technology integration",
            "powered services offer",
            "many practical uses",
            "inexpensive cognitive services",
            "effective cognitive services",
            "produce large volumes",
            "previously possible without",
            "particularly well suited",
            "fortune 500 enterprises",
            "collaborative filtering ).",
            "businesses … picture",
            "available cognitive apis",
            "make surprisingly relevant",
            "two models known",
            "feeding data describing",
            "provide exponential value",
            "automate routine tasks",
            "data many companies",
            "allowing software providers",
            "greater boston chamber",
            "previously tagged content",
            "netflix invest heavily",
            "infuse advanced ai",
            "already using ai",
            "internal development teams",
            "marketing point solutions",
            "machine learning",
            "technology available today",
            "practical applications",
            "based filtering",
            "realized applications",
            "personalized content",
            "marketing systems",
            "digital marketing",
            "digital work",
            "tag content",
            "powered software",
            "recommendation engines",
            "value tasks",
            "text summary",
            "text summaries",
            "technology without",
            "technology vision",
            "computing power",
            "machine interaction",
            "marketing technology",
            "time computing",
            "cognitive services",
            "companies invest",
            "right technology",
            "voice interfaces",
            "using ml",
            "system scours",
            "summarizing articles",
            "parent ),",
            "expertise without",
            "email system",
            "desired conversion",
            "corey caplette",
            "chatbots ),",
            "40 years",
            "15 years",
            "right data",
            "ai models",
            "tagging content",
            "marketing programs",
            "systems integrators",
            "systems architecture",
            "tasks ai",
            "powered features",
            "shelf models",
            "digital strategy",
            "large companies",
            "data scientists",
            "repetitive tasks",
            "mlaas market",
            "frequent tasks",
            "software development",
            "every time",
            "powered technologies",
            "sentiment",
            "programming machines",
            "mlaas ).",
            "massive boon",
            "massive amounts",
            "find correlations",
            "creative design",
            "aspects relevant",
            "language data",
            "velir ’",
            "recommend content",
            "received content",
            "personalize content",
            "lewd content",
            "content writing",
            "content authors",
            "taking small",
            "small army",
            "predictive modeling",
            "predictive analytics",
            "immense potential",
            "services offers",
            "popular services",
            "managed services",
            "intelligent services",
            "use today",
            "tremendous use",
            "readily available",
            "earned velir",
            "casual use",
            "amazon use",
            "applied technology",
            "data visualization",
            "data together",
            "data provided",
            "data interoperability",
            "hype describing",
            "world ’",
            "user ’",
            "google ’",
            "deliver value",
            "ai interchangeably",
            "year ”",
            "writing innovative",
            "worth noting",
            "worth mentioning",
            "web engineering",
            "washington dc",
            "vast stores",
            "vast reserves",
            "various dimensions",
            "used today",
            "though none",
            "teaching watson",
            "stratistics mrc",
            "strategic approach",
            "spurring adoption",
            "somerville chamber",
            "solution architecture",
            "shelf products",
            "separate fact",
            "scale builds",
            "profit organizations",
            "products along",
            "production support",
            "producing fresh",
            "practically applied",
            "practical application",
            "platform growth",
            "past decade",
            "particular expertise",
            "numerous sources",
            "next post",
            "much easier",
            "moderate amount",
            "metropolitan museum",
            "meticulously tagged",
            "membership associations",
            "media",
            "large teams",
            "large sets",
            "intelligent behavior",
            "influential non",
            "helpful ways",
            "great deal",
            "generate stories",
            "general classification",
            "fundamentally change",
            "fidelity investments",
            "fidelity center",
            "far back",
            "extremely low",
            "expanding toolset",
            "evolving rapidly",
            "especially suitable",
            "enhanced suite",
            "display characteristics",
            "development group",
            "develop publicly",
            "deriving concept",
            "continuing trend",
            "comment moderation",
            "collectively referred",
            "cloud offerings",
            "clients invest",
            "best viewed",
            "becomes easier",
            "associated press",
            "artificial intelligence",
            "applies explicitly",
            "api call",
            "analytics collected",
            "analytical activities",
            "accurate predictions",
            "year focus",
            "use case",
            "technologies internally",
            "subsequent focus",
            "similar technologies",
            "hype around",
            "application development",
            "also using",
            "also provide",
            "wide efficiency",
            "sheer number",
            "replacing humans",
            "recognized faces",
            "powerful capability",
            "positive impact",
            "one downside",
            "little cost",
            "great example",
            "facial recognition",
            "complicated problem",
            "burgeoning field",
            "another area",
            "allows businesses",
            "focus first",
            "text",
            "human",
            "publishing clients",
            "first essential",
            "seen",
            "research",
            "microsoft",
            "improves",
            "derive information",
            "company",
            "),",
            "systems",
            "right",
            "many",
            "experience",
            "digital",
            "business",
            "companies",
            "work",
            "value",
            "market",
            "time",
            "software",
            "working",
            "instead",
            "capabilities",
            "algorithms",
            "content",
            "potential",
            "make",
            "insights",
            "services",
            "velir",
            "use",
            "language",
            "available",
            "technology",
            "data",
            "’",
            "ai",
            "well",
            "using",
            "train",
            "today",
            "teams",
            "tagged",
            "solutions",
            "provide",
            "possible",
            "point",
            "netflix",
            "library",
            "large",
            "known",
            "enterprises",
            "development",
            "challenges",
            "businesses",
            "boston",
            "automate",
            "amazon",
            "allowing",
            "advanced",
            "technologies",
            "focus",
            "hype",
            "first",
            "clients",
            "application",
            "also",
            "somerville",
            "recognized",
            "recognition",
            "publishing",
            "problem",
            "one",
            "number",
            "information",
            "impact",
            "humans",
            "field",
            "example",
            "essential",
            "efficiency",
            "derive",
            "deliver",
            "cost",
            "correlations",
            "case",
            "capability",
            "best",
            "area",
            "allows",
            "yet",
            "yale",
            "yahoo",
            "would",
            "worked",
            "variety",
            "variables",
            "users",
            "understand",
            "ubiquitous",
            "trap",
            "translating",
            "touchpoints",
            "topic",
            "tools",
            "tool",
            "tone",
            "thousands",
            "thoughtful",
            "term",
            "tens",
            "tedious",
            "technologist",
            "team",
            "tap",
            "take",
            "subset",
            "stemming",
            "solve",
            "similarity",
            "sign",
            "show",
            "shortage",
            "short",
            "sex",
            "service",
            "sentence",
            "selecting",
            "segmentation",
            "see",
            "search",
            "scenario",
            "retrieving",
            "resulted",
            "responsible",
            "required",
            "reputation",
            "relation",
            "recaps",
            "ready",
            "racing",
            "race",
            "quickly",
            "pull",
            "providing",
            "productive",
            "prevalent",
            "photo",
            "patterns",
            "part",
            "overlook",
            "others",
            "organization",
            "optimization",
            "operations",
            "offices",
            "object",
            "note",
            "nonprofits",
            "nlp",
            "name",
            "mine",
            "meaning",
            "long",
            "lives",
            "list",
            "linguists",
            "likely",
            "level",
            "led",
            "learn",
            "lead",
            "largest",
            "lack",
            "knowledge",
            "keen",
            "investment",
            "interpret",
            "intent",
            "integrate",
            "informa",
            "industry",
            "individuals",
            "inappropriate",
            "important",
            "images",
            "ibm",
            "hopefully",
            "honored",
            "higher",
            "helping",
            "helped",
            "help",
            "hard",
            "happier",
            "guilty",
            "guiding",
            "grow",
            "grade",
            "given",
            "future",
            "fully",
            "full",
            "fraction",
            "focused",
            "fiction",
            "feature",
            "familiar",
            "fall",
            "factors",
            "explosion",
            "expected",
            "existed",
            "execution",
            "entry",
            "enlist",
            "engaged",
            "employees",
            "emotion",
            "easy",
            "distinctions",
            "developing",
            "developed",
            "description",
            "describes",
            "deploying",
            "departments",
            "demand",
            "decades",
            "date",
            "cut",
            "customers",
            "cto",
            "crm",
            "creation",
            "covering",
            "costs",
            "confluence",
            "compelling",
            "commerce",
            "comes",
            "combination",
            "com",
            "cms",
            "cent",
            "category",
            "categorized",
            "categories",
            "built",
            "broadly",
            "bringing",
            "branch",
            "beyond",
            "benefits",
            "benefit",
            "barrier",
            "b2b",
            "availing",
            "automation",
            "auto",
            "article",
            "art",
            "ambiguities",
            "alphabet",
            "alongside",
            "age",
            "affordability",
            "advances",
            "adopt",
            "accounting",
            "according",
            "access",
            "able",
            "aarp",
            "7",
            "2023",
            "17"
        ]
    },
    {
        "url": "https://towardsdatascience.com/how-to-build-a-gesture-controlled-web-based-game-using-tensorflow-object-detection-api-587fb7e0f907?source=collection_archive---------6----------------",
        "text": "Control the game paddle by waving your hand in front of your web cam.\n\nWith the TensorFlow object detection api, we have seen examples where models are trained to detect custom objects in images (e.g. detecting hands, toys, racoons, mac n cheese). Naturally, an interesting next step is to explore how these models can be deployed in real world use cases — for example, interaction design.\n\nIn this post, I cover a basic body-as-input interaction example where real time results from a hand tracking model (web cam stream as input) is mapped to the controls of a web-based game (Skyfall). The system demonstrates how the integration of a fairly accurate, light weight hand detection model can be used to track player hands and enable realtime body-as-input interactions.\n\nWant to try it out? Project code is available on Github.\n\nUsing parts of the human body as input has the benefit of being always available as the user is not required to carry any secondary device. Importantly, appropriating parts of the human body for gesture based interaction has been shown to improve user experience [2] and overall engagement [1]. While the idea of body as input is not entirely new, existing approaches which leverage computer vision, wearables and sensors (kinect, wii, [5]) etc sometimes suffer from accuracy challenges, are not always portable and can be challenging to integrate with 3rd party software. Advances in light-weight deep neural networks (DNNs), specifically models for object detection (see [3]) and key point extraction (see [4]) hold promise in addressing these issues and furthering the goal of always available (body as) input. These models allow us track the human body with good accuracy using 2D images and with the benefit of easy integration with a range of applications and devices (desktop, web, mobile). While tracking from 2D images does not give us much depth information, it is still surprisingly valuable in building interactions as shown in the Skyfall game example.\n\nSkyfall is a simple web based game created using planck.js — a 2D physics engine. The play mechanism for SkyFall is simple. 3 types of balls fall from the top of the screen in random order — white balls (worth 10 points), green balls (worth 10 points) and red balls (worth -10 points). Players earn points by moving a paddle to catch the good balls (white and green balls) and avoid bad balls (red balls). In the example below, the player can control the paddle by moving the mouse or by touch (drag) on a mobile device.\n\nThis is a pretty simple and fun game. However, we can make it even more engaging by allowing the user control the paddle using their body (hand). The goal is to accomplish this by detecting hand position using web cam video stream— no additional sensors or wearables.\n\nTo add gesture interaction, we replace the mouse controls above with a system that maps the movement of the players hand to the game paddle position. In the current implementation, a python application (app.py), detects the player’s hand using the TensorFlow object detection api, and streams hand coordinates to the game interface — a web application served using FLASK — over websockets.\n\nIn a previous post, I covered how to build a real-time hand detector using the Tensorflow Object detection api. Please see the blog post to learn more on how the hand tracking model is built. For any errors or issues related to loading the hand model, please see the hand tracking Github repo and issues. This example follows a similar approach where a multi threaded python app reads web cam video feed and outputs bounding boxes for each hand detected.\n\nNote that hand detection is done on a frame-by-frame basis and the system does not automatically track hand across frames. However, this type of inter-frame tracking is useful as it can enable multiple user interaction where we need to track a hand across frames (think a bunch of friends waving their hands or some other common object, each controlling their own paddle). To this end, the current implementation includes naive euclidean distance based tracking where hands seen in similar positions across frames are assigned the same id.\n\nOnce each hand in the frame is detected (and a tracking id assigned), the hand coordinates are then sent to a web socket server which sends it out to connected clients.\n\nThe game interface connects to the web socket server and listens for hand detection data. Each detected hand is used to generate a paddle, and the coordinate of the hand in the video frame is used to relatively position the paddle on the game screen.\n\nThere are several limitations with the current implementation — so contributions, pull requests are most welcome!\n\nHand Detector Improvement\n\nThis entails collecting additional training data and leveraging data augmentation strategies to improve the hand detector. This is important as the entire interaction (and user experience) depends on accurate and robust hand tracking (false positives, false negatives make for bad UX).\n\nThe current implementation uses a simple euclidean based metric to track hands across frames (hand in current frame is identified based on its distance from hands in previous frames). With several overlapping hands, things can get complicated— a more robust tracking algorithm is required. Perhaps integrating a fast tracking algorithm from OpenCV or other sources …\n\nTensorflowjs implementation \n\nConduct some experiments with a TensorFlowjs implementation that allows the entire interaction to be prototyped completely in the browser!!! Tensorflowjs brings so many benefits — easy deployment (no python or Tensorflow installation), no websocket servers and clients, easy reproducibility, more potential users …\n\nThere are existing projects that apply machine learning models in designing interactions. A common example is the use of LSTMs to autocomplete text and create fast email replies (see the Smart Reply paper by Google), and the more recent experiments where image classification models are used as game controls (see Teachable Machines and other Tensorflowjs demos by Google Pair). This work builds on these trends by exploring the use of object detection models in creating interactions.\n\nAs AI algorithms continue to mature (accuracy, speed), there is potential to leverage these advances in building better interactions. This could be generative interfaces that tailor content to the user or predict their intended interaction, models that enable new types of vision-based interactions, conversational UI etc. Across these areas, it is increasingly important to study the mechanics of such interactions, rigorously test these interactions and and create design patterns that inform the use of AI models as first class citizens in interaction design.\n\nGot feedback, comments, want to collaborate? Feel free to reach out — twitter, linkedin.\n\nNote: An earlier version of Skyfall was submitted in January 2018 to the NVIDIA Jetson Challenge.\n\n[1] Shafer, D. M., Carbonara, C. P., and Popova, L. 2011. Spatial presence and perceived reality as predictors of motion-based video game enjoyment. Presence: Teleoperators and Virtual Environments 20(6) 591–619.\n\n[2] Birk, M., and Mandryk, R. L. 2013. Control your game-self: effects of controller type on enjoyment, motivation, and personality in game. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems — CHI ’13 685–694.\n\n[3] Huang, J., Rathod, V., Sun, C., Zhu, M., Korattikara, A., Fathi, A., Fischer, I., Wojna, Z., Song, Y., Guadarrama, S., and Murphy, K. 2017. Speed/accuracy trade-offs for modern convolutional object detectors. CVPR\n\n[5] Harrison, C., Tan, D., and Morris, D. 2010. Skinput: appropriating the body as an input surface. Proceedings of the 28th international conference on Human factors in computing systems — CHI ’10 453.",
        "title": "How to build a Gesture Controlled Web based Game using Tensorflow Object Detection Api",
        "keywords": [
            "computing systems — chi ’ 13 685 – 694",
            "gesture controlled web based game using tensorflow object detection api control",
            "multi threaded python app reads web cam video feed",
            "detecting hand position using web cam video stream —",
            "computing systems — chi ’ 10 453",
            "current implementation includes naive euclidean distance based tracking",
            "simple web based game created using planck",
            "web application served using flask —",
            "give us much depth information",
            "many benefits — easy deployment",
            "entails collecting additional training data",
            "worth 10 points ), green balls",
            "tensorflow object detection api",
            "random order — white balls",
            "real world use cases —",
            "5 ]) etc sometimes suffer",
            "sources … tensorflowjs implementation conduct",
            "automatically track hand across frames",
            "simple euclidean based metric",
            "light weight hand detection model",
            "web cam stream",
            "good accuracy using 2d images",
            "based video game enjoyment",
            "weight deep neural networks",
            "modern convolutional object detectors",
            "leveraging data augmentation strategies",
            "4 ]) hold promise",
            "create fast email replies",
            "apply machine learning models",
            "models allow us track",
            "time hand detector using",
            "mac n cheese ).",
            "dnns ), specifically models",
            "similar positions across frames",
            "gesture based interaction",
            "track hands across frames",
            "hand tracking github repo",
            "enable multiple user interaction",
            "tensorflow installation ),",
            "current implementation —",
            "591 – 619",
            "tracking id assigned ),",
            "worth 10 points",
            "web socket server",
            "object detection models",
            "web cam",
            "add gesture interaction",
            "game interface —",
            "hand detection data",
            "10 points ).",
            "get complicated —",
            "current implementation uses",
            "hand across frames",
            "game paddle position",
            "conversational ui etc",
            "fast tracking algorithm",
            "hand tracking model",
            "real time results",
            "robust hand tracking",
            "game interface connects",
            "robust tracking algorithm",
            "py ), detects",
            "2d physics engine",
            "players earn points",
            "avoid bad balls",
            "hand detector improvement",
            "virtual environments 20",
            "still surprisingly valuable",
            "smart reply paper",
            "previous frames ).",
            "potential users …",
            "outputs bounding boxes",
            "nvidia jetson challenge",
            "key point extraction",
            "interesting next step",
            "image classification models",
            "first class citizens",
            "detect custom objects",
            "create design patterns",
            "3rd party software",
            "bad ux ).",
            "object detection",
            "streams hand coordinates",
            "ai algorithms continue",
            "28th international conference",
            "hand using",
            "enable realtime body",
            "enable new types",
            "red balls ).",
            "z ., song",
            "v ., sun",
            "j ., rathod",
            "based game",
            "google pair ).",
            "several overlapping hands",
            "see teachable machines",
            "python application",
            "player ’",
            "detecting hands",
            "track player hands",
            "video frame",
            "skyfall game example",
            "c ., zhu",
            "c ., tan",
            "false negatives make",
            "building better interactions",
            "current implementation",
            "using parts",
            "paddle using",
            "hand detection",
            "green balls",
            "user control",
            "leverage computer vision",
            "— twitter",
            "js —",
            "input interaction example",
            "improve user experience",
            "identified based",
            "based interactions",
            "relatively position",
            "good balls",
            "tensorflowjs implementation",
            "hand model",
            "common object",
            "hand detector",
            "2d images",
            "google ),",
            "hand ).",
            "web",
            "red balls",
            "players hand",
            "hand coordinates",
            "pretty simple",
            "ai models",
            "game paddle",
            "fun game",
            "current frame",
            "3 ])",
            "frame tracking",
            "interaction design",
            "game controls",
            "balls fall",
            "similar approach",
            "easy reproducibility",
            "app",
            "additional sensors",
            "game screen",
            "speed ),",
            "user experience",
            "tensorflowjs demos",
            "tensorflowjs brings",
            "intended interaction",
            "hand detected",
            "entire interaction",
            "detected hand",
            "skyfall ).",
            "paddle ).",
            "mobile ).",
            "control",
            "sigchi conference",
            "several limitations",
            "hands seen",
            "false positives",
            "entirely new",
            "easy integration",
            "distance",
            "building interactions",
            "accuracy trade",
            "accuracy challenges",
            "p .,",
            "., wojna",
            "., korattikara",
            "., guadarrama",
            "., fischer",
            "., fathi",
            "., carbonara",
            "example follows",
            "common example",
            "previous post",
            "3 types",
            "work builds",
            "websocket servers",
            "tailor content",
            "seen examples",
            "secondary device",
            "rigorously test",
            "python",
            "pull requests",
            "prototyped completely",
            "project code",
            "please see",
            "play mechanism",
            "perhaps integrating",
            "perceived reality",
            "overall engagement",
            "mobile device",
            "january 2018",
            "input surface",
            "input interactions",
            "human factors",
            "human body",
            "got feedback",
            "generative interfaces",
            "feel free",
            "existing projects",
            "existing approaches",
            "earlier version",
            "designing interactions",
            "creating interactions",
            "browser !!!",
            "basic body",
            "autocomplete text",
            "always portable",
            "frame basis",
            "blog post",
            "system demonstrates",
            "spatial presence",
            "simple",
            "recent experiments",
            "issues related",
            "increasingly important",
            "friends waving",
            "fairly accurate",
            "controller type",
            "connected clients",
            "appropriating parts",
            "always available",
            "1 ].",
            "game",
            "tracking",
            "track",
            "across",
            "worth",
            "mouse controls",
            "hand",
            "white",
            "use",
            "real",
            "models",
            "light",
            "5",
            "images",
            "id",
            "hands",
            "github",
            "enjoyment",
            "assigned",
            "accuracy",
            "user",
            "c",
            ".,",
            "example",
            "vision",
            "skyfall",
            "see",
            "potential",
            "player",
            "paddle",
            "make",
            "leverage",
            "interactions",
            "input",
            "improve",
            "body",
            "frame",
            "post",
            "detected",
            "controls",
            "3",
            "waving",
            "type",
            "system",
            "speed",
            "sensors",
            "screen",
            "presence",
            "mouse",
            "issues",
            "integration",
            "important",
            "experiments",
            "clients",
            "available",
            "appropriating",
            "accurate",
            "1",
            "wii",
            "welcome",
            "websockets",
            "wearables",
            "want",
            "useful",
            "used",
            "try",
            "trends",
            "trained",
            "toys",
            "touch",
            "top",
            "think",
            "things",
            "teleoperators",
            "submitted",
            "study",
            "skinput",
            "shown",
            "shafer",
            "sent",
            "sends",
            "self",
            "required",
            "replace",
            "reach",
            "range",
            "racoons",
            "r",
            "proceedings",
            "predictors",
            "predict",
            "popova",
            "personality",
            "opencv",
            "offs",
            "note",
            "need",
            "naturally",
            "murphy",
            "moving",
            "movement",
            "motivation",
            "motion",
            "morris",
            "mechanics",
            "mature",
            "maps",
            "mapped",
            "mandryk",
            "lstms",
            "loading",
            "listens",
            "linkedin",
            "learn",
            "l",
            "kinect",
            "k",
            "inter",
            "integrate",
            "inform",
            "importantly",
            "idea",
            "huang",
            "however",
            "harrison",
            "goal",
            "generate",
            "g",
            "furthering",
            "front",
            "exploring",
            "explore",
            "even",
            "errors",
            "engaging",
            "end",
            "effects",
            "e",
            "drag",
            "done",
            "devices",
            "desktop",
            "deployed",
            "depends",
            "cvpr",
            "covered",
            "cover",
            "could",
            "coordinate",
            "controlling",
            "contributions",
            "comments",
            "collaborate",
            "challenging",
            "catch",
            "carry",
            "bunch",
            "built",
            "build",
            "birk",
            "benefit",
            "areas",
            "applications",
            "allows",
            "allowing",
            "advances",
            "addressing",
            "accomplish",
            "6",
            "2017",
            "2013",
            "2011",
            "2010",
            "2"
        ]
    },
    {
        "url": "https://towardsdatascience.com/an-intro-to-kalman-filters-for-autonomous-vehicles-f43dd2e2004b?source=collection_archive---------7----------------",
        "text": "I have recently completed my Udacity Term2 of Self Driving Car Nanodegree Program and would like to share my views on one of the interesting and cool topic that i came across with ‘Kalman Filter’ . Hope this blog gives you a clear understanding of what it is . enjoy learning :)\n\nAn autonomous vehicle consists of various device through which it collects data and perform an action . Following image show the location of few of the important components used in the vehicle.\n\nData used by the Kalman filter comes from LIDAR and RADAR . So for now will only focus on these two deivces.\n\nWe can use Kalman Filter to make an educated guess , about what the system is going to do next in any place where we have uncertain information about some dynamic system . In case of Autonomous Vehicle Kalman Filter can be used to predict the next set of actions that the car in-front of our autonomous vehicle is going to take based upon the data our vehicle receives . It is an iterative process that uses two step predict and update.\n\nIt is mostly suitable for these type of operations because of the following factors :\n\nI will give you an overview of how all this work followed by an example that will help you understand the math behind it.\n\nKalman Filter is an iterative process that follows two step predict and update\n\nIn this step the Kalman Filter predict the new values from the initial value and then predict the uncertainity/error/variance in our prediction according to the various process noise present in the system.\n\nIn autonomous vehicle process noise can be understood by taking a simple example of a car moving infront of our vehicle. Our model will assume the car to move with a constant velocity due to zero acceleration but in reality it will have acceleration i.e it speed will fluctuate from time to time. This change in acceleration of that car is the uncertainity/error/variance and we introduce it to our system using process noise.\n\nIn this step we take the actual measured value from the devices of the system . In case of autonomous vehicle these devices can be radar or Lidar .We then calculate the difference between the predicted value and the measured value and then decide which value to keep i.e predicted value or measured value by calculating the Kalman Gain. Based upon the decision made by the kalman gain we calculate the new value and and new uncertainty/error/variance .\n\nThis output from the update step is again fed back to the prediction step and the process continues till the difference between the predicted value and the measured value tend to convert to zero.This calculated value will be the prediction/educated guess done by the Kalman Filter.\n\nKalman Gain : It determines whether our predicted or measured value is close to the actual value . Its value ranges from 0 to 1 . If its value is near to 0 then it means predicted value is close to the actual value or if the value is near to 1 then it means final measured value is close to the actual value. Its value ranges from 0 to 1 because it uses the uncertainity/errors in the predicted and the measured value and is represented by the simple formula as show below.\n\nK = Error In Prediction / (Error in Prediction + Error in Measurement)\n\nIn this we will try to understand how the Kalman filter is used in the self driving car based upon the information we have till now .\n\nLets assume a 2D environment in which we have a car and a pedestrian moving by as shown below:\n\np_x and p_y determine the 2D position and v_x and v_y determine the 2D velocity of the pedestrian . This can be represented as x = (p_x,p_y,v_x,v_y). We have to predict the 2D position(p_x′,p_y’) and 2D velocity (v_x′,v_y′) of the pedestrian i.e x′\n\nSince the state vector only models the position and velocity we need to also have the uncertainity/noise so as to model the acceleration, this is done by the process covariance matrix P.\n\nPrediction step :calculates the predicted value x′ and predicted error P′ also know as Process Covariance Matrix by using the following formula:\n\nIt is used to transform the state vector matrix from one form to another . i.e suppose the state of a vehicle is given by position p and velocity v and is not accelerating at time t.\n\nAfter a time particular time say t+1 the new state vector X’ will be\n\nin matrix this can be shown as below:\n\nthen the F matrix will be given by:\n\nIt determines the change in the control input vector μ due to external force(longitudnal or latitudinal force) and internal force(gravity,friction etc.). In context to autonomous vehicle we cannot model the external forces as it varies from one region to region and internal forces as it varies from one model of the car to another. So mostly B.μ=0 .\n\nIt is nothing but determines random noise that might be present in the system. It is added to make the prediction bit accurate.\n\nIt gives uncertainty in the object’s position when predicting location. The model assumes velocity is constant between time intervals, but in reality we know that an object’s velocity can change due to acceleration. The model includes this uncertainty via the process noise.\n\nUpdate Step : A quick recap in update step we do the following:",
        "title": "An intro to Kalman Filters for Autonomous Vehicles –",
        "keywords": [
            "self driving car nanodegree program",
            "predicted error p ′ also know",
            "self driving car based upon",
            "control input vector μ due",
            "new state vector x ’",
            "e x ′ since",
            "predicted value x ′",
            "‘ kalman filter ’",
            "time particular time say",
            "process covariance matrix p",
            "v_x ′, v_y ′)",
            "means final measured value",
            "follows two step predict",
            "p_x ′, p_y ’)",
            "autonomous vehicle process noise",
            "autonomous vehicle kalman filter",
            "various process noise present",
            "uses two step predict",
            "system using process noise",
            "process covariance matrix",
            "autonomous vehicles –",
            "means predicted value",
            "state vector matrix",
            "use kalman filter",
            "kalman filter predict",
            "kalman filter comes",
            "friction etc .).",
            "enjoy learning :)",
            "car moving infront",
            "autonomous vehicle consists",
            "take based upon",
            "measured value tend",
            "process continues till",
            "e predicted value",
            "prediction bit accurate",
            "important components used",
            "determines random noise",
            "actual measured value",
            "constant velocity due",
            "model assumes velocity",
            "following image show",
            "educated guess done",
            "based upon",
            "state vector",
            "process noise",
            "kalman filter",
            "autonomous vehicle",
            "position p",
            "predicted value",
            "object ’",
            "measured value",
            "two deivces",
            "new value",
            "iterative process",
            "various device",
            "educated guess",
            "actual value",
            "kalman gain",
            "kalman filters",
            "change due",
            "time intervals",
            "new values",
            "new uncertainty",
            "vehicle receives",
            "v_y determine",
            "v_y ).",
            "prediction step",
            "f matrix",
            "value ranges",
            "initial value",
            "e suppose",
            "calculated value",
            "p_y determine",
            "dynamic system",
            "velocity v",
            "2d velocity",
            "update step",
            "would like",
            "work followed",
            "uncertainty via",
            "udacity term2",
            "simple formula",
            "recently completed",
            "quick recap",
            "prediction according",
            "pedestrian moving",
            "mostly suitable",
            "mostly b",
            "model includes",
            "math behind",
            "latitudinal force",
            "internal forces",
            "internal force",
            "gives uncertainty",
            "following formula",
            "following factors",
            "fed back",
            "external forces",
            "external force",
            "determines whether",
            "decision made",
            "cool topic",
            "clear understanding",
            "cannot model",
            "came across",
            "blog gives",
            "2d environment",
            "one model",
            "one form",
            "data used",
            "collects data",
            "2d position",
            "x",
            "uncertain information",
            "simple example",
            "predicting location",
            "next set",
            "lets assume",
            "know",
            "error",
            "car",
            "also",
            "one region",
            "predicted",
            "μ",
            "zero acceleration",
            "predict",
            "noise",
            "time",
            "state",
            "vehicle",
            "step",
            "matrix",
            "value",
            "v_x",
            "using",
            "uses",
            "present",
            "p_x",
            "e",
            "system",
            "p_y",
            "velocity",
            "used",
            "till",
            "take",
            "show",
            "prediction",
            "model",
            "following",
            "done",
            "determines",
            "constant",
            "one",
            "position",
            "data",
            "zero",
            "update",
            "region",
            "pedestrian",
            "next",
            "location",
            "information",
            "example",
            "change",
            "assume",
            "acceleration",
            "views",
            "varies",
            "variance",
            "understood",
            "understand",
            "uncertainity",
            "type",
            "try",
            "transform",
            "taking",
            "speed",
            "shown",
            "share",
            "represented",
            "reality",
            "radar",
            "place",
            "perform",
            "overview",
            "output",
            "operations",
            "nothing",
            "need",
            "near",
            "move",
            "models",
            "might",
            "measurement",
            "make",
            "longitudnal",
            "lidar",
            "keep",
            "k",
            "introduce",
            "intro",
            "interesting",
            "hope",
            "help",
            "gravity",
            "going",
            "given",
            "give",
            "front",
            "focus",
            "fluctuate",
            "errors",
            "difference",
            "devices",
            "decide",
            "convert",
            "context",
            "close",
            "case",
            "calculating",
            "calculates",
            "calculate",
            "another",
            "added",
            "actions",
            "action",
            "accelerating",
            "1",
            "0"
        ]
    },
    {
        "url": "https://towardsdatascience.com/3-ways-non-profits-use-emerging-technology-to-further-donor-dollars-and-how-you-can-too-6e4d02ee2569?source=collection_archive---------8----------------",
        "text": "A U.S.-based non-profit organization wants to send clean-burning stoves to rural Guatemalan heads-of-households. The idea is for recipients to use the stoves to start small businesses in support of their families. But what if one of those stoves breaks down?\n\nIxo helps non-profits collect, measure, evaluate, value, and tokenize verifiable impact. Their application of the Internet of Things (IoT) sensors, smart contracts, and blockchain help non-profits serve those in need in real-time, no matter their location. Via IoT sensors, for example, sending brands can monitor product performance from thousands of miles away, troubleshoot problems even before they arise, and then offer instructions to fix them.\n\nFurther, ixo pairs blockchain and smart contracts with IoT sensors to gather data regarding carbon emissions, then issue carbon tokens in real-time — something that, pre-emerging technologies, may have taken a year to process. And, for transparency, blockchain authenticates the IoT sensors so no tampering of data goes unnoticed.\n\n“As a result of these technologies, there’s greater trust between parties, while reducing evaluation costs,” says Fennie Wang, partnership and regulatory lead of the ixo foundation, a nonprofit organization that uses technology to create social impact.\n\nBrands Further Donor Dollars By Matching One Technology to One Use Case at a Time\n\nThough ixo matches myriad emerging technologies to non-profit problems, this approach can be overwhelming for many organizations. So, others are taking a one-case-to-one-technology approach to serve more with less. Learn 3 emerging-technology use cases for non-profits to serve more people with fewer donations:\n\n1. Machine Learning (ML) allows brands to safely cut IT infrastructure costs.\n\nTwenty-two people die daily waiting for an organ. One decision to be an organ, tissue, and eye donor potentially saves 8 lives and enhances 75.\n\nAs a result, Donate Life Month leads to thousands saved as people use social media and other platforms to raise awareness and offer information about organ-donor registration. In turn, supporting organizations rally around those promoting it and news organizations tell stories of those impacted.\n\nIt’s a month of charity, empathy, and lives saved. But, just one technical glitch could down websites where registration and donation opportunities are available. This would mean lives lost and less impactful donations as cause-related organizations struggle to make up for lost user-generated promotional opportunities.\n\n“Because the non-profit sector is so dependent on seasonality, it affects them even more than most industries,” says Dylan Max, growth marketing lead at FogLogic. “To protect themselves from fluctuating demands, many larger non-profit organizations over-provision their IT infrastructure. This keeps them safe but is highly inefficient and costly.”\n\nHe says that ML is the answer. While monitoring system interactions and changes, it pinpoints potential issues, then raises red flags to prevent them. In the end, organizations cut costs on over-the-top infrastructure and can rest assured that prevention and correction measures will happen in time.\n\nGender, location, conflict, familial socioeconomics, disability, and local and national conflict mean 61 million primary school children across the globe have no education access. Pencils of Promise (PoP) is a non-profit that raises money to build public schools in rural Guatemala, Ghana, Nicaragua, and Laos.\n\nAnd while many non-profit organizations rely on long-distance trips to show investors where donations go, Pencils of Promise turned to VR. Using VR, investors experience projects from across the globe. And, in doing so, money that would pay travel costs goes directly toward serving people.\n\n“There is no other medium that allows an immersive, personal experience quite like VR,” says Michael Dougherty, CEO of Pencils of Promise. “Our [VR] film takes supporters inside a rural community in Ghana to experience the transformational impact of education.”\n\nThough VR technologies are expensive, by carefully matching them to a use case, organizations stand to gain greater support for causes and, thereby, offset the cost of producing and offering immersive experiences. Via a 90-second VR film, Pencils of Promise raised a total $1.9 million for school construction.\n\nWhen Opal, a Vervet Monkey, was found by the Centre for the Rehabilitation of Wildlife (CROW) clinical team in Durban, South Africa, she was just 6 days old. The team found her still clinging to her mother, who had been killed by a car. Today, the CROW clinical team searches for a sponsor to cover Opal’s food, lodging, medical and rehabilitation costs.\n\nAnd Opal’s future sponsors can rest assured that CROW focuses on efficient donation usage. A year ago, CROW became a client of Sun Exchange, a blockchain company that helps cut CROW’s electricity costs by 10–40 percent. When asked how blockchain cut CROW’s electricity costs, Abe Cambridge, founder and CEO of Sun Exchange explained:\n\n“NGO’s in underdeveloped markets are using expensive and dirty fossil fuels for electricity, and in those instances, solar energy is drastically cheaper to use but also much more expensive to implement. So we can come in and implement a fully-funded, fully-operational solar energy system that meets all the NGO requirements and they won’t have to pay a penny upfront whatsoever.”\n\nUsing blockchain, anyone from around the globe can join the Sun Exchange platform, and collectively purchase a target number of solar panels to be leased onto the NGO via Sun Exchange, who has them installed on the NGOs rooftop. From there, the NGO pays a rental lease to solar panel owners, which is collected and sent back to the solar panel owners quickly and securely using cryptocurrency blockchain payments.\n\n“Sending payments using new blockchain based digital currencies such as Bitcoin directly to projects is a far more efficient and elegant way of doing it because the sender of the money knows where that money is going specifically, and it takes minutes, not days,” says Abraham.\n\nWith no middlemen, NGOs don’t pay extra international-transactions costs and, using a blockchain-based cryptocurrency, money doesn’t go to currency-exchange fees. Furthermore, investors are given confidence to get involved in projects across borders because they can view where their money is going on CROW’s solar-power online blockchain ledger.\n\nWhen it comes to complex emerging technologies, don’t overthink it.\n\nThe vast capabilities of today’s VR, ML, blockchain, smart contract, and IoT technologies may have some organizations overwhelmed. But, by matching technologies to just one of their costliest use cases, non-profit organizations can cut costs, allowing donor dollars to serve more.\n\nNon-profits affected by seasonality protect their most lucrative donation times via ML. Some cut travel costs via VR experiences. And, still others cut electricity costs via blockchain.\n\nSun Exchange makes it even simpler. Instead of implementing in-house technologies, they offer non-profits technologies-as-a-service. Doing so allows organizations to cut costs in their path to greater efficiency.\n\nTo serve more with less, the starting path is clear: match one use case to one technology. Partner with tech firms to cut implementation costs. And, if you don’t know where to start in identifying your organization’s use case, look to tech-firm expertise to pinpoint the use case with the greatest potential for cutting overhead costs. Your donors and those you serve will thank you!",
        "title": "3 Ways Non-Profits Use Emerging Technology to Further Donor Dollars — And How You Can, Too",
        "keywords": [
            "personal experience quite like vr ,” says michael dougherty",
            "national conflict mean 61 million primary school children across",
            "“ sending payments using new blockchain based digital currencies",
            "would pay travel costs goes directly toward serving people",
            "reducing evaluation costs ,” says fennie wang",
            "time though ixo matches myriad emerging technologies",
            "eye donor potentially saves 8 lives",
            "penny upfront whatsoever .” using blockchain",
            "cut travel costs via vr experiences",
            "still others cut electricity costs via blockchain",
            "industries ,” says dylan max",
            "two people die daily waiting",
            "securely using cryptocurrency blockchain payments",
            "gather data regarding carbon emissions",
            "education .” though vr technologies",
            "lucrative donation times via ml",
            "would mean lives lost",
            "days ,” says abraham",
            "power online blockchain ledger",
            "10 – 40 percent",
            "people use social media",
            "one technical glitch could",
            "news organizations tell stories",
            "film takes supporters inside",
            "donate life month leads",
            "solar panel owners quickly",
            "blockchain cut crow ’",
            "supporting organizations rally around",
            "operational solar energy system",
            "data goes unnoticed",
            "ngo via sun exchange",
            "helps cut crow ’",
            "crow clinical team searches",
            "match one use case",
            "profits use emerging technology",
            "ixo pairs blockchain",
            "cut implementation costs",
            "second vr film",
            "organizations cut costs",
            "pay extra international",
            ".- based non",
            "issue carbon tokens",
            "cutting overhead costs",
            "learn 3 emerging",
            "complex emerging technologies",
            "ixo helps non",
            "blockchain help non",
            "time — something",
            "solar panel owners",
            "projects across borders",
            "“ ngo ’",
            "offering immersive experiences",
            "monitoring system interactions",
            "6 days old",
            "create social impact",
            "monitor product performance",
            "dirty fossil fuels",
            "costliest use cases",
            "build public schools",
            "donor dollars —",
            "allowing donor dollars",
            "sun exchange platform",
            "sun exchange makes",
            "sun exchange explained",
            "related organizations struggle",
            "tokenize verifiable impact",
            "technology use cases",
            "investors experience projects",
            "via iot sensors",
            "using vr",
            "raises red flags",
            "pinpoints potential issues",
            "growth marketing lead",
            "generated promotional opportunities",
            "3 ways non",
            "rural guatemalan heads",
            "efficient donation usage",
            "one use case",
            "based cryptocurrency",
            "start small businesses",
            "cut costs",
            "profit organizations rely",
            "many larger non",
            "matching one technology",
            "cover opal ’",
            "troubleshoot problems even",
            "school construction",
            "profit organization wants",
            "bitcoin directly",
            "9 million",
            "less impactful donations",
            "gain greater support",
            "electricity costs",
            "iot technologies may",
            "sending brands",
            "emerging technologies",
            "still clinging",
            "costly .”",
            "blockchain company",
            "blockchain authenticates",
            "transactions costs",
            "lives saved",
            "safely cut",
            "donor dollars",
            "sun exchange",
            "donation opportunities",
            "ixo foundation",
            "using expensive",
            "infrastructure costs",
            "solar energy",
            "clinical team",
            "use case",
            "rehabilitation costs",
            "education access",
            "one technology",
            "matching technologies",
            "crow ’",
            "says",
            "profits technologies",
            "many organizations",
            "takes minutes",
            "lost user",
            "house technologies",
            "conflict",
            "organization ’",
            "profit organizations",
            "many non",
            "exchange fees",
            "people",
            "ngo requirements",
            "ngo pays",
            "one decision",
            "crow focuses",
            "crow became",
            "organizations stand",
            "organizations overwhelmed",
            "donor registration",
            "uses technology",
            "transformational impact",
            "solar panels",
            "profit problems",
            "opal ’",
            "regulatory lead",
            "offer non",
            "greatest potential",
            "allows organizations",
            "rural guatemala",
            "rural community",
            "nonprofit organization",
            "greater trust",
            "greater efficiency",
            "fewer donations",
            "carefully matching",
            "“",
            "vr",
            "via",
            "pay",
            "experience",
            "across",
            "iot sensors",
            "blockchain",
            "using",
            "raises money",
            "technology approach",
            "team found",
            "profits collect",
            "profits affected",
            "profit sector",
            "today ’",
            "vervet monkey",
            "vast capabilities",
            "underdeveloped markets",
            "target number",
            "south africa",
            "smart contracts",
            "smart contract",
            "show investors",
            "sent back",
            "send clean",
            "rest assured",
            "rental lease",
            "raise awareness",
            "others",
            "offer instructions",
            "offer information",
            "miles away",
            "machine learning",
            "leased onto",
            "highly inefficient",
            "given confidence",
            "get involved",
            "future sponsors",
            "fluctuating demands",
            "firm expertise",
            "familial socioeconomics",
            "even simpler",
            "enhances 75",
            "elegant way",
            "drastically cheaper",
            "distance trips",
            "correction measures",
            "collectively purchase",
            "also much",
            "abe cambridge",
            "donations go",
            "top infrastructure",
            "stoves breaks",
            "promise turned",
            "promise raised",
            "money knows",
            "burning stoves",
            "time",
            "profits serve",
            "year ago",
            "thousands saved",
            "tech firms",
            "starting path",
            "ngos rooftop",
            "going specifically",
            "electricity",
            "allows brands",
            "use",
            "technologies",
            "seasonality protect",
            "ml",
            "one",
            "crow",
            "solar",
            "’",
            "non",
            "month",
            "case",
            "around",
            "projects",
            "iot",
            "profits",
            "profit",
            "support",
            "start",
            "sensors",
            "opal",
            "may",
            "less",
            "investors",
            "immersive",
            "even",
            "efficient",
            "stoves",
            "promise",
            "money",
            "infrastructure",
            "brands",
            "allows",
            "year",
            "today",
            "thousands",
            "tech",
            "serve",
            "seasonality",
            "rehabilitation",
            "registration",
            "protect",
            "path",
            "ngos",
            "going",
            "go",
            "found",
            "expensive",
            "approach",
            "wildlife",
            "websites",
            "view",
            "value",
            "u",
            "twenty",
            "turn",
            "transparency",
            "total",
            "tissue",
            "things",
            "thereby",
            "thank",
            "tampering",
            "taking",
            "taken",
            "sponsor",
            "service",
            "sender",
            "safe",
            "result",
            "recipients",
            "real",
            "provision",
            "promoting",
            "producing",
            "process",
            "prevention",
            "prevent",
            "pre",
            "pop",
            "platforms",
            "pinpoint",
            "pencils",
            "partnership",
            "partner",
            "parties",
            "overwhelming",
            "overthink",
            "organ",
            "offset",
            "nicaragua",
            "need",
            "mother",
            "middlemen",
            "meets",
            "medium",
            "medical",
            "measure",
            "matter",
            "make",
            "look",
            "long",
            "lodging",
            "location",
            "local",
            "laos",
            "know",
            "killed",
            "keeps",
            "join",
            "internet",
            "instead",
            "instances",
            "installed",
            "implementing",
            "implement",
            "impacted",
            "identifying",
            "idea",
            "households",
            "happen",
            "globe",
            "ghana",
            "gender",
            "furthermore",
            "funded",
            "fully",
            "founder",
            "food",
            "foglogic",
            "fix",
            "far",
            "families",
            "example",
            "evaluate",
            "end",
            "empathy",
            "durban",
            "donors",
            "disability",
            "dependent",
            "currency",
            "cost",
            "comes",
            "come",
            "collected",
            "client",
            "clear",
            "charity",
            "changes",
            "ceo",
            "centre",
            "causes",
            "cause",
            "car",
            "available",
            "asked",
            "arise",
            "application",
            "anyone",
            "answer",
            "affects",
            "90",
            "1"
        ]
    },
    {
        "url": "https://towardsdatascience.com/infographic-marketing-10-small-things-that-can-make-a-big-difference-92f18951f54a?source=collection_archive---------9----------------",
        "text": "Humans are visual creatures. That could probably explain why guestographics have become one of the most effective, viral marketing techniques employed by digital marketers of late.\n\nSo, what’s a guestographic? Brian Dean of Backlinko defines guestographics as a combination of three powerful digital marketing tactics: infographics, guest posting and link-building. He even calls it one of his all-time “favorite” SEO strategies.\n\nAs an SEO strategy, using guestographics involves repurposing and republishing your infographic as a guest post on authoritative sites — hence, the term “guestographics.” And by simply writing unique intros to go along with your guestographics, you can get these visuals published on multiple sites with minimal effort.\n\nNeed some inspiration and tips for executing your own guestographics campaign? Here are five case studies of guestographics done right.\n\nYou can view the visual summary of this post below or click here to read a detailed explanation of each tip for promoting guestographics.\n\nYou can imagine how challenging it is to generate buzz for a topic as boring as pest control. But SEO strategist Mike Bonadio did it via a cleverly strategized guestographic campaign, and his unlikely success was so interesting that it was published on Backlinko.\n\nBelow are the results of his campaign:\n\nHere is a partial screenshot of the guestographic he used:\n\nAnd here’s a brief overview of how Mike did it:\n\nWhen Mike launched his guestographics promotion, he tested two types of outreach. One was a soft-sell “feeler” outreach, in which he gauged the receiver’s interest before sending his infographic over.\n\nThe other was a more direct pitch, in which he immediately shared his infographic with the receiver.\n\nThe “feeler” email got a 40% response rate compared to the direct pitch email, which only got 16%, so it was good to know for future campaigns.\n\nTo prospects who responded favorably, Mike sent an email which contained a link to the guestographic and an offer to write a customized intro to go with it.\n\nHere’s how Mike used branded anchor text for his guestographics intro:\n\nSince then, Mike’s infographic has gone viral and shared on sites like Flipboard and Pinterest. Needless to say, his pest control company client definitely got their much-needed traffic boost, and all this from a well thought-out guestographics strategy!\n\nWhen Perrin Carrell of HerePup decided to launch a pet blog, he knew he was entering a populated niche already dominated by blogs such as PetMD.com. Still, he persevered.\n\nBy executing a guestographics campaign, Perrin got a significant leg up, which led to the following results:\n\nBelow is a partial screenshot of the infographic:\n\nAnd here’s how Perrin used guestographics to get ahead of his competitors:\n\nIn Perrin’s case, he identified that the top content could be much improved with a lot more research and design, so he set about creating even better content than the ones he found from more influential sources.\n\nAs a result of adding more engaging media in the form of a visually stunning infographic and promoting it to relevant sites, Perrin was able to break through and stand out from his more established competitors.\n\nControversy can be great publicity. Take this guestographic case study featured on the Ahrefs blog, for example.\n\nThe infographic, titled “What Happens One Hour After Drinking A Can Of Coke,” was originally published on The Renegade Pharmacist. It was based on an 11-year-old article by Wade Meredith about how Coke can wreak havoc on your system within an hour of drinking it.\n\nBelow is a screenshot of the infographic:\n\nHere’s how well this infographic performed:\n\nSo, how did they do it?\n\nApparently, this infographic has the perfect combination of the following ingredients which resulted in it going viral according to Ahrefs:\n\nHere’s how each attribute, in combination with others, influenced the results:\n\nWordstream has successfully launched several infographics, such as “Google’s Biggest Flops & Failures” and their most recent infographic titled “Where’s Google Making Its Money: Top 20 Most Expensive Keywords in Google Adwords Advertising.”\n\nWordstream wrote a case study which outlined how they were able to achieve success with their infographics. It is worth noting that this was made back in 2010, but there is a lot that you can learn from it. Here are the amazing results of their guestographic campaign:\n\nAlthough Wordstream has admitted that infographics do not have the same viral effect as they did in 2010, a quick search of their latest blog post containing the “Where’s Google Making Its Money” guestographic still displays these awesome results:\n\nWhen known online marketers preach about an SEO strategy, you can bet that it works — most of the time.\n\nIn one case study, Neil published an infographic on his blog that, at first, barely received any attention.\n\nBelow is a screenshot of said graphic:\n\nAccording to Neil, his infographic did not get much traffic when he first published it on his blog.\n\nBut when he contributed it to Entrepreneur Magazine, that’s when the magic happened. His guestographic ended up generating over 12K shares!\n\nWhat Neil learned from reviving his underrated guestographic:\n\nSo there you have it: four great case studies that prove the power of guestographics.\n\nAs you can see, guestographics are one of the best strategies that you can execute to give your site a much-needed boost!\n\nAnxious to get on the bandwagon, but don’t have the resources? Then, I recommend you to try out Visme which lets you make infographics in minutes and with no design skills required. Great, right?\n\nLack inspiration? Then go ahead and check this massive list of 101 best Infographic Examples on 19 Different Subjects.\n\nSo, how has guestographics helped your blog to grow? Let me know in the comments below!",
        "title": "Infographic Marketing: 10 Small Things That Can Make a Big Difference",
        "keywords": [
            "pest control company client definitely got",
            "google adwords advertising .” wordstream wrote",
            "time “ favorite ” seo strategies",
            "three powerful digital marketing tactics",
            "sell “ feeler ” outreach",
            "mike used branded anchor text",
            "“ feeler ” email got",
            "money ” guestographic still displays",
            "simply writing unique intros",
            "populated niche already dominated",
            "term “ guestographics .”",
            "known online marketers preach",
            "seo strategist mike bonadio",
            "using guestographics involves repurposing",
            "creating even better content",
            "viral marketing techniques employed",
            "authoritative sites — hence",
            "101 best infographic examples",
            "recent infographic titled “",
            "successfully launched several infographics",
            "cleverly strategized guestographic campaign",
            "guestographic case study featured",
            "four great case studies",
            "latest blog post containing",
            "got 16 %,",
            "“ google ’",
            "five case studies",
            "top content could",
            "tested two types",
            "response rate compared",
            "could probably explain",
            "big difference humans",
            "19 different subjects",
            "10 small things",
            "sites like flipboard",
            "visually stunning infographic",
            "one case study",
            "pest control",
            "needed traffic boost",
            "direct pitch email",
            "design skills required",
            "going viral according",
            "perrin used guestographics",
            "guestographics done right",
            "backlinko defines guestographics",
            "happens one hour",
            "get much traffic",
            "best strategies",
            "titled “",
            "failures ”",
            "digital marketers",
            "infographic marketing",
            "seo strategy",
            "perrin got",
            "case study",
            "mike launched",
            "google making",
            "guestographic campaign",
            "works —",
            "needed boost",
            "even calls",
            "direct pitch",
            "although wordstream",
            "underrated guestographic",
            "guestographic ended",
            "viral effect",
            "relevant sites",
            "multiple sites",
            "guestographics campaign",
            "gone viral",
            "mike ’",
            "mike sent",
            "infographic performed",
            "top 20",
            "guestographics strategy",
            "guestographics promotion",
            "guestographics intro",
            "guestographics helped",
            "guest post",
            "great publicity",
            "pet blog",
            "become one",
            "wreak havoc",
            "worth noting",
            "wade meredith",
            "visual summary",
            "visual creatures",
            "unlikely success",
            "system within",
            "significant leg",
            "said graphic",
            "responded favorably",
            "renegade pharmacist",
            "quick search",
            "promoting guestographics",
            "perrin ’",
            "perrin carrell",
            "old article",
            "much improved",
            "minimal effort",
            "massive list",
            "magic happened",
            "made back",
            "influential sources",
            "herepup decided",
            "guest posting",
            "get ahead",
            "generate buzz",
            "future campaigns",
            "following ingredients",
            "expensive keywords",
            "entrepreneur magazine",
            "engaging media",
            "detailed explanation",
            "customized intro",
            "brief overview",
            "brian dean",
            "biggest flops",
            "barely received",
            "achieve success",
            "12k shares",
            "make infographics",
            "visuals published",
            "originally published",
            "“",
            "following results",
            "awesome results",
            "amazing results",
            "ahrefs blog",
            "neil learned",
            "go along",
            "go ahead",
            "well thought",
            "time",
            "receiver ’",
            "perfect combination",
            "partial screenshot",
            "lack inspiration",
            "immediately shared",
            "established competitors",
            "coke ,”",
            "neil published",
            "first published",
            "wordstream",
            "used",
            "still",
            "outreach",
            "money",
            "email",
            "guestographic",
            "case",
            "mike",
            "infographic",
            "guestographics",
            "post",
            "infographics",
            "great",
            "one",
            "campaign",
            "blog",
            "’",
            "right",
            "perrin",
            "much",
            "hour",
            "get",
            "design",
            "backlinko",
            "according",
            "published",
            "results",
            "neil",
            "go",
            "well",
            "shared",
            "screenshot",
            "receiver",
            "promoting",
            "make",
            "inspiration",
            "first",
            "competitors",
            "combination",
            "coke",
            "ahrefs",
            "year",
            "write",
            "visme",
            "view",
            "via",
            "try",
            "topic",
            "tips",
            "tip",
            "take",
            "stand",
            "soft",
            "site",
            "since",
            "set",
            "sending",
            "see",
            "say",
            "reviving",
            "resulted",
            "result",
            "resources",
            "research",
            "republishing",
            "recommend",
            "read",
            "prove",
            "prospects",
            "power",
            "pinterest",
            "petmd",
            "persevered",
            "outlined",
            "others",
            "ones",
            "offer",
            "needless",
            "need",
            "minutes",
            "lot",
            "link",
            "lets",
            "let",
            "led",
            "learn",
            "launch",
            "late",
            "know",
            "knew",
            "interesting",
            "interest",
            "influenced",
            "imagine",
            "identified",
            "grow",
            "good",
            "give",
            "generating",
            "gauged",
            "found",
            "form",
            "executing",
            "execute",
            "example",
            "entering",
            "effective",
            "drinking",
            "controversy",
            "contributed",
            "contained",
            "comments",
            "com",
            "click",
            "check",
            "challenging",
            "building",
            "break",
            "boring",
            "blogs",
            "bet",
            "based",
            "bandwagon",
            "attribute",
            "attention",
            "apparently",
            "anxious",
            "admitted",
            "adding",
            "able",
            "40",
            "2010",
            "11"
        ]
    }
]