[
    {
        "url": "https://uxforblind.com/teaching-machines-to-see-and-recognize-e0ae66edb394?source=tag_archive---------0----------------", 
        "text": "Tech giants Facebook and Google are working hard on improving machine learning capabilities. They want machine to understand pictures like human do it.\n\nThey have different purpose of their research — google is using this technology to power their Photos app, Facebook is improving accessibility of their platform.\n\nBoth tech can be in handy for visually impaired people.\n\nHere is the latest example from facebook\n\nBoth companies are using neuron networks. And whats interesting there, that with evolving of technology, blind people will be able to get real time audio description of surroundings using onhead cam for example. Of course pushing all the info on whats near you through audio doesnt make sense, though using assistant and asking question can do the work.\n\nImaging this concept but using camera on your head instead of steady image from your facebook feed.\n\n[fbvideo link=”https://www.facebook.com/Engineering/videos/10153621574817200/\" width=”500\" height=”400\" onlyvideo=”1\"]\n\nUsing Dash cam and image analyze your smartphone will be able to predict the obstacles while you move, where there is a puddle or pole ahead and you need to turn to avoid it.\n\nYou can read more on what is Facebook doing on image recognition here: \n\nhttps://code.facebook.com/posts/1478523512478471/teaching-machines-to-see-and-understand-advances-in-ai-research/\n\nhttp://www.fastcompany.com/3052194/elasticity/how-facebook-is-using-ai-to-help-bring-photos-to-life-for-the-blind#3", 
        "title": "Teaching machines to see and recognize –"
    }, 
    {
        "url": "https://medium.com/@HazelChidzanja/guys-this-isn-t-really-a-story-but-i-know-you-feel-left-out-and-that-the-world-is-ending-everyone-cb3c034a7225?source=tag_archive---------1----------------", 
        "text": "Guys this isn’t really a story but… I know you feel left out and that the world is ending, everyone you know and love is gone and you keeps screwing up every friendship and relationship you have and they say it gets better but I don’t think it does, you just have to cope with it grow up, life is full of disappointment fake it till you make it, but then when do you stop faking it when do you show people who your are, have you been faking do you even know the difference any more stop saying shit and do shit fix yourself and then worry about other things, your no different from others, you only seem depressed because others around you seem happy but are they really. Don’t lie to yourself, every time you see someone that has it worse then you, you go home with the biggest smile one your face go on you phone take selfies and your happy for about 5 minutes then you see a snapchat of people having more fun then you and your back to depressing quotes sub tweets. Just stop be normal be your self and stop letting others control your life.", 
        "title": "Guys this isn’t really a story but… I know you feel left out and that the world is ending, everyone…"
    }
]