[
    {
        "url": "https://medium.com/@kuthayasankar/what-is-machine-learning-explain-like-i-am-5-year-old-a8f25aed703d?source=tag_archive---------0----------------", 
        "text": "I had a recent meeting with a person who was introduced to Machine Learning for the first time. It was interesting to know how someone totally new to the field would interpret what Machine Learning would be. He could instantly connect the term learning with what most Data Scientists would call Reinforcement Learning. A machine could observe phenomena and refine itself by itself is what he thought.\n\nIt is weird that the one branch of Artificial Intelligence a layman could best connect to is the one least studied. I hope that Google Deepmind’s recent work in Deep Reinforcement learning would change this.\n\nSo as co-founder of a startup whose core offerings are AI technologies, I find myself explaining Machine Learning (or worse Deep Learning techniques that we use) to a lot of people (clients, potential investors, other enthusiasts) what exactly is Machine Learning and how can we use it. Here I will try to present the same points. It is a very subjective description of the topic and its applications.\n\n“Ok, so what is Machine Learning? ”\n\nMachine Learning is a set of methods which enables the computer to take decisions or infer conclusions without us guiding it.\n\n“So if we don’t guide the computer, how does it learn ?”\n\nJust like a human, a computer can learn from three sources. One is Observing what others did in similar situations. The other is observing a situation and trying to come up with best possible logic on the spot to decide/conclude . The third is learning from previous mistakes/success . These three methods correspond to three branches of Machine learning, Supervised, Unsupervised and Reinforcement learning respectively. In Supervised Learning, a computer can seeing house attributes and prizes of 200 houses, come up with prize of 201th house if its attributes are known. Or, it can tell what word in a sentence is name of a city, given it is shown example sentences which may or may not contain names of cities and every occurrence of a city name is tagged in these examples.\n\nUnsupervised is where we ask the computer to take decisions based on raw data attributes and a set of measurable quantities. Some examples would include asking a computer to come up with localities in a dataset where Lat-Long of house is given. It would use Lat Long to find distances and form localities of house. We can also ask it to come up with a shortened version of a blog post, based on word occurrence in the post. Note that no decisions made by others are given to the computer. As one can imagine, these methods might not be exactly close to human subjectivity, as unlike Supervised learning model, which try to emulate human inference, these models would make decisions based on a few Mathematical quantities we ask them to.\n\nThe third type of learning is Reinforcement Learning. This is a method in which computer starts with making random decisions, and then learns based on errors it makes and successes it encounters as it goes. A recent discovery was an algorithm which could play many different arcade games after learning the correct/wrong moves. These algorithms would start by making lot of failures in the beginning and then get better as they go.\n\nIf you have observed the last paragraph closely, you might have seen I referred to “attributes” more than once. An object’s attributes play keen role in what decision should be taken by computer regarding it. What these attributes should be, was the most important question till some time back for a Data Scientist. For a house price prediction, coming up with these mathematical attributes was easy. Say Carpet Area of house, whether its more than 10 years old, located in city/village, these are easy to infer would influence cost of house. But what about text, images, time series and things like that. Its hard to tell mathematically, what would a human eye look like in a photograph, or a Q-Wave will look like in an ECG report. Deep Learning is asking the computer to infer these patterns by itself. This is accomplished by putting up many layers of neurons on top of each other. Just like neuron is a unit of of brain, it is also a mathematical unit of the Artificial Deep Neural Network.\n\n“How can it help my business ?”\n\nAutomating/Fasten up any decision/inference process. This could be decision to what articles/commodities to recommend to a user, whether to alert user about a credit card transaction or fastening work of a functional analyst, trying to segment spend into categories.\n\nHope this clears some aspects for people trying to get into Machine Learning or for people wandering if it can help their business in some way.\n\nThis article was written by one of our chief scientists, Muktabh Mayank, at ParallelDots.", 
        "title": "What is Machine Learning — Explain like I am 5 years old"
    }
]