[
    {
        "url": "https://medium.com/@samir_vasavada/neural-networks-rethought-d372ceaef8fd?source=tag_archive---------0----------------", 
        "text": "Although the word “Neural” would spark quite a biological discussion, it would also spark a conversation about Artificial Intelligence and Neural Networks. Since the dawn of intelligent beings, the humankind has wondered about how our brains work. And although we have gotten quite far in explaining the reactions that occur in the brain, we are nowhere near being able to fully understand the brain. Similar to the brain, we have barely scratched the surface of neural networks and their possibilities. An artificial neural network (or simply neural network) is an encoded network of nodes which act as “neurons” while mapping out a network of nodes similar to the human brain. The simplest definition of a neural network is stated by Robert Heicht Nelson, the inventor of the first neurocomputer.\n\nNeural networks consist of at least 3 node-layers. The input layer is responsible for identifying and defining the input data. The data then reaches “hidden layers.” Such layers have the name hidden layer as it is quite difficult to distinguish each hidden layer. The hidden layer transfers the input data to viable output data. There can be infinitely many hidden layers. The final layer, known as the output 1 layer, is responsible for outputting the new data. This system of networks have many applications in developing algorithms or recognition software.", 
        "title": "Neural Networks Rethought – Samir Vasavada –"
    }, 
    {
        "url": "https://medium.com/deepgram/find-hidden-data-in-your-calls-e17976a7974f?source=tag_archive---------2----------------", 
        "text": "If you’re like most companies out there, you’ve got a huge pile of recorded calls that you don’t know what to do with. You’d think: “there has to be something really useful in there, but how do I get it out?”.\n\nTechnology has caught up. Speech search has enjoyed astounding progress in recent years and now it’s possible to take your giant bank of phone calls and search through all of it at once.\n\nHaving a fast and accurate search capability for your calls is a boon for business insights. You can run amazing analytics on your sales and support calls, and this can be done on a massive scale — building up a primo dataset to dig into.\n\nWith speech search you can see how what’s said correlates with what matters. This powerful technique is even better utilized if you look at how things things change over time. Essentially, you can link up how your latest customer interactions are affecting your bottom line.\n\nOne particularly awesome use of speech search was implemented by our customer here in the Bay Area, iCracked. They solve an all-too-common problem — fixing your broken iPhone screen. When someone with a broken phone calls iCracked, they send an iTech directly to the customer. In thirty minutes the device is back to pristine condition.\n\niCracked has a huge amount of call data coming in — all day, every day — and they needed a way to find out how things were going in the field. We got those guys rolling with our speech analytics API and we’re glad to say we have some really nice praise:\n\nWe’ve worked really hard to make implementation as seamless as possible and it’s down to a science. The process for looking at your calls goes like this — upload your files, get results.\n\nWe want to help people use speech search to benefit their business. Get in touch with us and we’ll do a test run on your data with a super fast turnaround. You’ll find insights you can’t get anywhere else — it’s that simple.", 
        "title": "Find Hidden Data in your Calls – Deepgram –"
    }
]