[
    {
        "url": "https://blog.hyperverge.co/hyperverge-2-0-part-ii-the-journey-a82d0c0118fe?source=tag_archive---------0----------------", 
        "text": "In our previous post, which also happens to be our first post on the blog, we introduced you to our new brand identity. In this post, we will take you through our branding journey, starting from where we were, how we got here, and where we are headed.\n\nHyperVerge was born out of the Computer Vision Group (CVG) at IIT Madras. We started the Computer Vision Group with a vision of creating a group of students who could develop deep expertise in the technology of computer vision. The members of CVG worked towards creating different modules that would form key components of entries to various international robotics competitions. Apart from working on different academic problem statements, CVG also focused on solving real-life problems faced by industries through consulting assignments. In 2012–2013 the team worked on pilot projects for the Indian Railways (Overhead Line Inspection System), ITC (Biscuit Inspection System), MRF (High speed inspection of tyres), etc.\n\nOur CVG logos were developed using MS PowerPoint (which became our magical go-to tool for all our designs henceforth).\n\nIn summer of 2013, Vignesh (my co-founder) was interning at Microsoft Research, Redmond. While he was there, he constantly kept pinging me and asking me to set up a Skype call. I thought he wanted to discuss about a new Kinect or some new technology that he might have seen at his office. When we finally did get on that call, he said, ‘Listen, I can work for them anytime in the future. We need to start our company now’. I tried scaring him and Kishore (another co-founder) about startups as much as I could (I was already running Lema Labs then). They refused to listen to my reasoning. With a lot of excitement and a bit of fear, we decided to take the plunge.\n\nWe needed to decide a name for our company. Like most naming exercises, this one became interesting only late at night. We thought of Mawobe, Latele, Kahuna and lot more. Finally we decided on HyperVerge. It stands for going beyond the limit — Hyper- (beyond) and Verge (the limit). We felt that this name best captured our journey so far; reaching out towards a crazy goal that was then way beyond our abilities, and somehow making it work!\n\nWe secured our first contract not long after registering the company. It was while preparing this contract that we realized we needed a company logo for it. We could no longer use the CVG one. Frantic work late night, font borrowed from Lema Labs and MS PowerPoint (again!) efforts resulted in us creating a very simple logo in White and Blue.\n\nSoon we decided to focus on the problem of photo organization and using technology of deep-learning to solve the same. As our first prototypes were getting ready, we went to the Bay area last summer (July 2014) to pull off a Kickstarter campaign. We returned with close to a million dollars in funding from some of the top Bay Area VCs!\n\nOne of the first decisions we took after receiving funding was to get a new brand identity. Right away we got in touch with Beard Design. We were always very impressed by their work. In the past we had unsuccessfully tried very hard to convince them to work for a promising young startup — one that is going to be the next big thing but has no cash.\n\nWork with Beard Design started with a tremendous amount of excitement. They sent us an elaborate questionnaire which asked us briefly about the history of the company, what our company stood for, and what our expectations in terms of a logo were.\n\nAs they sent over the first concepts, we went through the standard process that usually happens after hiring any consultant (High excitement — Look at initial concepts — Shock — Are we paying so much money for this?! — Ok, these guys know what they are talking about)\n\nMost design stages were met with a ‘What?!’ reaction from the entire team. With a heavy heart, I called up Beard Design to express our shock and reject the design. Abhisek (no-nonsense founder of Beard design) explained the concept so me in greater detail, and managed to convince me why these designs were right for us (Design 101 tutorials). In turn, I convinced the team. The process moved forward.\n\nFinally we were very happy with what Beard Design delivered. You can see our logo and identity here. We love their work and would recommend them to anyone who is looking for an amazing brand identity.\n\nThanks to Beard, we now have this cool logo that is not made in PowerPoint. It symbolizes in many ways what HyperVerge stands for. Futuristic, Simple and a Brand that is there to stay. This is just the very first step — visual representation. We still have a long way to go in establishing our brand in terms of our products and technology. Our brand is also in the process of developing a personality, one that will grow and evolve in numerous ways.\n\nAll said and done, what I most hope for is that we as a team stay true to the weird idea we started out with — A team of inspired people that will continue to reach out for the impossible and has dogged determination to make it happen!", 
        "title": "2.0 — Part II, the Journey –"
    }
]