[
    {
        "url": "https://medium.com/udacity/this-week-in-machine-learning-13-may-2016-8096c992c209?source=tag_archive---------0----------------", 
        "text": "This week’s top Machine Learning stories, including an amazing story about a virtual teaching assistant, and more!\n\nMachine Learning is one of the most exciting fields in the world. Every week we discover something new, something amazing, something revolutionary. It’s incredible, but it can also be overwhelming. That’s why we created This Week in Machine Learning! Each week we publish a curated list of Machine Learning stories as a resource to help you keep pace with all these exciting developments. New posts will be published here first, and previous posts are archived on the Udacity blog.\n\nWhether you’re currently enrolled in our Machine Learning Nanodegree program, already working in the field, or just pursuing a burgeoning interest in the subject, there will always be something here to inspire you!\n\nA professor in Georgia Tech’s and Udacity’s online MS in Computer Science program uses IBM Watson to create a virtual teaching assistant for an online forum-based class.\n\nUniversity of Washington researchers create a robotic hand that can autonomously learn to perform intricate movements based on its past experiences and failures.\n\nA researcher at the National Kapodistrian University of Athens in Greece develops a model for predicting spikes in refugee arrivals to assist with preparation.\n\nIn a project published in Nature, researchers use machine learning to process and learn from failed chemical reactions documented in researchers’ lab notebooks.\n\nDeep Learning Analytics in Virginia develops an automatic target recognition system for DARPA to improve aircraft pilots’ accuracy when identifying targets.\n\nGoogle adds a new tool to its SyntaxNet framework to help computers parse and understand English sentences, dubbed “Parsey McParseface” by its engineers.", 
        "title": "This Week in Machine Learning, 13 May 2016 – Udacity Inc –"
    }, 
    {
        "url": "https://medium.com/udacity/this-week-in-machine-learning-15-april-2016-f12271e6615d?source=tag_archive---------1----------------", 
        "text": "This week’s top Machine Learning stories, including a TensorFlow update from Google, a new way to combat Type 2 Diabetes, and more!\n\nMachine Learning is one of the most exciting fields in the world. Every week we discover something new, something amazing, something revolutionary. It’s incredible, but it can also be overwhelming. That’s why we created This Week in Machine Learning. Each week we publish a curated list of Machine Learning stories as a resource to help you keep pace with all these exciting developments. New posts will be published here first, and previous posts are archived on the Udacity blog.\n\nWhether you’re currently enrolled in our Machine Learning Nanodegree program, already working in the field, or just pursuing a burgeoning interest in the subject, there will always be something here to inspire you!\n\nGoogle releases an update for its popular TensorFlow system, allowing distributed computing across hundreds of machines at a time.\n\nResearchers at Tel Aviv University use imaging and machine learning to predict literacy rates in Judah 2600 years ago, during the writing of the Bible’s Old Testament.\n\nSeattle-based startup Spare5 combines crowdsourcing with machine learning to help deal with the challenges presented by unstructured, unlabeled data.\n\nSan Francisco-based startup Suggestic uses machine learning to combat Type 2 diabetes with personalized lifestyle interventions and recommendations.\n\nGoogle equips its popular Calendar tool with machine learning to help users find time in their schedules to complete their personal goals.", 
        "title": "This Week in Machine Learning, 15 April 2016 – Udacity Inc –"
    }, 
    {
        "url": "https://medium.com/udacity/this-week-in-machine-learning-6-may-2016-9abc9c7cbd5a?source=tag_archive---------2----------------", 
        "text": "This week’s top Machine Learning stories, including Uber’s plans to phase out surge pricing, a new predictive engine from Seattle, and more!\n\nMachine Learning is one of the most exciting fields in the world. Every week we discover something new, something amazing, something revolutionary. It’s incredible, but it can also be overwhelming. That’s why we created This Week in Machine Learning. Each week we publish a curated list of Machine Learning stories as a resource to help you keep pace with all these exciting developments. New posts will be published here first, and previous posts are archived on the Udacity blog.\n\nWhether you’re currently enrolled in our Machine Learning Nanodegree program, already working in the field, or just pursuing a burgeoning interest in the subject, there will always be something here to inspire you!\n\nUber announces plans to use machine learning to phase out its surge pricing by predicting high-traffic areas and proactively redirecting drivers.\n\nResearchers from Microsoft debut CryptoNets, neural networks that can work on sensitive encrypted data in fields like healthcare, education, and finance.\n\nZooniverse tests the Planetary Response Network (PRN) on the earthquake in Ecuador, rapidly identifying damaged areas and allocating emergency personnel accordingly.\n\nMaterial scientists leverage machine learning to generate and test theoretical materials by learning from the crystal structures of existing materials.\n\nScientists from the Israel Institute of Technology publish an investigation of Deep Q-networks, revealing their success lies in hierarchical aggregations of the state space.\n\nSeattle-based Textio debuts Opportunities, a new predictive engine that helps companies identify and correct male-oriented language in job postings.", 
        "title": "This Week in Machine Learning, 6 May 2016 – Udacity Inc –"
    }, 
    {
        "url": "https://medium.com/udacity/this-week-in-machine-learning-29-april-2016-f92ca8127cc9?source=tag_archive---------3----------------", 
        "text": "This week’s top Machine Learning stories, including an amazing new USB drive, some machine learning-produced vegetarian foods, and more!\n\nMachine Learning is one of the most exciting fields in the world. Every week we discover something new, something amazing, something revolutionary. It’s incredible, but it can also be overwhelming. That’s why we created This Week in Machine Learning. Each week we publish a curated list of Machine Learning stories as a resource to help you keep pace with all these exciting developments. New posts will be published here first, and previous posts are archived on the Udacity blog.\n\nWhether you’re currently enrolled in our Machine Learning Nanodegree program, already working in the field, or just pursuing a burgeoning interest in the subject, there will always be something here to inspire you!\n\nGoogle CEO Sundar Pichai predicts in the company’s annual Founders’ Letter that the mobile device industry “will move from mobile first to an AI first world.”\n\nResearchers at IUPUI and the Regenstrief Institute find that open-source machine learning tools were as good as humans in detecting cancer from textual pathology reports.\n\nScientists for the CERN supercollider in Switzerland release 300TB of data from the Large Hadron Collider into open access for analysis by amateur machine learning engineers.\n\nChip maker Movidius releases the Fathom Neural Compute Stick, a USB drive capable of independently performing advanced image recognition with deep learning.\n\nThe Not Company, a startup in Santiago, Chile, uses machine learning to generate new vegetarian substitutes for animal products like NotMilk, NotMayo, and NotCheese.\n\nLenovo leverages machine learning algorithms to analyze unstructured consumer feedback through social channels like Facebook, YouTube, and Instagram.", 
        "title": "This Week in Machine Learning, 29 April 2016 – Udacity Inc –"
    }, 
    {
        "url": "https://medium.com/udacity/this-week-in-machine-learning-22-april-2016-1e7f6468c908?source=tag_archive---------4----------------", 
        "text": "This week’s top Machine Learning stories, including a deep learning microscope, some Game of Thrones predictions, and more!\n\nMachine Learning is one of the most exciting fields in the world. Every week we discover something new, something amazing, something revolutionary. It’s incredible, but it can also be overwhelming. That’s why we created This Week in Machine Learning. Each week we publish a curated list of Machine Learning stories as a resource to help you keep pace with all these exciting developments. New posts will be published here first, and previous posts are archived on the Udacity blog.\n\nWhether you’re currently enrolled in our Machine Learning Nanodegree program, already working in the field, or just pursuing a burgeoning interest in the subject, there will always be something here to inspire you!\n\nScientists construct a microscope that uses deep learning and artificial intelligence to locate cancer cells more efficiently with 95% accuracy.\n\nResearchers at MIT and PatternEx use machine learning to construct systems that can autonomously learn from and counter cyberattacks in real time.\n\nA group of scientists at Ohio State University use machine learning to identify the area of the brain responsible for recognizing and decoding facial expressions.\n\nTelstra, Australia’s largest telecommunications company, uses machine learning to proactively contact customers before they encounter issues demanding support.\n\nEnergy giant Woodside uses IBM’s Watson to analyze 20 years of information from its oil and gas projects and predict industrial catastrophes before they occur.\n\nStudents at the Technical University of Munich leverage machine learning to predict the likelihood that each main character will die in the sixth season of Game of Thrones.", 
        "title": "This Week in Machine Learning, 22 April 2016 – Udacity Inc –"
    }
]