[
    {
        "url": "https://medium.com/act-news/can-this-chinese-startup-be-the-android-of-ai-69d7fd0c078e?source=tag_archive---------0----------------", 
        "text": "Walking into the offices of Horizons Robotics is a bit like stepping through a transporter into a little piece of Silicon Valley — open plan, ping pong table, coffee nooks, R2D2 model on the boardroom table — but this is northwest Beijing, where you would expect the offices of a tech company to be some suburban portable houses.\n\nHorizons seems to be doing something different. But it’s not just their creative and innovative workplace culture that sets them apart from the big names in China’s tech industry, it’s the product they are developing that seems like a page out of science fiction. It is, in fact, part of a rising global industry.\n\nHorizons Robotics is a Beijing-based startup researching and developing Artificial Intelligence and Robotics. Dr. Yu Kai, founder and CEO of the company, is the former head of Baidu’s Institute of Deep Learning. He describes their mission with a phrase that is short and sweet, but anything but simple: “to define the brain of things”.\n\nHe envisions a world where all the hardware that surrounds us in everyday life will be equipped with artificial intelligence and the average human being will be surrounded by at least ten smart devices. That’s over 60 billion, if you were counting. He wants Horizons to be the ones to do it.\n\n“The vision should be global at the very beginning,” says Yu. “That’s why our VC funding is very global based,” he says, referring to the venture capital funding Horizons has attracted from firms like Sequoia Capital and Hillhouse Capital.\n\nHorizons is leveraging their founding team to attract talent and funding — members of whom worked stints at Baidu, Facebook, Google, Nokia and Huawei. They are working to create a unique business model in the AI sector that may one day translate into monumental growth.\n\nThe company’s focus is on enabling smart homes and autonomous cars, so don’t expect a robot maid to walk off the manufacturing line with a Horizons Robotics trademark any time soon.\n\n“Before seeing a real human-like android robot in your home, I think the first thing that will happen is an upgrade on all the things you are already using in every home,” says Yu, when asked about what Horizons is developing. This would mean equipping refrigerators, air conditioning, ovens and all the other devices and machines in your home with smart functions. I.e., your fridge knows when the milk is off and your oven knows when the roast is done.\n\nYu explains that because Horizons is a small startup with just 60 people, they don’t have the infrastructure or funds to build a complex product like an autonomous car from the axles up, but they feel they can build its brain, meaning the machine’s perception, control and planning abilities.\n\n“We are building platforms,” says Yu, “we want to put the AI inside to empower many many things.”\n\nHe has aspirations to make Horizons the Android of the robotics world, building the indispensable AI platform that can be plugged into all the hardware we use on a daily basis, effectively turning them into robots.\n\nThis is where Horizons is differentiating in the burgeoning field of AI and robotics. Where the big companies like Baidu are developing AI that exists in the cloud to improve their services, Horizons is trying to put those systems into the physical world and make them adaptable for every piece of hardware you can imagine. It is an extension of the trend of going from the PC to the smartphone. Now it is the Internet of Things.\n\nThe AI and robotics sector is dominated by a few big names like Google, Baidu and Facebook, but is also home to a great number of startups specializing in everything from voice recognition to different types of machine learning. These include projects like MetaMind’s image recognition capabilities, X.ai’s virtual personal assistant or the former head of Android Andy Rubin’s AI incubator, Playground Global.\n\nHorizons Robotics does feel like ground zero for China’s first steps into the country’s new push towards a move from manufacturing to innovation, science and technology. Thanks to the “Internet Plus” policy that’s been in place since last March, the Chinese government is encouraging the kind of business model that Horizons represents — creating value from science and technology as opposed to manufacturing and labor.\n\nRising computational power and the advent of big data are making AI and robotics a field with ever growing potential.\n\nAs far as the future for Horizons Robotics goes, Yu says the company has already established partnerships with some established Chinese brands. He says they want to prove themselves first and then release their platform on a larger level.\n\nThere is a mysterious product release planned for March 1st.\n\n“It’s a kind of intelligent machine in your home. Every home is using it right now. But we just made it smart,” he said.", 
        "title": "Can this Chinese startup founded by the man behind Baidu’s deep learning research be the Android of…"
    }
]