[
    {
        "url": "https://medium.com/planet-stories/cloudless-an-open-source-computer-vision-tool-for-satellite-imagery-6f4daaa4851f?source=tag_archive---------0----------------", 
        "text": "I’m proud to announce the 1.0 release of Cloudless, an open source computer vision pipeline for orbital satellite data, powered by data from Planet Labs and using deep learning under the covers. The Cloudless project was born during Dropbox’s week-long Hack Week, a tradition where engineers and invited guests get to work on any project, no matter how blue sky. Cloudless was created by Johann Hauswald, Max Nova, and myself.\n\nOne of the most exciting goals of Planet Labs’ fleet of satellites is to produce daily imagery of the earth’s surface, creating a flood of visual data that is greater than any person can efficiently process. Can we have computers do the detection and localization of items in orbital satellite data instead?\n\nDeep learning applies biologically-inspired computer neural networks to solving difficult problems in computer vision, language understanding, and more. It is a natural fit for automated detection in satellite imagery.\n\nIn Cloudless we decided to focus initially on applying deep learning to detecting clouds in Planet Labs’ satellite imagery. Eliminating or ignoring clouds is an important pre-processing step for nanosat imagery, as we want to track changes on the ground — cars appearing, forests disappearing, etc. — instead of changes in cloud cover. Being able to first detect clouds is therefore important.\n\nNote that even though the Cloudless pipeline is currently focused on cloud detection and localization, the entire pipeline focuses on the needs of any visual orbital detection and localization task and can be applied to other problems with some modification.\n\nThe Cloudless pipeline consists of three pieces:\n\nHere are examples showing the original image and detected clouds; detected clouds are overlaid with yellow boxes below:\n\nI’ve enjoyed working with Planet Lab’s API while creating Cloudless, whether it is the ease-of-use and power of the API, the scope and availability of Planet Lab’s satellite imagery, or how helpful everyone at Planet Labs was with our questions. If you’re thinking of using Planet Labs’ API, I highly recommend it!\n\nLearn more about Cloudless here.", 
        "title": "Cloudless: An Open Source Computer Vision Tool for Satellite Imagery"
    }, 
    {
        "url": "https://medium.com/@eerwitt/judges-awarded-me-3rd-but-i-personally-won-850c6a98d4cd?source=tag_archive---------1----------------", 
        "text": "Last year I was a finalist in LDV Vision Summit Entrepreneurial Computer Vision Challenges. The challenge pushed me to expand my capabilities and then rewarded me with connections to industry experts. The judges awarded me 3rd place in the competition but I feel that I personally won!\n\nThe challenge was to “Estimate the price of a home or property” which I accepted by estimating property value based solely on its image. I was able to present on stage in front of an audience who shared my passion for computer vision. After presenting, I was approached by industry experts to discuss my solution and further work in the industry. As Evan Nisselson put it in his blog post “Entering competitions increase your odds of being recruited, raising capital, or selling for more than $100M” which I now find completely accurate.\n\nMy fellow competitors were brilliant computer vision PhD students and entrepreneurs. Competing with incredibly talented and down to earth experts was inspiring. Speaking with competitors before and after the competition gave me insights on problems I ran into. From those experiences, I was able to implement further improvements with my approaches to training Neural Networks based on property images.\n\nThe greatest benefit I received from the summit was the pre-event mentor sessions and sub-finalist judging sessions with the LDV Vision Summit. Their mentoring taught me how to improve my project’s ability to become a business. They took time and a hands-on approach to guide me in how I may improve.\n\nThe LDV Vision Summit introduced me to global business and research leaders who share my passion for computer vision. Networking at the summit after my presentation directly contributed to new international business opportunities and these connections led me to build my hack into a project capable of generating revenue.\n\nAfter the summit, my connections didn’t dry up. My network kept strong and led me to work in SF doing what I love!\n\nThis is the only competition which attracts such high caliber of attendees across visual technology and more. You should definitely apply, there is no other route to present in front of this level of attendees.\n\nIt was an awesome experience and I hope everyone will get a chance to do the same!\n\nThe next summit is May 24 & 25, 2016 in NYC.", 
        "title": "Judges Awarded Me 3rd but I Personally Won – Erik Erwitt –"
    }
]