[
    {
        "url": "https://medium.com/@itsquiz15/6-trends-for-artificial-intelligence-in-2016-3807c710d5dd?source=tag_archive---------0----------------", 
        "text": "Artificial intelligence gives people hope that science fiction will become the reality. But some people are afraid of bots and the new technology. This year Google’s executive chairman said that AI has many benefits for human and motivate not to be scary about it. Let’s talk about the most popular trends for artificial intelligence that TechRepublic figured out.\n\nDeep Learning gave the life voice and image recognition software. The simultaneous translation and automatic photo groupings, self-driving cars are also AI benefits. Medicine and psychology use deep learning as well. Nowadays bots may teach itself to do something. Deep Learning AI systems such as AlphaGO can overcome the best humans at games. Microsoft has applied deep learning in its Bing voice search and Windows Phone.\n\nDeep Learning is a many layered network of software modules, and each layer takes and delivers inputs and outputs. The module helps in making decision and problem solving. The software is aimed to simulate the neocortex’s array of neurons in an artificial “neural set”. The improvements in mathematical formulas may bring us new possibilities in this.\n\nOxford University made a tool predicting possibility to automate particular job. They said that 97,6% risk for the accountants.\n\nCompanies use AI for analytics big data (57,9%), automated communicating with the business audience (48,5%), with customers (13,5), to performance manual and routine assignments (6,1%), monitoring business situation (4,6%). For instance, The World Economic Forum had a nonhuman delegate as well.\n\nThe psychologist may be a virtual human because researches proved that it’s easy for people to be more open in a conversation with AI. Also, artificial intelligence replaced hotel staff in Japan. Quill (natural language generation system) communicates with the customers to expand their base or fulfill the communication requirements with the current clients.\n\nIt means the ability of the things be connected to the something else. It will increase the amount of the available data. The IoT assumes wired or wireless internet-connected sensors that attached to any desired object. For example, if you have iPhone, your actions may be analyzed and acted upon.\n\nThis theme is wide discussed nowadays because of its great possibilities. It sets to transform different areas of business and our lives. IoT uses in transportation, manufacturing, consumer applications and smart city, and it spreads in other areas.\n\nArtificial intelligence became able to detect the person’s emotional state. For example, non-human psychologist notices the distressed people with the shorter and not less intense smiles; the anxious people that fidget with their hands. Many people don’t pronounce vowel sounds clearly in the depression that helps to identify the mental disease. The robot interprets your smile, tone, and behavior to gather the information about your emotional state. It is a really great breakthrough in the medicine.\n\nCompanies started to use AI to satisfy the clients by helping them to search the appropriate stuff. They may describe what they want or show the thing with additional options and the artificial intelligence has to find it. This technology brings customer service to the new level. Bots may answer the email and phone, chat and suggest the problem solving to the customers.\n\nAI may replace operators in the call-center. The bots will learn to work by watching and all responsibilities will be automated.\n\nPeople know from the childhood what to do in the difficult ethical situation but programmers have to make the understanding for bots what to decide in such cases. It is critical that artificial intelligence will be provided with human-friendly motivations.\n\nThe ethical problems arise in current automation and information systems. Some experts say that artificial intelligence may outperform humans in moral thinking.\n\nThese trends show us great possibilities for business, medicine, and our daily lives, but we see some challenges as well. It is exciting to observe the situation in an attempt to predict when the robot will be our helpful tool in each area of life. The scientists work on the issue to improve the artificial intelligence functions.", 
        "title": "6 trends for artificial intelligence in 2016 – Itsquiz –"
    }, 
    {
        "url": "https://medium.com/@CaliforniaSafari/they-realized-an-impossible-dream-372fcce74d33?source=tag_archive---------1----------------", 
        "text": "The building of the San Francisco Golden Gate Bridge was an Impossible Dream and that dream celebrated its 75th anniversary with fireworks.\n\nThe world’s most photographed, the Golden Gate Bridge is one of the seven civil engineering wonders of the United States. How did it get built?\n\nFor over one hundred years, they wanted to build this bridge and it was in the middle of the Great Depression that construction began in 1933. But the work really began in 1919 when city engineer Michael O’Shaughnessy began looking for a way to build it at a reasonable cost. The state of California got involved in 1923 when they passed the Golden Gate Bridge and Highway District Act for the purpose of planning, designing and financing construction.\n\nDon’t build the bridge. Why? On the grounds of natural beauty — the bridge would reduce the panorama of the San Francisco Bay. Shipping would be slowed down. And earthquakes could bring down the bridge — like the 1906 disaster which almost burned down the entire city. Community leaders and industry joined forces to rule out the bridge building before it could begin.\n\nOvercoming the Odds, the Team Pushed Through\n\nThe construction project was immense: They had to move 3.25 million cubic feet of dirt to establish the bridge’s 12-story-tall anchorages — which were to be set where there was then a raging ocean surging through the channel. Brave divers went down 90 feet through strong currents to blast rock and take out the debris.\n\nDuring the Great Depression, there was no shortage of workers for the steady jobs even when such dangers were involved. The suspension cables were a big success with 25,000 individual wires tied onsite into two 7,650-foot cables in six months, half the scheduled time.\n\nThe Golden Gate Bridge, Inspiration for Startups Everywhere\n\nThe lessons of the Golden Gate live on — taken to heart by every startup entrepreneur, every innovator, every person with a dream who works to make their dream come true.\n\nYes, it is impossible.\n\nYes, there will be fierce resistance.\n\nYes, it will take teamwork.\n\nYes, we will celebrate in the end when we succeed.\n\nSome communities are better places for risk takers. Silicon Valley and Hollywood are not easy places to live or work. But the greatest wealth in human history has been created in California in the past few decades. You owe it to yourself to see what lies behind realizing such impossible dreams.\n\nWe at California Safari believe more young leaders should have the opportunity to understand what it takes to realize Impossible Dreams.\n\nLearn all the secrets to Silicon Valley, Silicon Beach and Hollywood while on the adventure of your life in California!\n\nVisit: TeenLeadershipTrips.com", 
        "title": "They Realized An Impossible Dream – CaliforniaSafari –"
    }
]