[
    {
        "url": "https://medium.com/@atveit/deep-learning-for-named-entity-recognition-50f779a82a50?source=tag_archive---------0----------------", 
        "text": "About a year ago I wrote a blog post about recent research in Deep Learning for Natural Language Processing covering several subareas. One of the areas I didn’t cover was Deep Learning for Named Entity Recognition — so here are some interesting recent (2015–2016) papers related to that:\n\nbtw: if you want to work (with me) as a Data Scientist on Deep Learning, check out this position", 
        "title": "Deep Learning for Named Entity Recognition – Amund Tveit –"
    }, 
    {
        "url": "https://medium.com/@atveit/deep-learning-for-text-summarization-f029a5402be2?source=tag_archive---------1----------------", 
        "text": "A few years back I was involved in a project trying to do realtime/low latency text summarization (without deep learning) using a Nvidia Tesla C1060 GPU (roughly state-of-the-art GPU back then), the motivation for doing realtime summarization was driven by an idea of improving search results in general. The issue with search is that it typically returns disjunct results (with somewhat arbitrary relationship between each search result), instead of providing a coherent answer to the query in a more cross-result and summarized way (it has query driven summaries — snippets — on individual result level though, but not cross result). The project unfortunately never materialized in the form of great results, so it is great to see that Deep Learning based summarization is thriving (with much more powerful GPUs this time). See below for some recent research papers on Deep Learning based summarization:\n\nbtw: if you want to work (with me) as a Data Scientist on Deep Learning, check out this position", 
        "title": "Deep Learning for Text Summarization – Amund Tveit –"
    }, 
    {
        "url": "https://medium.com/the-circular-theory/why-circularity-explains-everything-e8b9c8b81d7?source=tag_archive---------2----------------", 
        "text": "Zero and one is X and Y, diameter and circumference of, a circle.\n\nThere is a hidden circle between me and you (observer and observation), and, this explains everything. We are taught not to use circular reasoning, although this teaching, itself, is circular, because it contains the word ‘not.’ That is, is, and, is-not, share a circle, thus equal is, half-the-time, not-equal.\n\nAgain, this explains everything. (You will, probably, have to think about it some.) (It will have to think about you, some.)\n\nIn physics, we have what is called ‘the quantum zeno effect’ which, roughly, means, a state is dependent on an alternate state. This means two (not-one) is the basic number in nature, and this is very easy to observe (male and female, X and Y, Y and N, T and F, etc).\n\nThus, two, then, is the basic structure of nature and we see this, clearly, in seasonal (cyclical) behavior. In fact, a basic circuit (switch) is based on a two-state system. So, if a two-state system is basic, how can we use this to understand circularity as the basis for everything?\n\nYou can visualize a universal ‘link’ as the diameter of a circle. Meaning, X is linked to X (any X) by a hidden (or imaginary) line, which has to be both diameter and circumference of a circle. Voila! You have just collapsed the universe into one circle.\n\nSo, how did you do this? Again, this is very easy (maybe too easy) to figure out. Mind and matter share the ubiquitous (hidden) circle, thus, the mathematical name for mind (and matter) has to be PI.\n\nTherefore, pi (mind) (also, known, in some systems. as nature, god, higher power) connects everything to everything (so within us, in the place we call ‘mind,’ we are connected to everything) (and everything is connected to ‘us’).\n\nSo, if you try to discuss mind with anyone, you will end up with a circular argument, and, you will, as you already know, get nowhere, because mind is indiscernible (and unexplainable), and this explains why religions came to be, and, why they still exist.\n\nIt also explains why mathematics, and technology, is our current ‘religion.’ Zero and one is X and Y, the conservation of the circle, thus circularity controls everything, and you can use this as a strategic (thought) weapon. Conservation of the circle is the core dynamic in nature. Controlling everything. Especially mind, sharing a circle with matter. Known in technology as virtual. Reality.\n\nConservation of the circle is the core dynamic in nature.", 
        "title": "Why Circularity Explains Everything – The Circular Theory –"
    }
]