[
    {
        "url": "https://towardsdatascience.com/building-a-deep-neural-net-in-google-sheets-49cdaf466da0?source=user_profile---------1----------------",
        "title": "Building a Deep Neural Net In Google Sheets –",
        "text": "I want to show you that Deep Convolutional Neural Nets are not nearly as intimidating as they sound. And I’ll prove it by showing you an implementation of one that I made in Google Sheets. It’s available here. Copy it (use the File → Make a copy option in top left) , and you can then play around with it to see how the different levers affect the model’s prediction.\n\nThe rest of the article will be a short intro to understand the high level intuitions behind Convolutional Neural Nets (CNN), and then some recommended resources for further information.\n\nBefore continuing, I’d like to make a shout out to FastAI. I recently finished their wonderful deep learning course, and all inspiration and credit really goes to them. The fantastic instructor Jeremy Howard, with his co-founder Rachel Thomas showed the class the idea of doing a CNN in Excel. But as far as I could tell, the spreadsheet was not available online, and also didn’t seem to fully complete the network. I’m doing a small extension to their work, and putting it on Google Sheets so it’s easier for everyone to play around with.\n\nI trained a (very) simple CNN on the MNIST data set, which is a bunch of black and white images of handwritten digits. Each image is 28x28 pixels. Each pixel gets represented as a number between 0 (no ink) and 1 (maximum ink). It’s a classic data set to use because it’s small enough to be quick, but real enough to show the complexity of machine learning. The job of the model is to determine what number the image is. Each image will always be of exactly one number 0–9.\n\nI trained the model using a popular deep learning library called Keras (see that code here), and then put the trained weights from my model into Sheets. The trained weights are just numbers. To put it into Sheets, this meant literally copying and pasting a bunch of numbers from my model into Sheets. The last step was adding formulas to replicate what the model does, which is just regular old multiplication and addition. Let me reiterate that: the math to replicate a deep learning model’s predictions stops at multiplication and addition [1].\n\nThere are weights (a.k.a. “parameters”) in each layer of the model. Weights are automatically learned by any machine learning model. This model has around 1000 weights. More complex models can easily have hundreds of millions. You can see all 1000 of this model’s weights below:\n\nYou use CNN’s to find patterns in sequential data where you’re pretty positive patterns exist, yet you find it hard to put those patterns into words, or to extract them through simple rules. CNN’s assume order matters.\n\nFor example, classifying pictures are a prime use case for CNN’s, because the pixels are logically sequential, and it’s clear to any human that there’s loads of patterns. Yet, just try putting into words exactly what separates a cat from a chihuahua, and you’ll see why CNN’s are useful.\n\nOn the other hand, if you’ve got current baseball stats between two teams, and you want to predict the winner, then CNN’s would be a weird choice. The data you have (eg. number of wins, losses, or team batting average) is not inherently sequential. Order doesn’t matter there, and we have already extracted the patterns we believe to be useful. So CNN’s won’t be helpful.\n\nTo understand these beasts, let’s break apart the Deep Convolutional Neural Net into it’s constituent parts of “Deep”, “Convolutional” and “Neural Net”.\n\nImagine for a minute that you’re blind. But your job is to figure out what digit this handwritten image is of. You’re allowed to talk to someone who sees the image, but they have no idea what numbers are. So all you can ask them is simple questions. What could you do?\n\nOne approach you could take is to ask things like, “Is it mostly straight at the top?”, “diagonal from right to left?”, etc. With enough questions like that, you could actually take a pretty good guess that it’s a 7, or a 2, or whatever.\n\nIntuitively, that’s what the convolutions are doing. The computer is blind, so it does what it can and asks lots of little pattern questions.\n\nTo ask those questions, every pixel in the image gets run through a function (a.k.a. “convolution”) that produces a corresponding pixel, which answers one of those little pattern questions. Convolutions use filters to find patterns. For example, notice how the filter above (no. 2 in the screenshot) is more red on the right side, and less red on the left. That filter will essentially look for left edges.\n\nIt may not be obvious why it will find left edges, but play with the spreadsheet and you’ll see for yourself that’s how the math works out. Filters find things that look like themselves. And CNN’s will often use hundreds of filters, so you get lots of little “scores” for each pixel, kind of like a left-edge score, top-edge score, diagonals, corners, etc.\n\nOk, so asking about edges is cool, but what about more complex shapes?” This is where the “deep” multiple layers thing comes in. Because now that we have a “left-edge”, “top-edge”, and other simple “filters” of the image, we can add another layer, and run convolutions on all the previous filters, and combine them! So combining 50/50 a left edge and top edge could give you a rounded left corner. Cool, huh?\n\nSerious CNN’s will have many layers, which allow the model to build up increasingly abstract and complex shapes. Even after only 4 or 5 layers, your model could start finding faces, animals, and all kinds of meaningful shapes.\n\nNow you might be asking yourself, “So that’s all great, but coming up with all the right filters sounds really tedious.” “And what about at the end? How do I combine all the answers from those filters into something useful?”.\n\nFirst it’s useful to realize that at a high level, our CNN really has two “sections” to it. The first section, the convolutions, finds useful features in our image data for us. The second section, the “dense” layers (so named because there are so many weights tying to every neuron) towards the end of the spreadsheet, do the classifying for us. Once you have the features, the dense layers really aren’t that dissimilar from running a bunch of linear regressions and combining them into a score for each possible number. The highest score is the model’s guess.\n\nFiguring out all the right weights to use for the filters and the Dense layers at the end would be really annoying. Luckily figuring out those weights automatically is kind of the entire point of NN’s, so we don’t need to worry about that. But if you’re curious, you should google “back propagation”.\n\nThere’s roughly two parts to every CNN. The convolutions, which always go at the beginning to find useful features in the image, and the layers at the end, often called “dense” layers, which classify things based on those features.\n\nTo get a real feel for them, I would encourage you to play with the spreadsheet. Trace a pixel from beginning to end. Mess with the filters, and see what happens. I also explain more technical details in the comments of the spreadsheet.\n\nTo learn more, I recommend the following resources:\n\nInteractive Convolutions — A killer interactive tutorial on convolutions (ie. just the C part, not the NN part) by Victor Powell.\n\nPractical Deep Learning for Coders — The course from Fast.AI which I took, and learned a lot from. It’s online and completely free.\n\nGreat video showing basics of CNN — This is from Jeremy Howard (FastAI founder), and is a 20 minute video going over CNN’s. It’s excellent. The video is embedded in that page. Start from minute 21 when you open the video.\n\n[1] — The math required to train the CNN includes calculus, so it can automatically adjust the weights. But once the model is trained, it does actually only require multiplication and addition to do predictions. And in practice, the calculus is handled by whatever deep learning library you’re using."
    },
    {
        "url": "https://medium.com/@bwest87/the-accelerating-importance-of-willpower-648fc9af73c1?source=user_profile---------2----------------",
        "title": "The Accelerating Importance of Willpower – blake west –",
        "text": "That’s former NAVY SEAL, Adm. William H. McRaven expounding on the virtues of willpower. Few people understand willpower quite the way SEAL’s do. And while everyone gets that it’s very important, it may be less obvious that willpower is actually rapidly increasing in importance because of the double edged sword that is technology. In fact, it will continue to increase at the rate that technology becomes more pervasive in our lives, which is to say faster and faster.\n\nFirst, a primer; willpower is the thing that lets you make good long-term decisions every day. The ability to go to the gym, not buy dessert, or save money. You have a very limited amount of willpower that dwindles throughout the day (this is clinically verified). Every decision takes willpower. Even every online ad you see shaves a bit more off your daily count when you decide not to click on it.\n\nLet’s call what you have at the end of the day your “net willpower”. That’s what you have left to improve yourself, work on side projects, eat right, etc.\n\nOne edge of the tech sword is attacking your net willpower every day. Gaming companies are hiring psychology PhD’s to help make their games more addictive. Amazon and Google use thousands of data points on you to make the ads as attractive as possible. Have you noticed the New York Times has a “suggested” article fly in from the right side when you near the end of the article you’re reading? It’s non-stop questions that you have to respond “no” to in order to get on with your day.\n\nBut technology is just a tool, so while the one edge is on a non-stop assault of your willpower, the other is cutting non-stop opportunities. Online education is better and more open than ever. Any book can be downloaded instantly. There are more events to know about, and more news to empower you, all for free, no matter where you are.\n\nThese facts suggest two interesting ideas. One is that as more and more willpower gets taken away from us daily, then your net willpower becomes ever more important. Let’s say you start with 10 “willpower points” every day. 5 years ago, life reduced that by 5, so your net will power was 5. But today, under new stresses, it gets reduced to 4. That’s a 20% reduction. One more would be a 33% reduction. The next, 50%. Since the initial amount is likely to stay the same (people aren’t changing), every extra bit that modern life takes away is a higher percentage of the net willpower than the last. This makes whatever you do have left all the more valuable.\n\nThe second point brings it all together. If net willpower supply keeps dwindling, then the percentage difference among people will increase (smaller numbers, same absolute difference). This will create a growing divide among people who have more willpower and people who don’t. And then here’s the real kicker, since there are ever more productive ways to spend your willpower at all times, the opportunity cost of your time is going up and up. This will further exacerbate the divide between those who use their willpower well, and those who don’t.\n\nThinking historically, this is just a continuation of the trend that technology empowers those with the discipline (and resources) to take advantage. Before the lightbulb, it was tougher to read at night. Even if you were smart and ambitious, you may not have had the option to read after dark. Before A/C, everyone in the south mostly just stopped working in the afternoon because it was too hot. After A/C, you could stop working, but that was a choice. Some people took the break, others kept working. I bet I know who found more long-term success.\n\nBut the good news is that willpower is indeed like a muscle. It can be trained; SEAL’s prove that. And like the SEAL’s making their bed, creating good habits can spill over to many other aspects of your life. The magic is that once you form good habits, they no longer require the use of willpower, and you’re free to use it elsewhere. Our best defense against the modern assault on willpower — and our best use of modern technology — is to form habits for the things we know are truly important.\n\nInterestingly, one of the god father’s of our modern technology, Steve Jobs, once spoke to the power of habits when he referenced an old hindu proverb in an interview from the 80's. “For the first 30 years of your life, you make your habits. For the last 30 years”, he said, “your habits make you.”"
    },
    {
        "url": "https://byrslf.co/how-to-slow-down-time-38cdcd2a8034?source=user_profile---------3----------------",
        "title": "How To Slow Down Time –",
        "text": "A french chronobiologist (he studies time and living things) named Michael Siffre once conducted a hell of a self experiment. He spent two months in a cave alone. No clock, calendar, or sun light. He did have artificial lights, food, and a journal though. His experiment is covered in the excellent book ‘Moonwalking With Einstein’. It makes some pertinent points more eloquently than I could, so I will quote it at length right now.\n\nI remember the first time I read that passage. I sat on my couch and soaked in the implications. I had visions for how it might change my daily life. Over the months, however, the ideas from that passage became — as ideas are wont to do — rather intellectual. But recently I had an experience that brought them to life again. I understood them personally and viscerally.\n\nFor 13 weeks, I averaged 12 hours each day focused on one goal. Specifically, it was spent learning software, but it could have been anything. Painting, accounting, writing; any deep pool of knowledge would do. What I learned is that the passage of time isn’t constant. In fact, it’s under your control. You just have to pull the right levers.\n\nThere’s a lay theory that as you get older, time seems to speed up because each passing year is a smaller and smaller percentage of your life. That the year from 9 to 10 represents 10% of your life, but the one from 33 to 34 is only about 3% of your life. It’s intuitively appealing because it explains the universal feeling in a way that puts no fault on ourselves. It’s just math, nothing I could have done to stop that inevitable speed-up of time. But I don’t buy it anymore.\n\nYour sense of time is actually answered by a simple question: how much are you learning? Each thing you learn is another ‘hook’ you give to your memory, and each hook is another time marker. When you have a lot of markers, time feels slow. When you have few, life starts to feel a lot like driving down the open, straight roads of the midwest. Hundreds of miles will fly by because you don’t have to do anything except keep your foot on the gas. The sad part is you still feel like you’re going somewhere.\n\nWhile I was at Hack Reactor (an intense programming school), I was learning a metric ton each day. I felt so disconnected from other responsibilities that it felt like a different world. We had a 3-week personal project period where I was given (basically) free reign to build anything I wanted. I built a tool that visualizes, in 3D, a two-handed piano performance of any song, given a MIDI file. It required some complex algorithms, and new technologies I hadn’t used before. I was working on it so much that my brain had no choice but to show it in my dreams each night for 3 weeks. I also learned more in those three weeks than about any other time in my life.\n\nAnd here’s the paradox: while in these periods of ‘flow’, time moves fast. The hours cruise by, and your 14 hour day of work feels like a pittance. And yet, I look back for even a second, and it feels very slow. I have so many memories and associations for those 3 weeks that it feels more like 3 months. And that was the pattern at Hack Reactor. In fact, after a few weeks, we were so deep and disconnected that fellow Hack Reactants and I would joke that we had no lives before HR; and ‘this is all that has ever been.’\n\nWhich is funny, because there’s the old adage about cherishing time, “The days are long, but the years are short”, but, actually, it seems when you do things right, it’s the opposite: “the days are short, but the years are long”.\n\nThis theory also explains the child/adult time gap phenomenon. As kids, we all learned a lot each day. New words, new skills, new social rules. As you become an adult and leave school, that slows down. Certainly we learn, but less so than before, so time flows faster.\n\nSo how do you slow down time? A cliché would be dangerously easy here. ‘Live life to its fullest’ or some garbage like that. But dig in a bit, and it goes deeper than that. Your perception of life is built exclusively from your memories, which are in turn built from surprising experiences. I purposely didn’t say ‘novel’, because hell, your commute to work each day is technically novel, since I guarantee you don’t see exactly the same people on the way, or hear exactly the same broadcast, etc. But surprising captures the reality better. You must have experiences where you aren’t totally sure what the results of your actions might be. Where maybe, you’re even a bit uncomfortable. Such experiences often happen when learning a new skill, or traveling, but they can happen everyday in the strangest of times if you go after them.\n\nFor instance, there’s a bakery just around the corner from my house. I’ve always heard that bakeries tend to just give stuff away at the end of the day, because they’re gonna throw it out anyway. I didn’t know for sure though, partly because I never go to bakeries, but also because I’m shy about asking for things that shouldn’t obviously be mine. But I was walking home late at night the other day, and I saw the bakery owners closing up shop. The lights were on, but the door was locked. I thought, hell, why not try this out? I knocked and pointed at the doughnuts. They were hesitant, but opened up, and asked in broken English, “What you want?” I asked for 2 chocolate doughnuts. They put in 3 and threw in 2 bear claws too for free. It was the most exhilarating doughnut purchase of my life. I finally learned the truth of this ‘free baked goods myth’. It was true, and I didn’t even have to ask. I did have to knock though.\n\nYa know, fruits and veggies are great, and I eat them every day so that I’ll stick around. But that night, I think the doughnuts lengthened my life more."
    }
]