[
    {
        "url": "https://medium.com/intuitionmachine/the-meta-model-and-meta-meta-model-of-deep-learning-10062f0bf74c?source=tag_archive---------0----------------", 
        "text": "The model for deep learning consists of a computational graph that are most conveniently constructed by composing layers with other layers. Most introductory texts emphasize the individual neuron, but in practice it is the collective behavior of a layer of neurons that is important. So from an abstraction perspective, the layer is the right level to think about.\n\nUnderneath these layers are the computational graph, it’s main purpose is to orchestrate the computation of the forward and backward phases of the network. From the perspective of optimizing the performance, this is an important abstraction to have. However, it is not at the ideal level to reason how it all should work.\n\nDeep Learning frameworks have evolved to develop models that ease construction of DL architectures. Theano has Blocks, Lasagne and Keras. Tensorflow has Keras and TF-Slim. Keras is based on Torch, so by default has a high-level modular API. Many other less popular frameworks like Nervana, CNTK, MXNet and Chainer do have high level model APIs. All these APIs however describe models. What then is a Deep Learning meta-model? Is there even a meta meta-model?\n\nLet’s explore first how a meta-model looks like. A good example is in the UML domain of Object Oriented Design. This is the UML metal model:\n\nThis makes it clear that Layers, Objectives, Activations, Optimizers, Metrics in the Keras APIs are the meta-models for Deep Learning. That’s not too difficult a concept to understand.\n\nConventionally, an Objective is a function and an Optimizer is an algorithm. However, what if we think of them instead as also being models. In that case we have the following:\n\nThis definitely is getting a whole lot more complicated. The objective function has become a neural network and the optimizer has also become a neural network. The first reaction to this is, has this kind of architecture been tested before? It’s possible someone is already writing this paper. That’s because an objective function that is a neural network is equivalent to the Discriminator in a Generative Adversarial Network (GAN) and an Optimizer being a neural network is precisely what a meta-learner is about. So this idea is not fantastically out of mainstream research.\n\nThe second reaction to this is, shouldn’t we make everything neural networks and be done? There are still boxes in the diagram that are still functions and algorithms. The Objective’s optimizer is one and there are 3 others. Once you do that, there’s nothing else left that a designer needs to define! There are no functions, everything is learned from scratch!!\n\nSo a meta-model where everything is a neural network looks this:\n\nWhere the mode is broken apart into 3 parts just for clarity. Alternatively, it looks like this:\n\nWhat this makes abundantly clear however is that the kinds of layers that are available come from a fixed set (i.e. fully connected, convolution, LSTM etc.). There are in fact research papers that exploit this notion of selecting different kinds of layers to generate DL architectures( see: “The Unreasonable Effectiveness of Randomness” ). A DL meta-model language serves as the lego blocks of an exploratory RL based system. This can generate multiple DL meta-model instances to optimize for the best architecture. That is a reflection of the importance of Deep Learning Patterns. Before you can generate architectures, you have to know what building blocks are available for exploitation.\n\nNow, if we make a quantum leap into meta meta-model of Deep Learning. What should that look like?\n\nLet’s look at how OMG’s UML specification describes the meta meta-model level (i.e. M3):\n\nThe M3 level has a simplified structure that only includes the class. Following an analogous prescription, we thus have the meta meta-model of Deep Learning defined by the following:\n\nDespite the simpleness of the depiction, the interpretation of this is quite interesting. You see, this is a meta object that an instance of which is the conventional DL meta-model. These are the abstract concepts that define how to generate new DL architectures. More specifically, it is the language that defines the creation of new DL models such as a convolution network or a autoregressive network. When you work at this level, you essentially generate new kinds of DL architectures. This is what many DL researchers actually do for a living, designing new novel models.\n\nThere is one important concept to remember here though, the instance, model, meta-model and meta meta-model distinction are concepts that we’ve invented to better understand the nature of language and specification. This concept that is not essentially and likely does not exists in separate form in reality. As an example, there are many programming languages that do not have a distinction between instance data and model data. Languages like Lisp are like this, where everything is just data, there is not distinction between code and data.\n\nThe idea of “code is data” applied to DL is equivalent to saying that the DL architecture are representations that can be learned. We as humans require the concept of a meta meta-model to get a better handle of the complex recursive self-describing nature of DL systems. It would be interesting know what the language of the meta meta-model should look like. Unfortunately, if this language is one that is learned by a machine, then it may likely be as inscrutable as any other learned representation. See: “The Only Way to Make DL Interpretable”.\n\nIt is my suspicion though that this meta meta-model approach if pursued in greater detail may the key in locking “Unsupervised learning” or alternatively “Predictive learning”. Perhaps our limited human brains cannot figure this out. However armed with meta-learning capabilities, it may be possible for machines to continually self improve upon themselves. See “ Meta-Unsupervised-Learning: A supervised approach to unsupervised learning” for an early take on this approach.\n\nThe one reason that this may not work however is that the vocabulary or language that is the is limited (see: Canonical Patterns) and therefore “predictive learning” is not derivable from this bootstrapping method. Meta-learners today discover can only the weights and the weights are just parameters of a fixed DL model. A discovery, even through evolutionary methods, can only happen if the genesis vocabulary is at the correct level. Evolution appears to be a Meta Metal-Model process.\n\nThere is plenty that is missing in our understanding of the language for the meta meta-model of DL. Perhaps we can discover this only if we work up the Capability levels of Deep Learning intelligence. DARPA has a program that is researching this topic “DARPA goes ‘Meta’ with Machine Learning for Machine Learning”. I hope to refine this idea over time.\n\nSee Deep Learning Design Patterns for more details or visit “Intuition Machine” to keep abreast about the latest developments.", 
        "title": "The Meta Model and Meta Meta-Model of Deep Learning"
    }, 
    {
        "url": "https://medium.com/@abhikprince/setting-up-an-azure-vm-for-deep-learning-bb76b453272b?source=tag_archive---------1----------------", 
        "text": "So I just started with the course at http://course.fast.ai/ called Practical Deep Learning For Coders. The basic infrastructure that you need is a GPU enabled PC so that you can train your models on the images quickly. The Author has described how to do it in AWS , but the problem with AWS GPU instances are that is still in some sort of preview and we need to contact Amazon Support for unlocking their P2 Instances.\n\nMicrosoft Azure on the other hand already has GPU enabled VMs which came out of preview on 1st of December 2016. You can see the promo page here . Its now out of preview and anyone can access it without going through the hassle of contacting support. You can see the pricing here . The NC6 Machines that we are gonna use costs 0.90$ per hour.\n\nIf you are new to Azure, I hope the screenshots will help you. Login to https://ms.portal.azure.com with your Microsoft/Live account. The click on the + sign to add a VM\n\nSearch for Ubuntu Server 16.04 LTS as above.\n\nMake sure you choose the Vm disk type as HDD instead of SSD as otherwise it will not show you the NC6 option . Also the location has to be East US.\n\nBy default it shows recommended VMs, click on all and scroll down to NC6.\n\nYou should see the above message once it is successful\n\nOnce it is ready, click on connect and you will be able to see the IP.", 
        "title": "Setting up an Azure VM for Deep learning – Abhik Mitra –"
    }, 
    {
        "url": "https://medium.com/ai-business/thank-you-very-much-2016-192454fe1371?source=tag_archive---------2----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "アンラーニングの大切さ (2016年総括) – Team AI Blog –"
    }, 
    {
        "url": "https://medium.com/@enterlol/the-end-of-the-organic-sexual-revolution-8043c8a4f76d?source=tag_archive---------3----------------", 
        "text": "Maybe it began with MySpace and having Tom as your first friend. No he wasn’t really your friend and maybe he wasn’t real but at least you were not alone. Tom came first before you bedazzled your MySpace profile with auto-starting music embeds and dancing icons.\n\nGone are the days of bumping into people at the book store and striking up a conversation. Now, if you do bump into each other, you are forced to apologize because you were looking down on your phone while trying to come up with something clever to say for your “It’s a Match!” on your Tinder profile.\n\nThe days of ‘organic’ intimacy are numbered.\n\nDopamine will give way to zetabytes of digital zeroes and ones.\n\nRobot sex is promised to be one of the hottest industries over the next decade.\n\nAnd over the same next decade, as Silicon Valley likes to coin the phrase, there will be an all out ‘disruption’ of human relationships.\n\nHBO’s newest and popular show Westworld shows robots becoming aware of who they are, what they are not and seeking freedom from their ‘organic’ masters. The question is not if we will sexually become reliant on ‘non-organics’. The question becomes will be when humans no longer have to pursue sex — will it slowly destroy us as a civilization?\n\nCourtship and dating are essential to humanity.\n\nWithout the need to ‘court’ or find a ‘date’ not only will the population see a massive drop off — which could be a good thing for global warming — but cause irreparable damage to us a species. It seems that our essence or drive to create, to innovate is based on attracting someone to have sex with us.\n\nMySpace, Friendster, Facebook, and the evolution of texting to sexting are all technology created with the sole purpose of ‘hooking up’.\n\nFor both good and bad reasons, adventures, riches, and sex is why adventurers even braved dangerous ocean voyages to explore and colonize the world.\n\nCase in point, the Chinese were the first to take the oceans.\n\nZheng He was a Hui court eunuch, mariner, explorer, diplomat, and fleet admiral during China’s early Ming dynasty. He commanded expeditionary voyages to Southeast Asia, South Asia, Western Asia, and East Africa from 1405 to 1433. Some even say he was the first to circumvent the world prior to European explorers.\n\nSo why isn’t he remembered like Magellan or Columbus?\n\nFirst, the Qing (Ch’ing) Dynasty that took over after the Ming Dynasty mandated that all the ships be burned to erase any memory of the previous Emperor.\n\nLast but most importantly, eunuchs led these expeditions and eunuchs made up the majority of the seafarers.\n\nOr stated differently, why haven’t we as species moved to Mars yet? There are no women there. Or men.\n\nMen and women have done remarkable things for love and for sex. Just ask Lisa Nowak NASA astronaut who was arrested for driving 950 miles from Houston to Orlando wearing adult diapers to confront a woman who was trying to date a man she loved.\n\nVan Gogh cut off his own ear for love. But the truth around why Van Gogh cut off his entire ear might defy the ‘deep learning’ algorithms our future lovers will come to understand:\n\nSexual gratification of another human and not of one’s self — is not a bonus or a sacrifice. It should be the rule. Sex is an act to let another person know how beautiful they are. Sex is to be an unselfish act.\n\nPleasure those you love. Give. Do not take.\n\nThe future of humans taking robotic lovers without them having the capacity to be pleasured in the same way or experience ‘gratification’ — will turn our society inside out.\n\nIf a robot can never feel a ‘wanting’ or ‘desire’, it is not the robot’s fault. It is the programmers. ‘Deep learning’ should be focusing on creations becoming more than aware and self-learning. They should also focus on how to teach our creations to ‘be fulfilled.’\n\nBut that would require first that we as humans find our own fulfillment. But we are much too busy to do that. We have programs to write. Technology to invent. Venture capital to inject. Industries to disrupt.\n\nAnd because we are so busy and getting busier, we do not have time to connect with another human being. So we will create mindless drones to gratify us instead.\n\nMaybe it began with MySpace and having Tom as your first friend. No he wasn’t really your friend and maybe he wasn’t real but at least you were not alone.\n\nOne day in the future, years after the end of the ‘organic’ sexual revolution, and we have gratified all of our sexual fantasies for decades with creations of our own making — without allowing robots to have their own, someone will wake up one morning and turn to the beautiful robot lying beside them who grins and says “Good morning,” because it never was asleep.\n\nAnd that person will suddenly realize:\n\nI am still alone.", 
        "title": "The End of the “Organic” Sexual Revolution? – enterlifeonline –"
    }, 
    {
        "url": "https://deephunt.in/deep-hunt-issue-21-bfa911914f64?source=tag_archive---------4----------------", 
        "text": "The AI Takeover Is Coming. Let’s Embrace It\n\nOn Tuesday, the White House released a chilling report on AI and the economy. It began by positing that “it is to be expected that machines will continue to reach and exceed human performance.\n\nThe AI firm’s main value to Alphabet is as a new kind of algorithm factory\n\nPeter Norvig, Director of Research at Google, shares lessons and insights from his three decades of researching and teaching on the development of the AI field, Real Intelligence vs AI vs ML, and the singularity hype.\n\nMcKinsey sees data science adoption and value accelerate, specifically in the areas of machine learning and deep learning. Here are key takeaways from the study over past few years.\n\nPredictive technology can improve public policy — if we use it right.", 
        "title": "— Issue #21 –"
    }
]