[
    {
        "url": "https://medium.com/@lawrencelundy/apple-and-artificial-intelligence-the-odd-couple-381e5cb33348?source=tag_archive---------0----------------", 
        "text": "Apple is doomed. I said it. Sell your stock now, get out while you can.\n\nWell, that isn’t quite true, but I do think that as we move into the next computing paradigm, the Cognitive Era, Apple’s business model and culture will need to change. The Cognitive Era describes the next phase in technology development in which the world around us The future success of Apple will not be determined by the iPhone, iPad, Watch, or even a car. For Apple to continue its dominance of the technology market and expand into healthcare, transportation, and fashion, it needs to move away from being a computer company. This may sound like a ridiculous statement considering Apple’s position at the moment. But as the Internet of Things gathers pace with every device connecting to the Internet, the value is in making these devices do smart things. Similar to electricity today, computing power will be on tap whenever and wherever we need it. The next computing paradigm, the Cognitive Era, with ubiquitous and invisible computing power poses an existential threat to Apple.\n\nApple is a company that makes money from people who are happy to pay extra for a computer (phone, tablet, or watch). The long-term danger to Apple’s business is that AI solves problems such as natural language understanding, computer vision, and behaviour prediction.\n\nRight now, Siri, Google Now, and Cortana are similar enough that the user might be unable to tell the difference in quality. Continued progress in combining deep learning with other machine learning techniques such as genetic algorithms and bayesian inference, together with data network effects, means the quality of applications will begin to diverge. Smartphones, wearables, and cars will be bought based on what they can do rather than how they look. Sure, design will always matter and there will always be a high end of the market, it’s just this will matter less for the products Apple sells. Apple needs to become an AI company.\n\nApple’s only true competitor in the smartphone space is Google, and at its core, Google is an AI company. Google’s guiding strategy is to do whatever is necessary to collect data to feed into its AI engine. Google Fiber, Loon, and Chrome are all products designed to get more people using the Internet and to leave behind more data. Nest, Waze, and Dropcam are services that generate vast amounts of data. Moreover, Google has the best AI experts on the payroll. Geoffrey Hinton and his team are pioneers of deep learning and have invented many of the most widely used tools. DeepMind, a 2014 acquisition, was recently on the cover of Nature magazine and is leading the progress in general AI. When it comes to data and talent, Google is miles ahead of Apple.\n\nIn the last 6 months, Apple has attempted to address the AI threat by acquiring 3 leading machine learning companies: VocalIQ, Emotient, and Perceptio. VocalIQ is a UK-based machine learning company that builds voice user interfaces. Perceptio is a US-based deep learning company focusing on developing smartphone-based computer vision solutions. Perceptio’s solution is unique in that unlike most computer vision products, it allows smartphones to identify images independently without requiring access to cloud-based data libraries. The most recent acquisition was Emotient which is attempting to automate facial recognition and analysis. Their vision is to build emotionally aware technologies.\n\nThe technology behind VocalIQ will be useful for the Siri and the Apple TV teams. Emotient and Perceptio will help bring local intelligence to FaceTime, photos, and Apple TV. The local angle is important firstly because Apple’s core business is in devices not cloud like Google. The more processing that can be done on the device the better for Apple. Regardless of how the acquisitions will fit existing products, the fact that 3 AI companies with deep learning expertise have been acquired in such a short space of time shows Apple’s commitment to bolster its AI capabilities.\n\nWhat made Apple so successful in the mobile era was its fully integrated approach to building computers. By vertically integrating the supply chain and building the hardware and software, Apple has offered an unparalleled user experience that enabled the company to maintain premium prices and high margins in an exceptionally competitive market. This vertical integration required tight control across the value chain to ensure the products and user experience were market leading. This focus on providing the best user experience created a relatively closed and secretive company culture.\n\nThis culture means Apple has not embraced the open-source community in the same way as Google, Facebook, and other leading AI companies. For example, the 2015 Neural Information Processing Systems (NIPS) conference was the largest annual gathering of deep learning experts. In addition to Google and Facebook, Baidu and Microsoft were present; however, Apple was not. Over the last year, as detailed in The Only Thing That Matters in Machine Learning is Data, Google, Microsoft, IBM, and Facebook have released their machine learning frameworks for free to the open-source community because in the machine learning field, only data and developers matter. This strategy collects more data and obtains more developers and PhDs using their tools to make it easier to recruit them in the future.\n\nApple has yet to publish a research paper on AI, despite using the technology and that Siri is a leading natural language processor. The secrecy runs counter to the prevailing approach within the AI and, specifically, the deep learning community. The small talent pool is attracted to the open approach of Google and Facebook and even the new venture OpenAI that plans to release all research to the community. In fact, the speed of progress in the field is due in large part to the collaborative approach of researchers who have worked together in small laboratories and have taken their academic approach to the companies who hired them. Apple’s secrecy and closed approach directly impacts its ability to attract the best deep learning talent.", 
        "title": "Apple and Artificial Intelligence: The Odd Couple – Lawrence Lundy-Bryan –"
    }, 
    {
        "url": "https://humanizing.tech/your-brain-s-algorithm-for-learning-anything-99159fe3b30e?source=tag_archive---------1----------------", 
        "text": "In the tech community, artificial intelligence and machine/deep learning is all the rage. It’s coming to the forefront with ask anything apps like Facebook M and self-driving cars like Tesla’s Model S, even with app development like Gigster.\n\nAnd there are really 3 pieces to any successful application:\n\nAnd so how do you take these concepts from the most cutting edge data science, software development, and applications for the 21st century, and apply them to your everyday life?\n\nFirst you have to realize that these concepts weren’t just pulled out of thin air, but rather they were thought experiments that began by diseccting the human brain and connectome.\n\nAnd second, you need each of the same three things to learn something and become the best in the world at it:\n\nBut here’s the wild part. If you really want to learn something, and become really good at it, you need to keep feeding your brain very specific kinds of data. I just realized this morning that I had been doing this for years. I parse through about 600-ish blog posts every day. I read hundreds of emails every day. I read scientific papers, news stories, modern thinking, physics. I give my brain a lot of product, tech, software, design, and business related data every day. But I also give it lots of movies and real-world experiences and interactions with people all over the world, in order to keep rewiring my neural network algorithm so new, different kinds of data leads to new and different kinds of output.\n\nAnd what happens when you get different kind of output?\n\nYou connect two previously unconnected things, because something in the diving community spurred an insight in a software development or business model approach. And that one insight that came from 10 years of feeding your brain data and experiences is more valuable than anything that came before it.\n\nAll you need to do is keep reading, experiencing, and trying to connect different things together in novel ways and eventually you will create a valuable insight.\n\nOf course, that’s the easy part. The hard part then becomes communicating that insight in a compelling way to the rest of the world.\n\nLike AirBnB to sell your couch space for the evening, most people will think you’re insane, silly, or are off your rocker because nobody has ever thought of that before. And then you can choose to give up. Or you can choose to fight, compel and as Steve says, “push the human race forward”.\n\nSo there’s your monday wisdom. Eat, sleep, read, interact, and above all, use it to think and connect. Then talk to people about it.\n\nYou might be surprised what you manifest.", 
        "title": "Your Brain’s Algorithm for Learning Anything –"
    }
]