[
    {
        "url": "https://chatbotnewsdaily.com/are-wechat-chat-bots-any-good-fb52d7fcad2a?source=tag_archive---------0----------------", 
        "text": "Chatbots are the new hype. Every other startup is trying to find something related to chatbots and shove it inside their business plan in hope to get funding.\n\nWell, what’s really in it? What makes a shitty bot? And what makes a good one?\n\nFacebook Messenger has been making a lot of fuss over its bots integration. Let’s have a look at a few “famous” Facebook Messenger bots.\n\nSure is an equivalent of the “Food and drinks” capabilities of Siri. You can ask it about restaurants and bars in your surroundings.\n\nThe messenger bot of 1–800-flowers bot enables you to order flowers… through a very lengthy and unintuitive process.\n\nPoncho the weathercat… tells you the weather\n\nWeather bots might be the most classic form of chat bots. The input and output are very standardized, so it’s easy for the bot to understand the question and provide a correct answer.\n\nThe new rule of the Internet: for any list of things on the Internet, there is a Pokemon version of it. And there is, of course, a Pokemon messenger bot enabling you to locate Pokemons and know how to defeat them.\n\nOther types of bots are utterly useless but are just here to showcase the possibilities behind A.I. That’s the case for WTFIT (standing for: “What the fuck is that?”), which can recognize objects if you send it a picture.\n\nWhen we think of chat bots, we usually think of them as we think of humans. We expect them to be able to carry a “normal” conversation (what we call “general intelligence), and we think of their “brains” like we think of ours. A network of neurons is enabling them to make decisions and give intelligent answers.\n\nWell, that’s not at all how bots work.\n\nMost bots, including most Facebook Messenger bots, look much more like this:\n\nThat is, most bots today work through decision trees. They will use more advanced forms of artificial intelligence (deep learning / neural networks) to study the messages sent by a user. But at the end of the day, you can only tell the bot which patterns to recognize, and which answer to give for a particular pattern. The bot isn’t going to get “creative” at any point.\n\nThis way of functioning has substantial implications: it means a bot can only operate in a very narrow context where you took the time to pre-define the right answers to specific, expected questions.\n\nThe architecture above means that bots have significant limitations. They can’t be carelessly thrown around to replace any existing User Interface.\n\nSo, when are bots a good UI choice?\n\nAs we mentioned earlier, bots are working through decision trees, and their answers must be to a large extent pre-defined. You can’t expect a bot, as of today, to have “general intelligence” and hold an elaborate conversation. So you must set a clearly defined scope of expertise for your bot (the weather, restaurant listings in certain cities, etc.)\n\nBots don’t make sense if the diversity of inputs is very limited. Let’s say I want to top-up my phone: would it make sense to do so via a bot? Not really, as there is only one input here: the top-up amount. A simple click is enough, no need to get into a long conversation which could create more problems than it will solve.\n\nHowever, if I am trying to find a restaurant, there might be a lot of parameters involved. I might be looking for a vegetarian restaurant in Beijing, which isn’t too expensive and open after 9 pm. Natural language processing (the ability of bots to understand what we say and turn it into machine-readable information) can be a great way for a bot to give me a quick answer.\n\nAnother asset of bots is their evolving nature. Every day, you can review the requests from customers and enhance the answers to make them more exhaustive. If your client is merely trying to order flowers or pizza, a bot might not add a lot of value. But if you are talking about customer service, having an open chat window might help a lot: customers are not constrained by the user interface you set for them.\n\nFor simple questions, the bot might be able to answer. If it can’t, a customer service representative will take over. And over time, the bot will get smarter and smarter and learn to handle more sophisticated requests by itself.\n\nChina already saw a few successful chatbots implementations. Major Chinese tech companies are also building tools to support a “chatbot revolution”.\n\nA great illustration of the above principles is the Alibaba chatbot. Like Facebook bots, it is using a combination of “free input” from users and multiple choice answers. If the bot is unsure about what you just said, it might offer you several options to pick from.\n\nBy taking this hybrid approach, the Alibaba bot can both provide a value added service, while keeping a flexible and evolving approach to customer service.\n\nWe covered in a previous article the company Chumen Wenwen. The startup, created by former Google engineers and backed by the prestigious VC firm Sequoia Capital, developed its proprietary voice recognition software for Chinese and integrated it to both a WeChat account and its native APP.\n\nThe APP works like a Chinese equivalent on Siri, and the company is now releasing wearables integrating their voice recognition software.\n\nWhat are BAT (Baidu, Alibaba, Tencent) doing about Chatbots?\n\nWe already talked about Alibaba and its popular chat bot.\n\nThe rest of BAT (Baidu and Tencent) are not forgetting about chatbots and their potential. Both of the companies provide services for “Natural language processing” enabling to create your own bots (because if the workflow of the bot itself might be a simple decision tree, being able to correctly process human-written text is a complex A.I problem. That’s where Baidu and Tencent can help).\n\nThe Tencent platform (http://nlp.qq.com/) offers interesting examples, including sentiment analysis on any Chinese text you enter in their demo box, and even being able to understand the main topics brought up in a short paragraph (try it here) .\n\nThese tools make it easy for developers to create their own bots, even with a very limited initial knowledge of bots and artificial intelligence.\n\nChat bots are by no mean a silver bullet which will replace all existing UI. However, as they get more sophisticated, there are more and more use-cases for them, and customer service is one of them.\n\nWith big companies like Facebook and Tencent stepping up to provide API’s, and leveraging on the large amount they collect, it is now possible for developers to build useful bots creating value for customers and for their organizations.", 
        "title": "Are WeChat chat bots any good? –"
    }
]