[
    {
        "url": "https://medium.com/@sanparithmarukatat/%E0%B9%80%E0%B8%AD%E0%B8%B2-feature-%E0%B8%88%E0%B8%B2%E0%B8%81-caffe-%E0%B8%A1%E0%B8%B2%E0%B9%80%E0%B8%A5%E0%B9%88%E0%B8%99-9a1ccff7a543?source=tag_archive---------0----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "เอา feature จาก Caffe มาเล่น – Sanparith Marukatat –"
    }, 
    {
        "url": "https://medium.com/planet-stories/from-the-firehose-the-power-of-time-2ca3400802db?source=tag_archive---------1----------------", 
        "text": "From the birds-eye viewpoint of a Planet Labs’ satellite, Verchères can seem tranquil. Over a 5-day span, little seems to change—same river, same fields, same streets.\n\nThe village of Verchères lies on the St. Lawrence River in the Canadian Province of Québec. Away from the river it is surrounded by fields that grow everything from feed for animals (cattle, pigs, and chickens) to wine grapes and cider apples. About 22 miles (35 kilometers) from the center of Montréal, it’s isolated from the daily hustle and bustle of the city.\n\nBut if you look closer—both in time and in space—you realize there is change, and it is constant. Look at the fields in the pictures below. From April 21 to April 23 the fields got a shade darker—possibly the result of the quarter inch of rain that fell on April 22.\n\nOn the 24th and following days, a handful of fields change from light to dark, evidence of farmers tilling their land in preparation for spring planting. (The long, thin fields are a relic of French colonialism. The French king granted land to local lords, who in turn allowed tenants to work the land on parcels that began along the riverbanks. It’s one of many examples of how human history shapes agricultural landscapes.)\n\nZoom in again, and details emerge on a more human scale. Shipping containers and vehicles are re-arranged in an industrial park. You can even spot changes in the water circulating in the open ponds of a sewage treatment plant—perhaps caused by shifting winds.\n\nPlanet Labs’ operational constellation will view the Earth at about 50 times the spatial resolution of MODIS (NASA’s twin Moderate Resolution Imaging Spectroradiometer instruments). This dataset will fill in the gaps between very high resolution satellites with targeted observations, and low-resolution systems designed to observe weather and climate.\n\nA global, daily picture of the Earth is a radical new dataset that’s ripe for analysis. It’s a time machine that lets you examine any spot on the planet, whether it be a big city center, the Amazon Rainforest, or a small village like Verchères.\n\nSee how organizations all over the world can use timely satellite data.", 
        "title": "From the Firehose: The Power of Time – Planet Stories –"
    }
]