[
    {
        "url": "https://medium.com/udacity/this-week-in-machine-learning-8-july-2016-83a911dcac19?source=tag_archive---------0----------------", 
        "text": "This week’s top Machine Learning stories, including predicting blindness, growing food, brewing beer, and more!\n\nMachine Learning is one of the most exciting fields in the world. Every week we discover something new, something amazing, something revolutionary. It’s incredible, but it can also be overwhelming. That’s why we created This Week in Machine Learning! Each week we publish a curated list of Machine Learning stories as a resource to help you keep pace with all these exciting developments. New posts will be published here first, and previous posts are archived on the Udacity blog.\n\nWhether you’re currently enrolled in our Machine Learning Nanodegree program, already working in the field, or just pursuing a burgeoning interest in the subject, there will always be something here to inspire you!\n\nGeographical analytics firm OmniEarth uses IBM’s Watson to analyze aerial photos to evaluate how efficiently California farmers and residents are using water.\n\nDallas-based startup Flux Farm uses machine learning and pervasive computing to allow novice farmers to grow food for themselves or local communities.\n\nGoogle’s DeepMind partners with the UK’s National Health Service to use its deep learning system to analyze millions of eye scans to identify early predictors of blindness.\n\nThe Center for Sensorimotor Neural Engineering works to build a human-computer interface that works directly with the user’s central nervous system.\n\nGoogle further enhances its portfolio of visual recognition technologies by acquiring Paris-based Moodstocks, which has previously specialized in on-device image recognition.\n\nLondon-based IntelligentX uses artificial intelligence and reinforcement learning to create new beer recipes based on interactions with consumers via Facebook chat bots.", 
        "title": "This Week in Machine Learning, 8 July 2016 – Udacity Inc –"
    }, 
    {
        "url": "https://medium.com/@kimsvandenberg/working-visually-record-reflect-reframe-38b58df08622?source=tag_archive---------1----------------", 
        "text": "Working visually is a quickly expanding field. In the past 7 years the I moved from organizational development to visual consulting. Working with other change experts in organizations on visual interventions and drawing to support learning and change. I noticed that I people who did not see me work easily labeled me as a graphic designer, illustrator or graphic recorder, the biggest and most well known professions in the visual workfield in organisations.\n\nEvery time I had to explain that my visual approach was a different one. To get an overview of the different approaches and to position my contribution to the field I mapped it out. I address three levels of using visualization and drawing to support communication and learning. I share it here, because I enjoy sharing approaches, experiences and ideas with others on how drawing can support learning. Let’s start with the visual and I explain it underneath.\n\nBefore I get into the three levels I make a distinction between a focus on the product or the process. Many business questions are focused on the product — a visualization of complex data or business strategy to get across the message in a more effective way. When the focus is on the process, visual products or drawing itself is used to make the meetings more effective.\n\nLets look at the three levels of working visually and what they encompass for each area of focus. The first level is to record. Recording means registering and synthesizing data and information and translating this into a visual product, like data visualizations, visual stories and movies (e.g. the increasingly popular animations). In the process field we see the area of graphic recording where people draw live during meetings.\n\nThe second level is to reflect — this is when the visual product is not seen as the end result, but as a platform to reflect on an idea or plan and develop it further. For instance a sketch or design that you develop further with the people involved. When you use visual templates you already move towards the process focus, where participants play an active role in the visualization. Using templates, post-its and maybe sketch notes to visualize their contributions during the meeting and think and reflect together.\n\nThe third level is to reframe — to truly step out of the known way of looking at the situation and move to another perspective. Dave Gray uses the term Liminal Thinking for this area of learning (see also the book he recently published on the subject). Exploring this area in a visual way can be done by drawing different or disrupting perspectives or by asking people to draw these images themselves. Here drawing is used to support deeper learning and move to different ways of thinking and looking.\n\nReframing by drawing and visual interventions to support learning is less developed than the graphic recording and facilitation field. It is a fruitful and promising field, since drawing and visualization open up the visual potential of the brain and at the same time contain negative emotions that may arise in learning situations.\n\nMaybe I left out some important areas, products or processes. If you have additions or suggestions on this overview I would love to hear them.\n\nThere is still a lot to explore and discover in the field of drawing to support dialogue and learning. If you like to share experiences and ideas, you can find me via www.visualsinprogress.com. There you can also find a printable pdf of the image above and other material and videos I produced on drawing to support learning.", 
        "title": "Working visually: Record, Reflect, Reframe – Kim S van den Berg –"
    }, 
    {
        "url": "https://humanizing.tech/slides-thoughts-from-the-playfair-ai-summit-in-london-cfbe0a3ad319?source=tag_archive---------2----------------", 
        "text": "Machine Learning is here to stay, and Data is all the matters\n\nLast Friday in London, about 350 people came together to discuss the state of machine learning and AI in startups. It’s run by Nathan Bench who also publishes a fairly regular email newsletter about the state of AI, which I recommend subscribing to.\n\nYou may not have heard of this conference because it’s the 2nd year, but I think it will start to get bigger over the years. It was sponsored by Bloomberg and while I wasn’t able to make the flight this year, one of my colleagues, Paul Mardling, was able to attend and he shared some thoughts:\n\nScariest concept of the day, one of the neuro-ML people claiming they’ve analysed the neural pathways involved in depression and want to run trials with a video that they claim is designed to train the neural pathways to remove the depression.\n\nHere’s a link to 9 slide decks that were discussed during the conference:\n\nIt sounds like they’ll also be releasing some video recordings in the coming weeks, which I’ll update this post with once they’re available.", 
        "title": "Slides & Thoughts from the Playfair AI Summit in London"
    }, 
    {
        "url": "https://medium.com/@simplex_ai/stable-growth-with-artificial-intelligence-a572d87503a0?source=tag_archive---------3----------------", 
        "text": "The bottleneck of many learning tasks is understanding the relations of many variables in the input and outputs. For example, understanding what object is in the a digital image requires learning relationships between pixel locations and values in an image or a predictive system needs to create a relational mapping between past events and their results from historic data. Such relationships are modeled with algorithms by researchers and statisticians over the years. Only recently, with the availability of many-core GPUs we started using concept of ‘deep learning’ and have artificial neurons form these relations.\n\nIn some areas, reaching human success rate of image classification tasks and Google’s AlphaGo system’s victory over human champion(what makes Go special is its large space of complexity, way more than chess) made the recent advances in machine learning top news of technology. Yet, there is still a large room to expand in A.I. field. Understanding the causes and knowledge transfer are just a few sub-topics require improvements.\n\nSo finally we have three upcoming challenges waiting for us: (1)Making A.I. more data efficient, (2) creating more accessible A.I. tools for everyone and (3) understanding the current limitations of the system.\n\nIn Simplex A.I. we try to overcome these challenges and providing three steps approach to any A.I. problem — sample, solve, improve.", 
        "title": "Stable Growth with Artificial Intelligence – Simplex A.I. –"
    }
]