[
    {
        "url": "https://medium.com/the-exponential-view/peak-car-hardware-eats-software-sexbots-what-killed-newspapers-maverick-goose-homing-54a0e26e8d59?source=tag_archive---------0----------------", 
        "text": "💡 Hardware is eating software. Mark Pesce on the important trend of customised silicon over generalised GPUs. EXCELLENT READ (See also this beautiful creation, a hand-built 42,300 transistor CPU, the size of a garage.)\n\n😎 A new record price for solar suggests the industry is learning even faster than we thought. HOORAY\n\n💥 Summary of a dozen+ more applications for deep learning, from melanoma detection to civil engineering to trading strategies. GOOD READ\n\n👷 How computers affect jobs. “Computer-using occupations have had greater job growth to date. Instead, it is the occupations that use few computers that appear to suffer computer-related job losses.” IMPORTANT: the low-skilled need retraining.\n\n💋 Will sexbots change the way we relate to each other for the worse? INTERESTING\n\n🎓 How might we use CRISPR to gene-hack our way to higher intelligence?\n\n🌟 The Rocky Mountain Institute publishes a report on “Peak Car”. I STRONGLY RECOMMEND reading the executive summary. Easy registration needed. Specifically, look at how close they see electric vehicles exceeded petrol and diesel vehicles on both price and performance — 2018 is their best bet. (There has bee an incredible surge in EV ownership in the US, although the numbers are low. We’ve seen Tesla come to dominate the luxury segment.)\n\nAnd equally, the likely impact of autonomisation on the price-performance of taxi usage vs var ownership. Once again, 2018 is the milestone year.\n\nThe conclusion is peak car ownership hitting the US by 2020, and ultimately declining to about a third of current levels by 2035.\n\n😀 We’re already seeing declines in the numbers of miles driven by car owners, off their 2005 peak, suggesting a generational shift in attitudes.\n\nWhen do we revoke humanity’s driving license? “It’s becoming obvious that paying attention to the road is the last thing humans actually want to do”, so why would a 16-year old want to go through this rite of passage? (See this older data on the decline of driving licenses in the US; across all cohorts; also Goldman data on similar directional trends in the UK.)\n\nThis great chart from Vox shows all the EVs currently available or soon-to-be-available in the US.\n\nWhat will we do with all the unwanted, polluting diesel and petrol cars in Europe and Japan? Dump ’em in Africa, of course.\n\n🎉 🎂 It is my birthday this week! The Exponential View community is approaching 12,000 members, growth of nearly 500% on last year.\n\nRecommendations are presents! Even on Twitter…\n\nGoogle’s SyntaxNet flags African-American English as “not English”. On the problem of AI biases.\n\nHow the brain decodes sentences by my college buddy Rajeev Raizada.\n\nEV reader, Murray Shanahan, co-authors a paper on ‘deep symbolic reinforcement learning’ which makes headway on interpretability of deep networks and things like transfer learning.\n\nCould ancient remedies help us combat antibiotic resistance?\n\nA brief reminder that Blueyard Capital and Exponential View are having a get together in Berlin on October 6th. The list is getting very, very full so please sign-up early.\n\nOne last birthday request: please add this email address to your contact list. It will help improve deliverability of the newsletter each week. Thanks!", 
        "title": "🎉🔮 Peak car; hardware eats software; sexbots; what killed newspapers; Maverick, Goose & homing…"
    }
]