[
    {
        "url": "https://medium.com/apprendimento-automatico/nella-mente-di-openai-2ecf13b4d844?source=tag_archive---------0----------------", 
        "text": "OpenAI è una società non-profit statunitense che opera nell’ambito dell’intelligenza artificiale (AI, artificial intelligence) e si impegna a rendere pubblici i risultati ottenuti e i suoi brevetti royalty-free. E’ un laboratorio di ricerca finanziato — si parla di un impegno di più di un miliardo di dollari diluito in un lungo periodo — da un nutrito gruppo di privati con l’obiettivo dichiarato di creare i presupposti per contrastare aziende di grandi dimensioni o governi che potrebbero trarre troppo vantaggio dal possedere sistemi super-intelligenti devoti al profitto e all’acquisizione di potere; non sbaglia chi riconosce in questa mission i timori di Elon Musk.\n\nIl research team lavora full-time sui progetti di OpenAI in un unico grande ufficio in San Francisco, dove si sta formando un vero e proprio ensemble di ingegneri e scienziati. Il laboratorio prende spunto da altre realtà simili (per diversi aspetti è ispirato a strutture come il vecchio Xerox PARC) e la libertà di ricerca che lo caratterizza lo configura come partner ideale per un’ampia collaborazione con il mondo accademico e le aziende private. Quello che lo rende davvero unico invece sono le risorse (finanziarie e di conoscenza) che nel tempo si concretizzeranno sempre più e le notevoli retribuzioni per i ricercatori, cifre da società high-tech.\n\nUn altro aspetto rilevante che differenzia OpenAI dagli altri laboratori è la presenza di un comitato etico, anche questo prenderà forma e una direzione precisa con il passare del tempo. Al momento l’impronta è stata (e viene) data da Elon Musk e Sam Altman. Come scritto nel post di presentazione, l’obiettivo principale è far progredire l’intelligenza digitale in un modo che si possano massimizzare i benefici per l’umanità nella sua interezza, tutto il resto rappresenta una serie di strategie e tattiche finalizzate al raggiungimento di questo ambizioso obiettivo.\n\nSempre riguardo a questo, un meta-obiettivo di cui OpenAI si prende carico riguarda il controllo dell’IA, il suo “contenimento” (citando un vecchio articolo di MIT Technology Review). Questo aspetto potrebbe essere rilevante in un futuro in cui i sistemi creati dall’uomo potranno iniziare ad avvicinarsi a livelli davvero alti — Ilya Sutskever usa il termine very capable AI. L’obiettivo è rappresentato dal diffondere la consapevolezza di questi problemi potenziali nella comunità dei ricercatori di machine learning (ML) e AI, comunità che negli ultimi anni ha dimostrato ritmi di crescita davvero incredibili.\n\nPer lo sviluppo inizialmente si useranno piattaforme software e infrastrutture create da altri ricercatori/ingegneri, nell’AMA si accenna a TensorFlow di Google come piattaforma primaria. In seguito, probabilmente, verranno creati nuovi tool per il learning di larga-scala e l’ottimizzazione (nel caso, anch’essi verranno resi pubblici). Riguardo alla questione dati, fondamentale nel ML, principalmente verranno usati dataset e benchmark pubblici (MNIST, CIFAR, ImageNet, Atari, ..) e — se necessario — si lavorerà alla creazione di nuovi.\n\nIn una risposta, Ilya Sutskever (Research Director di OpenAI) racconta di come si sia avvicinato alla ricerca sulle moderne reti neurali (e il deep learning) partendo da uno scetticismo riguardo ai programmi per computer che imparano dall’esperienza. Successivamente ha scoperto quanto fosse sorprendente l’algoritmo di backpropagation, una folgorazione. Tutto questo unito al fatto che stava studiando alla University of Toronto, dove il pioniere Geoffrey Hinton stava lavorando, lo ha portato a occuparsi accademicamente e professionalmente di quell’ambito.\n\nMa non considerate OpenAI una torre d’avorio popolata da superuomini. Come raccontava qualche settimana fa George Hotz nell’intervista su Bloomberg, il campo del ML (e, estendendo il pensiero, il suo stato dell’arte) è — paradossalmente — piuttosto accessibile (come afferma anche Greg Brockman, CTO di OpenAI, nell’AMA), specialmente grazie ai notevolissimi strumenti disponibili oggi. Non serve possedere un PhD oppure essere stati allievi di un luminare dell’ambito, per riuscire a comprendere i punti salienti dei paper più interessanti sul deep learning pubblicati negli ultimi mesi e ad applicarne i risultati. Invito tutti gli interessati a dare un’occhiata a Kaggle — per esempio — ad affrontare qualche problema/competizione (sì, ancora prima di approfondire più di tanto la letteratura) e a condividere l’esperienza.\n\nAnche grazie e iniziative di questo tipo — folli oppure no — sembra proprio che l’ultimo inverno dell’AI sia ormai alle spalle. Per farci un’idea dell’interesse che satellita attorno all’ambito, in una ricerca condotta da Venture Scanner il novempre scorso è emerso che su 897 Artificial Intelligence company in 66 paesi sono stati raccolti circa 4 miliardi di dollari in finanziamenti. E questo è solo l’inizio.", 
        "title": "Nella mente di OpenAI – Apprendimento Automatico –"
    }
]