[
    {
        "url": "https://medium.com/@dlmajor/heres-a-gift-for-kobo-readers-4ec14ac92ec6?source=user_profile---------1----------------",
        "title": "Here’s a gift for Kobo readers... – David Major –",
        "text": "My book of short stories, Air for Fire, is free at the Kobo store until the end of April:\n\nNine short stories, full of shameless historical revisionism, a chronic disregard for physics, all in orbit around a judgmental (and conservative) core. I guess that means that there’s something here for steampunks, mythpunks, clockpunks, and all lovers of history, true or otherwise.\n\nFeel free to download and read, and if you like it, reviews are always welcome.\n\nIf anyone would rather have the epub emailed to them, just email me at dm@adistantmirror.com.au, and I’ll send you a file."
    },
    {
        "url": "https://medium.com/lit-up/berthezene-c08d60a8d128?source=user_profile---------2----------------",
        "title": "Berthezene – Lit Up –",
        "text": "Under a tree on a hill, from the top of which is visible everything that is about to concern us, gather two shades, both recently departed from the world.\n\nOne is, or was, French, and is, or was, a Soldier of the Line, his uniform torn and dirty in a manner that leaves us little doubt as to the unenviable nature of his demise.\n\nHis companion — but wait, that word is suggestive of a friendship, so let us say his colleague — is a different affair. He is clearly not a peasant, or any other sort of villein. His dress identifies him as a Russian, and an officer, and — forgive the allusion — a gentleman, and used to enjoying a greater degree of comfort and civility than the Frenchman; nevertheless — and here is the proof that some things cannot be postponed and will wait for no man — he is just as dead as the other, just as incorporeal, and just as much a matter of spirit.\n\nBelow these two, stretched out on a plain of gold and green under the fading warmth of the autumn sun (a minor detail, the temperature, now of interest to neither of the two watchers), an army, a hundred and more thousand strong, streams out of a burning city.\n\n“Yes. They resisted the notion, but there was never a doubt, after the fires.”\n\n“Look how many there are! And do they not still bear themselves as much like the host of some new heaven as they did when they arrived?”\n\n“Hah! Oh, my Gallic friend, heaven indeed! If any of them still hold to that idea, it is most surely a delusion. They are fewer, by half at least, riven by disease and battle — though they are still many, and though their standards fly, and their officers yet ride horses; they are most certainly thinner, by rank and by substance. And it was only fifty days ago that you arrived here! And now, the winter comes for your countrymen…”\n\n“Ah, winter! Let it take care of itself. See how warm the scene looks, how golden that sun. But is it deliberately, my Russian friend, that you distract us from the state of your Capital? Even your adversary, my own dear Emperor, whose star led us here, pales at its condition…”\n\n“You have my measure there; I admit it, I grow sad at the sight. Look at what has become of her, my City, the population all fled, the palaces burning pyres, the avenues and streets desolate, left to the columns of smoke and flame that play quadrille between the houses. All empty, even now of the conqueror, who flees in the face of the fires set around him.”\n\n“He does, he leaves… with all his army, in such chaos and so badly drilled he departs, amazed that the Russian abandoned his capital so thoroughly, or at all! And no less amazed at the fires which roar behind him, denying him his prize…”\n\n“The prize will mean nothing soon, my friend, whether it be held or lost. The agents of the Tsar have denied the invader food and drink and shelter from the coming winter. In just days there will be cold such that your soft European hides cannot imagine. Your Spaniards, your French, your Prussians, your Italians, they may think they know what a brisk day is, and how to turn their collars up, but I swear, even as they expire, they will beg for death! And they have been warned so very well…”\n\n“Indeed they have. And there has been no shortage of Russians to belabour the point, just as you do now. And so, how shall we write it?”\n\nAnd one of the ghostly pair sits at a table of the finest Swedish hardwood, and takes up an exquisitely weighted silver pen, and readies the first of the sheets of vellum.\n\n“Shall we mention, perhaps, that the flames that consume Moscow are the same as those which melted the wings of Icarus, son of Daedalus?”\n\n“True perhaps, but too poetic for our audience and our purpose. I think we can take that as a given, just between us? Let us limit ourselves to the facts. Like this, perhaps…” and the shade of the Russian officer proceeds to inscribe:\n\n“Ranked and ordered, \n\nbearing high their flags and eagles, \n\nfour and eight abreast, \n\nweapons squared and horse held straight, \n\nfirst a thousand \n\nthen ten thousand \n\nthen a hundred thousand, \n\nforgetting \n\nthat they leave the city hungry, \n\nforgetting \n\nbecause there are so many of them, \n\nand the noise and clamour and din are so great, \n\nand the spectacle distracts them,\n\nand everything seems to be endless.\n\nThe Grande Armée fills the world! \n\nfrom one horizon to the other.\n\nThe Emperor proclaims to all\n\nthat his star is in the sky.”\n\n“Large talk, my friend, but let us let it pass. But look on their baggage train, and what they have filled it to bursting with! All the gold, all the silver, all the books and tapestries, all the fine clothing and paintings… all shall come to nothing.”\n\n“I fear that you may have something there; but then, as always in war, we shall see…”\n\n“So many dead or eloped already, and yet there are still so many left who do not think of what slopes so roughly toward them, just a few days hence. Look, see those fine carriages, carrying the foreign women, and their servants, their portmanteaux and hat boxes…”\n\n“It is so warm, the sky so clear and blue…”\n\n“So you said. Oh, the sky will stay clear for your companions, have no fear on that account; as clear as ice. Look, Saxons, Poles, Spaniards and Austrians… did you bring all of Europe with you?”\n\n“They gathered most easily. It was not hard.”\n\n“Quite so. How unfortunate that the land they thought to take was already possessed. And now they depart, and the only Russian soil that they can lay claim to will serve them as a grave. How shall we put this? We must introduce Berthezene, you know…”\n\n“And behind, left among the flames \n\nso outrageously and well set, \n\nwith his eight thousand Young Guard, \n\nall but two of which are past their prime use, \n\nand shamble where they should \n\nmost fearlessly and in order stand, \n\nBerthezene, one of the Corsican’s favoured sons, \n\nis charged with the guarding\n\nof the Grand Collective Rump\n\n— as the one hundred and forty thousand, \n\nand the fifty thousand horse of all description, \n\nand the six hundred pieces, \n\nwith powder and shot for each, \n\nand every bauble that the horde\n\ncould unscrew, tear up, decamp or lift\n\n— Oh the weight, and breadth, and height,\n\n and what a sight! —\n\nis made to file out of the gate and take the road — oh my, \n\neven ghosts as we might blanch at this — \n\nall the way back to Borodino.”\n\n“Fairly said, I have no issue. And now, look, at Napoleon’s command they will destroy anything of value that has not already been burnt by the Tsar’s own saboteurs."
    },
    {
        "url": "https://medium.com/@dlmajor/the-tower-db63f14e782b?source=user_profile---------3----------------",
        "title": "The Tower – David Major –",
        "text": "I have been told that we have been building this tower for thousands of years.\n\nI have no direct experience; no reason to believe this — nor to doubt it — but it is what I have heard, and I can see a little way into the waters that keep rising, lapping below our feet as we keep building, board after board, nail after nail.\n\nIn the depths, dissolving into the darkness that is the limit of our vision, the faint shapes of the bulwarks that my predecessors built in defiance of the water linger — but they failed; I can see also the remnants of the sealed chambers, broken, flooded and empty, the seals torn and perished. Nothing has worked; the waters still rise, taking everything out of reach; it all becomes illusion and memory.\n\nThe Enemy who lives in the water comes without warning; I think he never really departs, he just lurks out of sight, waiting. The Enemy is clever, I think; he changes his shape from one minute to the other, but his shadow is always the same.\n\nWe build upward — spar by spar, a piece of wall here, so that we know where one room stops and the next begins, a piece of ceiling there, which will become tomorrow’s floor; ever upward. Sometimes it is tiring, but sometimes, too, it is exhilarating. On those days we have so much hope, and it is good to build, and we are sure then that when everything is said and done, as one day it surely must be, the Tower, somehow, will love us for our work, or at least will approve of it, and our hope will be vindicated — and what is hope for, if not for vindication?\n\nI hear them being taken, sometimes, the others, while they are working in the next room, or a few rooms down a hallway, or across a square, or off a thoroughfare (for the Tower is very, very large…).\n\nSometimes, when the Enemy takes one of us, he is quiet about it; they do not struggle or shout; I suppose he must come looming up out of the darkness before they can do anything — or perhaps before they even know he is there, or upon them; he must lay his grasp around their hearts, and flood through them, and there is no mercy; and they are gone without a sound, as if they were never awake.\n\nBut I do not really know; I have never seen it. I have only heard about it.\n\nAnd then there are other times, when the Enemy comes roaring, as a great noise like a wind that wants to tear everything apart, and throw us over, our work and all, down into the water together, and to circle above us, whipping waves into knives that rend us into small pieces that no longer know each other. At those times, there can be a great panic that spreads, and everything is so huge, and those who the Enemy has taken into his cold embrace cry, and I have heard them begging, but the Enemy is implacable.\n\nSometimes he throws them around like dolls, breaking them, sending them down to their destruction, where we cannot see. But I do not really know; I have never seen it.\n\nSometimes, the Tower shakes, the Enemy is so strong.\n\nBut we keep building, although we never draw away from the water; it keeps rising with us, always just below our feet, rising as we build, but just beyond our reach; so that even if we lie down, in a place where we might be about to place a floorboard, or where we might have lifted one up; pulled the nails, and prised it away (although this is frowned upon, and is not regarded as contributing to the building of the Tower; so it is not often done, or at least admitted to) — though we might lie flat and extend our arms, straining as hard as we can, or relax them, until they are like the water itself, we cannot ever reach the water. No-one, to tell you the truth, even knows what it feels like; there are all sorts of stories about it.\n\nSome days, it seems as though the water is calm, and that the Enemy is far away, and has even forgotten us. Then it is easy to forget what he can do, and our hope rises and rises, and the sky seems bright and clear, and we imagine our Tower reaching into the sky forever, full of hope and made of wonder and strength and caught breath, and on those days we are sure, and we forget the Enemy, and we pour ourselves into our work, and we build as though we have an endless stream of tomorrows before us.\n\nSometimes, there are those who just sit, staring down into the water, watching it rise, waiting for it to reach them, or for the Enemy to rise up and take them. (The water never reaches them; it is always the Enemy; he comes for everyone in the end, as far as I can see.)\n\nBut I keep building. I think: if I can get this ceiling finished, and those windows into the wall so I can have a good view out over the water, and finish the stairs, it will be very comfortable, and I will be able to start building the next level up, and I might even gain on the water, and put some distance between myself and it… I have heard of it being done, but I have never seen it. I do not really know.\n\nThe Tower reaches far down into the darkness, but we feel that we know so much about it because of the stories that we tell each other — about its great victories and heartbreaking defeats, its trials and torments, its secret places and great halls, its passages and doorways through which beauty has paraded, and horror stalked, through which song and blood have flowed. So have I heard…\n\nI have also heard it said, by a man named Aeschylus, that long ages ago, each one of us knew when the Enemy would come for us. But we all stood waist deep in the water then, and we built nothing, and knew nothing of a life above the water.\n\nBut then the knowledge of the time when the Enemy would come was taken from us, and in return, we were given hope — hope that the Enemy might forget us; hope that if we work and build hard enough, we might rise above the water, out of the Enemy’s reach, away from the deathly chill of his grasp — and so today, there is always hope. We have traded knowledge for hope.\n\nThe Enemy came for a friend yesterday; he was one of the quiet ones, he went beneath the water quickly; it is almost as if the Enemy wants to be merciful about it sometimes.\n\nBut I do not really know; I have never seen it.\n\nAnd now, there is building to do. Because everywhere, there is water."
    },
    {
        "url": "https://medium.com/@dlmajor/mechanical-and-electrical-responses-in-living-matter-ce1e1fc0980?source=user_profile---------4----------------",
        "title": "Mechanical and Electrical Responses in Living Matter",
        "text": "Conditions for obtaining electric response — Method of injury — Current of injury — Injured end, cuproid: uninjured, zincoid — Current of response in nerve from more excited to less excited — Difficulties of present nomenclature — Electric recorder — Two types of response, positive and negative — Universal applicability of electric mode of response — Electric response a measure of physiological activity — Electric response in plants.\n\nUnlike muscle, a length of nerve, when mechanically or electrically excited, does not undergo any visible change. That it is thrown into an excitatory state, and that it conducts the excitatory disturbance, is shown however by the contraction produced in an attached piece of muscle, which serves as an indicator.\n\nBut the excitatory effect produced in the nerve by stimulus can also be detected by an electrical method. If an isolated piece of nerve be taken and two contacts be made on its surface by means of non-polarisable electrodes at A and B, connection being made with a galvanometer, no current will be observed, as both A and B are in the same physico-chemical condition. The two points, that is to say, are iso-electric.\n\nIf now the nerve be excited by stimulus, similar disturbances will be evoked at both A and B. If, further, these disturbances, reaching A and B almost simultaneously, cause any electrical change, then, similar changes taking place at both points, and there being thus no relative difference between the two, the galvanometer will still indicate no current. This null-effect is due to the balancing action of B as against A. (See Figure 2a)\n\nIf then we wish to detect the response by means of the galvanometer, one means of doing so will lie in the abolition of this balance, which may be accomplished by making one of the two points, say B, more or less permanently irresponsive. In that case, stimulus will cause greater electrical disturbance at the more responsive point, say A, and this will be shown by the galvanometer as a current of response. To make B less responsive we may injure it by means of a cross-sectional cut, a burn, or the action of strong chemical reagents.\n\na) Iso-electric contacts; no current in the galvanometer.\n\nb) The end B injured; current of injury from B to A: stimulation gives rise to an action current from A to B.\n\nWe shall revert to the subject of electric response; meanwhile it is necessary to say a few words regarding the electric disturbance caused by the injury itself. Since the physicochemical conditions of the uninjured A and the injured B are now no longer the same, it follows that their electric conditions have also become different. They are no longer iso-electric. There is thus a more or less permanent or resting difference of electric potential between them. A current — the current of injury — is found to flow in the nerve, from the injured to the uninjured, and in the galvanometer, through the electrolytic contacts from the uninjured to the injured. As long as there is no further disturbance this current of injury remains approximately constant, and is therefore sometimes known as ‘the current of rest’ (Figure 2b).\n\nA piece of living tissue, unequally injured at the two ends, is thus seen to act like a voltaic element, comparable to a copper and zinc couple. As some confusion has arisen, on the question of whether the injured end is like the zinc or copper in such a combination, it will perhaps be well to enter upon this subject in detail.\n\nIf we take two rods, of zinc and copper respectively, in metallic contact, and further, if the points A and B are connected by a strip of cloth s moistened with salt solution, it will be seen that we have a complete voltaic element. A current will now flow from B to A in the metal (Figure 3a) and from A to B through the electrolyte s. Or instead of connecting A and B by a single strip of cloth s, we may connect them by two strips s s′, leading to non-polarisable electrodes E E′. The current will then be found just the same as before, i.e. from B to A in the metallic part, and from A through s s′ to B, the wire W being interposed, as it were, in the electrolytic part of the circuit. If now a galvanometer be interposed at O, the current will flow from B to A through the galvanometer, i.e. from right to left. But if we interpose the galvanometer in the electrolytic part of the circuit, that is to say, at W, the same current will appear to flow in the opposite direction. In Figure 3c, the galvanometer is so interposed, and in this case it is to be noticed that when the current in the galvanometer flows from left to right, the metal connected to the left is zinc.\n\nCompare Figure 3d, where A B is a piece of nerve of which the B end is injured. The current in the galvanometer through the non-polarisable electrode is from left to right. The uninjured end is therefore comparable to the zinc in a voltaic cell (i.e it is zincoid), the injured being copper-like or cuproid.(2)\n\nFig. 3 — Diagram showing the correspondence between injured (b) and uninjured (a) contacts in nerve, and Cu and Zn in a voltaic element\n\nComparison of (c) and (d) will show that the injured end of B in (d) corresponds with the Cu in (c).\n\nIf the electrical condition of, say, zinc in the voltaic couple Figure 3c) undergoes any change (and I shall show later that this can be caused by molecular disturbance), then the existing difference of potential between A and B will also undergo variation. If for example the electrical condition of A approaches that of B, the potential difference will undergo a diminution, and the current hitherto flowing in the circuit will, as a consequence, display a diminution, or negative variation.\n\nWe have seen that a current of injury — sometimes known as ‘current of rest’ — flows in a nerve from the injured to the uninjured, and that the injured B is then less excitable than the uninjured A. If now the nerve be excited, there being a greater effect produced at A, the existing difference of potential may thus be reduced, with a consequent diminution of the current of injury. During stimulation, therefore, a nerve exhibits a negative variation. We may express this in a different way by saying that a ‘current of action’ was produced in response to stimulus, and acted in an opposite direction to the current of injury (Figure 2b). The action current in the nerve is from the relatively more excited to the relatively less excited.\n\nWe shall deal later with a method by which a responsive current of action is obtained without any antecedent current of injury. ‘Negative variation’ has then no meaning. Or, again, a current of injury may sometimes undergo a change of direction. In view of these considerations it is necessary to have at our disposal other forms of expression by which the direction of the current of response can still be designated.\n\nKeeping in touch with the old phraseology, we might then call a current ‘negative’ that which flows from the more excited to the less excited. Or, bearing in mind the fact that an uninjured contact acts as the zinc in a voltaic couple, we might call it ‘zincoid,’ and the injured contact ‘cuproid.’\n\nStimulation of the uninjured end, approximating it to the condition of the injured, might then be said to induce a ‘cuproid change’.\n\nThe electric change produced in a normal nerve by stimulation may therefore be expressed by saying that there has been a negative variation, or that there was a current of action from the more excited to the less excited, or that stimulation has produced a cuproid change.\n\nThe excitation, or molecular disturbance, produced by a stimulus has thus a concomitant electrical expression. As the excitatory state disappears with the return of the excitable tissue to its original condition, the current of action will gradually disappear.(3) The movement of the galvanometer needle during excitation of the tissue thus indicates a molecular upset by the stimulus; and the gradual creeping back of the galvanometer deflection exhibits a molecular recovery.\n\nThis transitory electrical variation constitutes the ‘response,’ and its intensity varies according to that of the stimulus.\n\nWe have thus a method of obtaining curves of response electrically. After all, it is not essentially very different from the mechanical method. In this case we use a magnetic lever (Figure 4a), the needle of the galvanometer, which is deflected by the electromagnetic pull of the current, generated under the action of stimulus, just as the mechanical lever was deflected by the mechanical pull of the muscle contracting under stimulus.\n\nThe accompanying diagram (Figure 4b) shows how, under the action of stimulus, the current of rest undergoes a transitory diminution, and how on the cessation of stimulus there is gradual recovery of the tissue, as exhibited in the return of the galvanometer needle to its original position.\n\n(a) M muscle; A uninjured, B injured ends. E E′ non-polarising electrodes connecting A and B with galvanometer G. Stimulus produces ‘negative variation’ of current of rest. Index connected with galvanometer needle records curve on travelling paper (in practice, moving galvanometer spot of light traces curve on photographic plate). Rising part of curve shows effect of stimulus; descending part, recovery.\n\n(b) O is the zero position of the galvanometer; injury produces a deflection A B; stimulus diminishes this deflection to C; C D is the recovery.\n\nIt may here be added that though stimulus in general produces a diminution of current of rest, or a negative variation (e.g. muscles and nerves), yet, in certain cases, there is an increase, or positive variation. This is seen in the response of the retina to light.\n\nAgain, a tissue which normally gives a negative variation may undergo molecular changes, after which it gives a positive variation. Thus Dr. Waller finds that whereas fresh nerve always gives negative variation, stale nerve sometimes gives positive; and that retina, which when fresh gives positive, when stale, exhibits negative variation.\n\nThe following is a summary of the two types of response:\n\n1) Negative variation — Action current from more excited to less excited — cuproid change in the excited — e.g. fresh muscle and nerve, stale retina.\n\n2) Positive variation — Action current from less excited to more excited — zincoid change in the excited — e.g. stale nerve, fresh retina.(4)\n\nFrom this it will be seen that it is the fact of the electrical response of living substances to stimulus that is of essential importance, the sign plus or minus being a minor consideration.\n\nThis mode of obtaining electrical response is applicable to all living tissues, and in cases like that of muscle, where mechanical response is also available, it is found that the electrical and mechanical records are practically identical.\n\nThe two response curves seen in the accompanying diagram (Figure 5), and taken from the same muscle by the two methods simultaneously, clearly exhibit this. Thus we see that electrical response can not only take the place of the mechanical record, but has the further advantage of being applicable in cases where the latter cannot be used.\n\nThese electrical changes are regarded as physiological, or characteristic of living tissue, for any conditions which enhance physiological activity also, pari passu, increase their intensity. Again, when the tissue is killed by poison, electrical response disappears, the tissue passing into an irresponsive condition. Anæsthetics, like chloroform, gradually diminish, and finally altogether abolish, electrical response.\n\nFig. 5 — Simultaneous record of the mechanical (M) and (E) electrical responses of the muscle of frog (Waller)\n\nFrom these observed facts — that living tissue gives response while a tissue that has been killed does not — it is concluded that the phenomenon of response is peculiar to living organisms.(5) The response phenomena that we have been studying are therefore considered as due to some unknown, super-physical ‘vital’ force and are thus relegated to a region beyond physical inquiry.\n\nIt may, however, be that this limitation is not justified, and surely, at least until we have explored the whole range of physical action, it cannot be asserted definitely that a particular class of phenomena is by its very nature outside that category.\n\nBut before we proceed to the inquiry as to whether these responses are or are not due to some physical property of matter, and are to be met with even in inorganic substances, it will perhaps be advisable to see whether they are not paralleled by phenomena in the transitional world of plants. We shall thus pass from a study of response in highly complex animal tissues to those given under simpler vital conditions.\n\nElectric response has been found by Munck, Burdon-Sanderson, and others to occur in sensitive plants. But it would be interesting to know whether these responses were confined to plants which exhibit such remarkable mechanical movements, and whether they could not also be obtained from ordinary plants where visible movements are completely absent. In this connection, Kunkel observed electrical changes in association with the injury or flexion of stems of ordinary plants.(6)\n\nMy own attempt, however, was directed, not towards the obtaining of a mere qualitative response, but rather to the determination of whether throughout the whole range of response phenomena a parallel between animal and vegetable could be detected. That is to say, I desired to know, with regard to plants, what was the relation between intensity of stimulus and the corresponding response; what were the effects of superposition of stimuli; whether fatigue was present, and in what manner it influenced response; what were the effects of extremes of temperature on the response; and, lastly, if chemical reagents could exercise any influence in the modification of plant response, as stimulating, anæsthetic, and poisonous drugs have been found to do with nerve and muscle.\n\nIf it could be proved that the electric response served as a faithful index of the physiological activity of plants, it would then be possible successfully to attack many problems in plant physiology, the solution of which at present offers many experimental difficulties.\n\nWith animal tissues, experiments have to be carried on under many great and unavoidable difficulties. The isolated tissue, for example, is subject to unknown changes inseparable from the rapid approach of death. Plants, however, offer a great advantage in this respect, for they maintain their vitality unimpaired during a very great length of time.\n\nIn animal tissues, again, the vital conditions themselves are highly complex. Those essential factors which modify response can, therefore, be better determined under the simpler conditions which obtain in vegetable life.\n\nIn the following chapters it will be shown that the response phenomena are exhibited not only by plants but by inorganic substances as well, and that the responses are modified by various conditions in exactly the same manner as those of animal tissues. In order to show how striking are these similarities, I shall for comparison place side by side the responses of animal tissues and those I have obtained with plants and inorganic substances. For the electric response in animal tissues, I shall take the latest and most complete examples from the records made by Dr. Waller.\n\nBut before we can obtain satisfactory and conclusive results regarding plant response, many experimental difficulties will have to be surmounted. I shall now describe how this has been accomplished.(7)\n\n2. In some physiological text-books much wrong inference has been made, based on the supposition that the injured end is zinc-like.\n\n3. “The exciting cause is able to produce a particular molecular rearrangement in the nerve; this constitutes the state of excitation and is accompanied by local electrical changes as an ascertained physical concomitant.\n\nThe excitatory state evoked by stimulus manifests itself in nerve fibres by E.M. changes, and as far as our present knowledge goes by these only. The conception of such an excitable living tissue as nerve implies that of a molecular state which is in stable equilibrium. This equilibrium can be readily upset by an external agency, the stimulus, but the term “stable” expresses the fact that a change in any direction must be succeeded by one of opposite character, this being the return of the living structure to its previous state. Thus the electrical manifestation of the excitatory state is one whose duration depends upon the time during which the external agent is able to upset and retain in a new poise the living equilibrium, and if this is extremely brief, then the recoil of the tissue causes such manifestation to be itself of very short duration.” — Textbook of Physiology, ed. by Schäfer, ii. 453.\n\n4. I shall here mention briefly one complication that might arise from regarding the current of injury as the current of reference, and designating the response current either positive or negative in relation to it. If this current of injury remained always invariable in direction — that is to say, from the injured to the uninjured — there would be no source of uncertainty. But it is often found, for example in the retina, that the current of injury undergoes a reversal, or is reversed from the beginning. That is to say, the direction is now from the uninjured to the injured, instead of the opposite. Confusion is thus very apt to arise. No such misunderstanding can however occur if we call the current of response towards the more excited positive, and towards the less excited negative."
    },
    {
        "url": "https://medium.com/@dlmajor/my-life-up-to-the-age-of-forty-had-been-spent-in-my-native-city-of-philadelphia-f98bb51a6196?source=user_profile---------5----------------",
        "title": "My life, up to the age of forty, had been spent in my native city of Philadelphia…",
        "text": "THE MAN WHO FEEDS his cattle on a thousand hills may possibly see the title of this little volume paraded through the newspapers; but the chances are that he will never think it worthwhile to look into the volume itself. The owner of a hundred acres will scarcely step out of his way to purchase or to borrow it, while the lord of every smaller farm will be sure it is not intended for him.\n\nFew persons belonging to these various classes have been educated to believe that ten acres are enough. Born to greater ambition, they have aimed higher and grasped at more, sometimes wisely, sometimes not. Many of these are now owning or cultivating more land than their heads or purses enable them to manage properly. Had their ambition been moderate and their ideas more practical, their labor would be better rewarded, and this book, without doubt, would have found more readers.\n\nThe mistaken ambition for owning twice as much land as one can thoroughly manure or profitably cultivate is the great agricultural sin of this country. Those who commit it, by beginning wrongly, too frequently continue just as wrongly. Owning many acres is the sole idea. High cultivation of a small tract, is one of which they have little knowledge. Too many people think they know enough. They measure a man’s knowledge by the number of acres he owns. Hence, in their eyes, the owner of a plot so humble as mine must know so little as to be unable to teach them anything new.\n\nHappily, it is not for these that I write, and hence it would be unreasonable to expect them to become readers. I write more particularly for those who have not been brought up as farmers — for that numerous body of patient toilers in city, town, and village, who, like myself, have struggled on from year to year, anxious to break away from the bondage of the desk, the counter, or the workshop, to realize in the country even a moderate income, so that it be a sure one. Many such people are constantly looking for something which, with less mental toil and anxiety, will provide for a growing family, and afford a refuge for advancing age — some safe and quiet harbor, sheltered from the constantly recurring monetary and political convulsions which in this country so suddenly reduce men to poverty. But these inquirers find no experienced pioneers to lead the way, and they turn back upon themselves, too fearful to go forward alone.\n\nBooks of personal experience such as this one are rare. This is written for the information of those not only willing, but anxious to learn. Once in the same predicament myself, I know their longings, their deficiencies, and the steps they ought to take to achieve success.\n\nHence, in seeking to make myself fully understood, some may think that I have been unnecessarily particular in my retelling of minute details. But in setting forth my own crudities and mistakes, I seek only to prevent others from repeating them. Yet even with all this information, this small volume will cause no crowding, even on a bookshelf which may be already filled.\n\nI am too new a farmer to be the originator of all the ideas which are here set forth. Some, which seemed to be appropriate to the topic in hand, have been incorporated with the argument as it progressed; while in some instances, even the language of writers, whose names were unknown to me, has also been adopted.\n\nMY LIFE, up to the age of forty, had been spent in my native city of Philadelphia. Like thousands of others before me, I began the world without a dollar, and with a very few friends in a condition to assist me. Having saved a few hundred dollars through close application to business, and avoiding taverns, oyster-houses, theatres, and fashionable tailors, I married and went into business the same year.\n\nThese two contemporaneous drafts upon my little capital proving heavier than I expected, they soon used it up, leaving me thereafter struggling for means. It is true my business kept me, but as it was constantly expanding — and was of such a nature that a large proportion of my annual income was necessarily invested in tools, fixtures, and machinery — I was nearly always short of ready cash to carry on my operations with comfort. At certain times, also, it ceased to be profitable.\n\nThe crisis of 1837 nearly ruined me, and I was kept struggling along during the five succeeding years of hard times, until the revival of 1842 came round. Previous to this crisis, necessity had driven me to the banks for loans, one of the sore evils of doing business with insufficient capital. As is always the case with these institutions, they compelled me to return the borrowed money at the very time it was least convenient for me to do so — they needed it as urgently as myself. To repay them I was compelled to borrow elsewhere, and that too at excessive rates of interest, thus increasing the burden while laboring to shake it off.\n\nThousands have gone through the same unhappy experience, and been crushed by the load. Such people can appreciate my trials and privations.\n\nYet I was not insolvent. My property had cost me far more than what I owed, yet if offered for sale at a time when the whole community seemed to want money only, no one could have been found to pay the price. I could not use it as the basis of a loan, neither could I part with it without abandoning my business. Hence I struggled on through that exhausting crisis, haunted by perpetual fears of being dishonored at the bank — lying down at night, not to peaceful slumber, but to dream of fresh expedients to preserve my credit for tomorrow. I have sometimes thought that the financial cares of that struggle were severe enough to have shortened my life, had they been much longer protracted.\n\nBesides the mental anxieties they caused, they compelled a pinching economy in my family. But in this latter effort I discovered my wife to be a jewel of priceless value, coming up heroically to the task, and relieving me of a world of care. Without her aid, her skill, her management, her uncomplaining cheerfulness, her sympathy for struggles so inadequately rewarded as mine were, I would have sunk into utter bankruptcy.\n\nHer economy was not the mean, penny-wise, pound-foolish approach which many mistake for true economy. It was the art of calculation joined to the habit of order, and the power of proportioning our wishes to the means of gratifying them. The little and pilfering temper of a wife is despicable and odious to every man of sense; but there is a judicious, graceful economy, which has no connection with an avaricious temper, and which, as it depends upon the understanding, can be expected only from cultivated minds. Women who have been well educated, far from despising domestic duties, will hold them in high respect, because they will see that the whole happiness of life is made up of the happiness of each particular day and hour, and that much of the enjoyment of these depends on the punctual practice of virtues which are more valuable than splendid.\n\nIf I survived that crisis, it was owing to my wife’s admirable management of my household expenses. She saw that our embarrassment was due to no imprudence or neglect of mine. She thus consented to severe privations, uttering no complaint, hinting no reproach, never disheartened, and was so rarely out of humor that she never failed to welcome my return with a smile.\n\nBut in this country one convulsion follows another with disheartening frequency. I lived through that of 1837, paid my debts, and had even managed to save some money.\n\nMy wife’s system of economy had been so long adhered to that in the end it became to some extent habitual to her, and she still continued to practice great frugality. I became insensibly accustomed to it myself. Children were multiplying around us, and we thought the skies had brightened for all future time.\n\nWhen in difficulty, we had often debated the propriety of quitting the city and its terrible business trials, and settling on a few acres in the country, where we could raise our own food, and spend the remainder of our days in cultivating ground which would be sure to yield us at least a respectable subsistence. We had no longing for excessive wealth: a mere competency, though earned by daily toil, so that it was reasonably sure, and free from the drag of continued indebtedness to others, was all we coveted.\n\nI had always loved the country, but my wife preferred the city. I could take no step that would not promote her happiness. So long as times continued to be fair, we ceased to consider a move to the country. We had children to educate, and to her the city seemed the best and most convenient place for this. Then also, most of our relations lived near us. Our habits were eminently social. We had made numerous friends, and among our neighbors there were many good families.\n\nWe felt the thought of breaking away from all this to be a trying one. But even so, the prospect of a move to the country had taken strong hold of my mind.\n\nIndeed, it may be said that I was born with a passion for living on a farm. It was fixed and strengthened by my long experience of the business vicissitudes of city life.\n\nFor many years I had been a constant subscriber of several agricultural journals, whose contents I read as carefully as I did those of the daily papers. My wife also, being a great reader, in time began to study them almost as attentively. Everything I saw in them only confirmed my longing for the country, while they gave definite indications of what kind of farming I was fit for. In fact, the journals educated me for the position before I assumed it. And I am sure they played a role in removing most of my wife’s objections to living in the country.\n\nI studied their contents as carefully as did the writers who prepared them. I watched the reports of crops, of experiments, and of profits. The leading idea in my mind was this — that a man of ordinary industry and intelligence, by choosing a proper location within hourly reach of a great city market, could so cultivate a few acres as to support his family, free from the ruinous vibrations of trade or commerce in the metropolis.\n\nAll my reading served to convince me of the soundness of this idea. I did not assume that we could get rich on the few acres which I ever expected to own; but I felt assured that we could place ourselves above want. I knew that our peace of mind would be sure. With me, this was dearer than all. My reading had satisfied me that we would find ten acres to be enough.\n\nAs I did not contemplate undertaking the management of a large grain farm, my studies did not run in that direction. Yet I read everything that came before me in relation to grain farming, and not without profit. But I graduated my views to my means, and so noted with the utmost care the experiences of the small cultivators who farmed five to ten acres thoroughly.\n\nI noted their failures as carefully as I did their successes, knowing that the former were to be avoided, as the latter were to be imitated. As opportunity offered, I made repeated excursions, year after year, in every direction around Philadelphia, visiting the small farmers or truckers who supplied the city market with fruit and vegetables, examining, inquiring, and remembering all that I saw and heard. The fund of knowledge thus acquired was not only prodigious, but it has been of lasting value to me in my subsequent operations. I found multitudes of truckers who were raising large families on five acres of ground, while others, owning only thirty acres, had become rich.\n\nOn most of these numerous excursions I was careful to have my wife with me. I wanted her to see and hear for herself, and by showing her the evidence, to overcome her diminishing reluctance to leaving the city. My uniform consideration for her comfort at last secured the object I had in view. She saw so many homes in which a quiet abundance was found, so many contented men and women, so many robust and bouncing children, that long before I was ready to leave the city, she was quite impatient to be gone.\n\nTHERE WAS NOT a particle of romance in my aspirations for a farm, neither had I formed a visionary theory which was there to be tested. My notions were all sober and prosaic.\n\nI had struggled all my life for dollars, because abundance of them produces comfort: and the change to country life was to be, in reality, a mere continuation of the struggle, but lightened by the assurance that if the dollars thus to be acquired were fewer in number, the certainty of earning enough of them was likely to be greater. Crops might fail under skies at one time too watery, at another too dry, but no such disaster could equal those to which commercial pursuits are continually exposed. For nearly twenty years, I had been hampered with having debts of my own or of other parties to pay; but of all the farmers I had visited only one had ever given a note, and he had made a vow never to give another. My wife was shrewd enough to observe and remark on this fact at the time, it was so different from my own experience.\n\nShe admitted there must be some satisfaction in carrying on a business which did not require the giving of notes.\n\nLooking at the matter of removal to the country in a practical light, I found that in the city I was paying three hundred dollars a year rent for a house. It was the interest of five thousand dollars; yet it afforded nothing but a shelter for my family. I might continue to pay that rent for fifty years, without, at the end of that time, having acquired the ownership of either a single stone in the chimney, or a shingle on the roof. If the house rose in value, the rise would be to the owner’s benefit, not mine. It would really be injurious to me, as the rise would lead him to demand an increase of his rent.\n\nBut put the value of the house into a farm — or even the half of it — the farm would have a house on it, in which my family would find as good a shelter, while the land, if cultivated as industriously as I had always cultivated business, would belie the flood of evidence I had been studying for many years if it failed to provide the returns which it was manifestly returning to others.\n\nWe could live contentedly on a thousand dollars a year, and here we would have no landlord to pay. My wife, in hard times, has budgeted us through the year on several hundred less. I confess to having lived as well on the diminished rations as I wanted to. Indeed, until one tries it for himself, it is incredible what dignity there is in an old hat, what virtue in a time-worn coat, and how savory the dinner table can be made without sirloin steaks or cranberry tarts.\n\nThus, let it be remembered, my views and aspirations had no tinge of extravagance. My rule was moderation. The tortures of struggling in the city with little capital had sobered me down to being contented with a bare competency. I might fail in some particulars at the outset, from ignorance, but I was in the prime of life, strong, active, industrious, and tractable, and what I did not know I could soon learn from others, for farmers have no secrets.\n\nAlso, I had seen too much of the uncertainty of banks and stocks, ledger accounts, and promissory notes, to be willing to invest in them. At best they are fluctuating and uncertain, up today and down tomorrow. My great preference had always been for land.\n\nIn looking around among my wide circle of city acquaintances, especially among the older families, I could not fail to notice that most of them had grown rich by the ownership of land. More than once had I seen the values of all city property, improved and unimproved, disappear — lots without purchasers, and houses without tenants, the community so poor and panic stricken that real estate became the merest drug. Yesterday the collapse was caused by the destruction of the National Bank; today it is the Tariff. Sheriffs played havoc with houses and lands encumbered by mortgages, and lawyers fattened on the rich harvest of fees inaugurated by a Bankrupt Law. But those who, undismayed by the wreck around them, courageously held on to land, came through in safety. The storm, having run its course and exhausted its wrath, gave place to calmer commercial skies, and real estate swung back with an irrepressible momentum to its former value, only to keep on advancing to one even greater.\n\nI became convinced that safety lay in the ownership of land. In all my inquiries both before leaving the city, as well as since, I rarely heard of a farmer becoming insolvent. When I did, and was careful to ascertain the cause, it turned out that he had either begun in debt, and was thus hampered at the beginning, or had made bad bargains in speculations outside of his calling, or wasted his means in riotous living, or had in some way utterly neglected his business. If not made rich by heavy crops, I could find none who had been made poor by bad ones.\n\nThe reader may look back over every monetary convulsion he may be able to remember, and he will find that in all of them, the agricultural community came through with less disaster than any other sector. Wheat grows and corn ripens though all the banks in the world may break, for seed germination and harvest is one of the divine promises to man, never to be broken. Crops grew and ripened before banks were invented, and will continue to do so when banks and railroad bonds have become obsolete.\n\nMoreover, the asset for whose acquisition we are striving, we naturally desire to hold permanently. As we have worked for it, so we trust that it will work for us and our children. Its value, whatever that may be, depends on its perpetuity — the continuance of its existence. A man seeks to earn what will support and serve not only himself, but his posterity. He would naturally desire to have the estate pass on to his children and grandchildren. This is one great object of his toil.\n\nWhat, then, is the safest fund in which to invest? What is the only fund which the experience of the last fifty years has shown, with very few exceptions, would be absolutely safe as a provision for heirs? How many men, within that period, acting as trustees for estates, have kept the trust fund invested in stocks, and when distributing the principal among the heirs, have found that most of it had vanished! Thanks to corporate insolvency it had melted into air. No prudent man, accepting such a trust, and seeking to guarantee its integrity, would invest the fund in stocks.\n\nOur country is filled with financial wrecks from causes like this. Thousands trust themselves to manage this description of property, confident of their caution and sagacity. With close watching and good luck, they may be equal to the task; but the question still occurs as to the likely duration of such a fund in families. What is its safety when invested in the current stocks of the country? And next, what is its safety in the hands of heirs? There are no statistics showing the probable continuance of estates of land in families, compared to estates composed of personal property, such as stocks. But every bank cashier will testify to one remarkable fact: that an heir no sooner inherits stock in the bank than the first thing he generally does is to sell and transfer it, and that such sale is most frequently the first notice given of the holder’s death.\n\nThis preference for investment in real estate will doubtless be objected to by the young and dashing businessman. But lands, or a fund secured by real estate, is unquestionably not only the highest security, but in the hands of heirs it is the only one likely to survive a single generation. Hence the wisdom of the common law, which neither permits the guardian to sell the lands of his ward, nor even the court, in its discretion, to grant authority for their sale, except upon sufficient grounds shown — as a necessity for raising a fund for the support and education of the ward. Even a lord chancellor can only touch so sacred a fund for this or similar reasons. The common law is wise on this subject, as on most others.\n\nThose, therefore, who acquire personal property acquire only what will last about a generation, longer or shorter. Such property is quickly converted into money — it perishes and is gone. But land possesses a few characteristics which protect it from such destruction. It is not so easily transferred; it is not so secretly transferred; the law requires deliberate formalities before it can be alienated, and often the consent of various parties is necessary. When all other guards give way, early memories of parental attachment to these ancestral acres, or tender reminiscences of childhood, will come in to stay the spoliation of the homestead, and make anyone pause before giving up this portion of his inheritance.\n\nThroughout Europe a passion to become the owner of land is universal, while the difficulty of gratifying it is infinitely greater than with us. There is there enormously expensive; here it is absurdly cheap. It is from this universal passion that the vast annual immigration to this country derives its mighty impulse. As it reaches our shores it spreads itself over the country in search of cheap land. Many of the most flourishing Western states have been built up by the astonishing influx of immigrants. In England, every landowner is quick to secure any property near him, be it large or small, as it comes into market. Hence the number of freeholders in that country is annually diminishing by this process of absorption. This European passion for acquiring land is strangely contrasted with the American passion for parting with it."
    },
    {
        "url": "https://medium.com/@dlmajor/my-early-life-by-nikola-tesla-7b55945ee114?source=user_profile---------6----------------",
        "title": "My Early Life, by Nikola Tesla – David Major –",
        "text": "In 1919, Tesla wrote several articles for the magazine Electrical Experimenter. The following is the first of them.\n\nThe progressive development of man is vitally dependent on invention. It is the most important product of his creative brain. Its ultimate purpose is the complete mastery of mind over the material world, the harnessing of the forces of nature to human needs. This is the difficult task of the inventor, who is often misunderstood and unrewarded. But he finds ample compensation in the pleasing exercises of his powers and in the knowledge of being one of that exceptionally privileged class without whom the race would have long ago perished in the bitter struggle against pitiless elements.\n\nSpeaking for myself, I have already had more than my full measure of this exquisite enjoyment, so much that for many years, my life was little short of continuous rapture. I am credited with being one of the hardest workers and perhaps I am, if thought is the equivalent of labor, for I have devoted to it almost all of my waking hours. But if work is interpreted to be a definite performance in a specified time according to a rigid rule, then I may be the worst of idlers. Every effort under compulsion demands a sacrifice of life energy. I never paid such a price. On the contrary, I have thrived on my thoughts.\n\nIn attempting to give a connected and faithful account of my activities in this series of articles which will be presented with the assistance of the editors of the Electrical Experimenter, I must dwell, however reluctantly, on the impressions of my youth and the circumstances and events which have been instrumental in determining my career.\n\nOur first endeavors are purely instinctive, promptings of an imagination vivid and undisciplined. As we grow older, reason asserts itself, and we become more and more systematic and designing. But those early impulses, though not immediately productive, are of the greatest importance and may shape our very destinies. Indeed, I feel now that had I understood and cultivated instead of suppressing them, I would have added substantial value to my bequest to the world. But not until I had attained manhood did I realize that I was an inventor.\n\nThis was due to a number of causes. In the first place I had a brother who was gifted to an extraordinary degree — one of those rare phenomena of mentality which biological investigation has failed to explain. His premature death left my parents disconsolate.\n\nWe owned a horse which had been presented to us by a dear friend. It was a magnificent animal of Arabian breed, possessed of almost human intelligence, and was cared for and petted by the whole family, having on one occasion saved my father’s life under remarkable circumstances. My father had been called one winter night to perform an urgent duty and while crossing the mountains, which were infested by wolves, the horse became frightened and ran away, throwing him violently to the ground. It arrived home bleeding and exhausted, but after the alarm was sounded immediately dashed off again, returning to the spot, and before the search party were far on the way they were met by my father, who had recovered consciousness and remounted, not realizing that he had been lying in the snow for several hours. This same horse was responsible for my brother’s injuries, from which he died. I witnessed the tragic scene and although 56 years have elapsed since, my visual impression of it has lost none of its force. The recollection of his attainments makes every effort of mine seem dull in comparison.\n\nAnything I did that was creditable merely caused my parents to feel their loss more keenly. So I grew up with little confidence in myself. But I was far from being considered a stupid boy, if I am to judge from an incident of which I have still a strong remembrance.\n\nOne day the aldermen were passing through a street, where I was at play with other boys. The oldest of these venerable gentlemen — a wealthy citizen — paused to give a silver piece to each of us. Coming to me he stopped and commanded, “Look in my eyes.” I met his gaze, my hand outstretched to receive the much-valued coin, when, to my dismay, he said, “No, you can get nothing from me, you are too smart.”\n\nThey used to tell a funny story about me. I had two old aunts with wrinkled faces, one of them having two teeth protruding like the tusks of an elephant, which she buried in my cheek every time she kissed me. Nothing would scare me more than the prospect of being hugged by these relatives, as affectionate as they were unattractive. It happened that while being carried in my mother’s arms they asked me who was the prettier of the two. After examining their faces intently, I answered thoughtfully, pointing to one of them, “This one here is not as ugly as the other.”\n\nThen again, I was intended from my very birth for the clerical profession, and this thought constantly oppressed me. I longed to be an engineer, but my father was inflexible. He was the son of an officer who served in the army of the great Napoleon and, in common with his brother, who was a professor of mathematics in a prominent institution, he had received a military education but, singularly enough, later embraced the clergy in which vocation he achieved eminence. He was a very erudite man, a veritable natural philosopher, poet and writer, and his sermons were said to be as eloquent as those of Abraham á Sancta-Clara. He had a prodigious memory, and frequently recited at length from works in several languages. He often remarked playfully that if some of the classics were lost, he would be able to restore them. His style of writing was much admired; he penned sentences that were short and terse, and was full of wit and satire. The humorous remarks he made were always peculiar and characteristic. Just to illustrate, I may mention one or two instances.\n\nAmong the help there was a cross-eyed man called Mane, employed to do work around the farm. He was chopping wood one day. As he swung the axe my father, who stood nearby and felt very uncomfortable, cautioned him, “For God’s sake, Mane, do not strike at what you are looking at, but at what you intend to hit.”\n\nOn another occasion, he was taking out for a drive a friend who carelessly permitted his costly fur coat to rub on the carriage wheel. My father reminded him of it saying, “Pull in your coat, you are ruining my tyre.”\n\nHe had the odd habit of talking to himself, and would often carry on an animated conversation and indulge in heated argument, changing the tone of his voice. A casual listener might have sworn that several people were in the room.\n\nAlthough I must attribute to my mother’s influence whatever inventiveness I possess, the training he gave me must have been helpful. It comprised all sorts of exercises — such as guessing one another’s thoughts, discovering the defects of some form or expression, repeating long sentences, or performing mental calculations. These daily lessons were intended to strengthen memory and reason and especially to develop the critical sense, and were undoubtedly very beneficial.\n\nMy mother descended from one of the oldest families in the country, and a line of inventors. Both her father and grandfather originated numerous implements for household, agricultural and other uses. She was a truly great woman, of rare skill, courage and fortitude, who had braved the storms of life and passed through many a trying experience.\n\nWhen she was sixteen, a virulent pestilence swept the country. Her father was called away to administer the last sacraments to the dying, and during his absence she went alone to the assistance of a neighboring family who were stricken by the dread disease. All of the members of the family, five in number, succumbed in rapid succession. She bathed, clothed and laid out the bodies, decorating them with flowers according to custom, and when her father returned he found everything ready for a Christian burial.\n\nMy mother was an inventor of the first order and would, I believe, have achieved great things had she not been so remote from modern life and its multifold opportunities. She invented and constructed all kinds of tools and devices and wove the finest designs from thread which was spun by her. She even planted the seeds, raised the plants and separated the fibers herself. She worked indefatigably, from daybreak till late at night, and most of the clothing and furnishings of the home were the product of her hands. When she was past sixty, her fingers were still nimble enough to tie three knots in an eyelash.\n\nThere was another and still more important reason for my late awakening. In my boyhood, I suffered from a peculiar affliction due to the appearance of images, often accompanied by strong flashes of light, which marred the sight of real objects and interfered with my thought and action. They were pictures of things and scenes which I had really seen, never of those I imagined. When a word was spoken to me, the image of the object it designated would present itself vividly to my vision, and sometimes I was quite unable to distinguish whether what I saw was tangible or not.\n\nThis caused me great discomfort and anxiety. None of the students of psychology or physiology whom I have consulted could ever explain satisfactorily these phenomena. They seem to have been unique, although I was probably predisposed, as I know that my brother experienced similar trouble.\n\nThe theory I have formulated is that the images were the result of a reflex action from the brain on the retina under great excitation. They certainly were not hallucinations such as are produced in diseased and anguished minds, for in other respects I was normal and composed.\n\nTo give an idea of my distress, suppose that I had witnessed a funeral or some such nerve-racking spectacle. Then, inevitably, in the stillness of night, a vivid picture of the scene would thrust itself before my eyes and persist, despite all my efforts to banish it. Sometimes it would even remain fixed in space though I pushed my hand through it.\n\nIf my explanation is correct, it should be possible to project on a screen the image of any object one conceives, and so make it visible. Such an advance would revolutionize all human relations. I am convinced that this wonder can, and will, be accomplished in times to come; I may add that I have devoted much thought to the solution of the problem.\n\nTo free myself of these tormenting appearances, I tried to concentrate my mind on something else I had seen, and in this way I would often obtain temporary relief; but in order to achieve it, I had to conjure continuously new images.\n\nIt was not long before I found that I had exhausted all of those at my command; my ‘reel’ had run out, as it were, because I had seen so little of the world — only objects in my home and the immediate surroundings. As I performed these mental operations for the second or third time, in order to chase the appearances from my vision, the remedy gradually lost its force.\n\nThen I instinctively commenced to make excursions beyond the limits of the small world of which I had knowledge, and I saw new scenes. These were at first very blurred and indistinct, and would flit away when I tried to concentrate my attention upon them, but by and by I succeeded in fixing them; they gained in strength and distinctness, and finally assumed the concreteness of real things. I soon discovered that my best comfort was attained if I simply went on in my vision farther and farther, getting new impressions all the time, and so I began to travel — of course, in my mind. Every night (and sometimes during the day), when alone, I would start on my journeys — see new places, cities and countries — live there, meet people and form friendships, and meet acquaintances and — however unbelievable — it is a fact that they were just as dear to me as those in real life, and not a bit less intense in their manifestations.\n\nThis I did constantly until I was about seventeen, when my thoughts turned seriously to invention. Then I observed to my delight that I could visualize with the greatest facility. I needed no models, drawings or experiments. I could picture them all as real in my mind. Thus I had been led unconsciously to evolve what I consider to be a new method of materializing inventive concepts and ideas, which is radically opposite to the purely experimental, and is in my opinion ever so much more expeditious and efficient. The moment one constructs a device to carry into practice a crude idea, he finds himself unavoidably engrossed with the details and defects of the apparatus. As he goes on improving and reconstructing, his force of concentration diminishes, and he loses sight of the great underlying principle. Results may be obtained, but always at the sacrifice of quality.\n\nMy method is different. I do not rush into actual work. When I get an idea I start at once building it up in my imagination. I change the construction, make improvements, and operate the device entirely in my mind. It is absolutely immaterial to me whether I run my turbine in my thoughts, or test it in my shop. I even note if it is out of balance. There is no difference whatever, the results are the same. In this way I am able to rapidly develop and perfect a conception without touching anything. When I have gone so far as to embody in the invention every possible improvement I can think of and see no fault anywhere, I put into concrete form this final product of my brain. Invariably my device works as I conceived that it should, and the experiment comes out exactly as I planned it.\n\nIn twenty years there has not been a single exception. Why should it be otherwise? Engineering, electrical and mechanical, is positive in results. There is scarcely a subject that cannot be mathematically treated and the effects calculated or the results determined beforehand from the available theoretical and practical data. The carrying out into practice of a crude idea as is being generally done is, I maintain, nothing but a waste of energy, money and time.\n\nMy early affliction had another compensation. The incessant mental exertion developed my powers of observation, and enabled me to discover a truth of great importance. I had noted that the appearance of images was always preceded by actual vision of scenes under peculiar and generally very exceptional conditions, and I was impelled on each occasion to locate the original impulse. After a while this effort grew to be almost automatic, and I gained great facility in connecting cause and effect.\n\nSoon I became aware, to my surprise, that every thought I conceived was suggested by an external impression. Not only this, but all my actions were prompted in a similar way. In the course of time it became perfectly evident to me that I was merely an automaton, endowed with power of movement, responding to the stimuli of the sense organs and thinking and acting accordingly. The practical result of this was the art of ‘telautomatics’, which has been so far carried out only in an imperfect manner. Its latent possibilities will, however, be eventually shown. For years I have been planning self-controlled automata, and I believe that mechanisms can be produced which will act as if possessed of reason, to a limited degree, and will create a revolution in many commercial and industrial enterprises.\n\nI was about twelve years old when I first succeeded in banishing an image from my vision by willful effort, but I never had any control over the flashes of light to which I have referred. They were, perhaps, my strangest experience, and were inexplicable. They usually occurred when I found myself in a dangerous or distressing situation, or when I was greatly exhilarated. In some instances I have seen all the air around me filled with tongues of living flame. Their intensity, instead of diminishing, increased with time and attained a maximum when I was about 25 years old.\n\nWhile in Paris, in 1883, a prominent French manufacturer sent me an invitation to a shooting expedition, which I accepted. I had been long confined to the factory, and the fresh air had a wonderfully invigorating effect on me. On my return to the city that night, I felt as though my brain had caught fire. I saw a light as though a small sun was located in it, and I spent the whole night applying cold compresses to my tortured head. Finally the flashes diminished in frequency and strength, but it took more than three weeks before they subsided entirely. When a second invitation was extended to me, my answer was an emphatic ‘no’!\n\nThese luminous phenomena still manifest themselves from time to time, for example when a new idea opening up possibilities strikes me, but they are no longer exciting, being of relatively small intensity. When I close my eyes, I invariably observe first a background of very dark and uniform blue, not unlike the sky on a clear but starless night.\n\nIn a few seconds, this field becomes animated with innumerable scintillating flakes of green, arranged in several layers and advancing towards me. Then there appears, to the right, a beautiful pattern of two systems of parallel and closely spaced lines, at right angles to one another, in all sorts of colors with yellow-green and gold predominating.\n\nImmediately thereafter, the lines grow brighter and the whole is thickly sprinkled with dots of twinkling light. This picture moves slowly across my field of vision, and in about ten seconds vanishes to the left, leaving behind a ground of rather unpleasant and inert grey which quickly gives way to a billowing sea of clouds, seemingly trying to mould themselves into living shapes. It is curious that I cannot project a form into this grey until the second phase is reached.\n\nWithout fail, before falling asleep, images of people or objects flit before my view. When I see them, I know that I am about to lose consciousness. If they are absent and refuse to come, it means a sleepless night!\n\nTo what an extent imagination played a part in my early life, I may illustrate with another odd experience. Like most children I was fond of jumping, and developed an intense desire to support myself in the air. Occasionally a strong wind richly charged with oxygen blew from the mountains, rendering my body as light as cork, and then I would leap and float in space for a long time. It was a delightful sensation and my disappointment was keen when later I undeceived myself.\n\nDuring that period I contracted many strange likes, dislikes and habits, some of which I can trace to external impressions, while others are unaccountable. I had a violent aversion to the earrings of women, but other ornaments, such as bracelets, pleased me more or less according to design. The sight of a pearl would almost give me a fit, but I was fascinated with the glitter of crystals, or objects with sharp edges and plane surfaces. I would not touch the hair of other people except, perhaps, at the point of a revolver. I would get a fever by looking at a peach, and if a piece of camphor was anywhere in the house it caused me the keenest discomfort.\n\nEven now I am not insensible to some of these upsetting impulses. When I drop little squares of paper in a dish filled with liquid, I always sense a peculiar and awful taste in my mouth. I counted my steps in my walks and calculated the cubical contents of soup plates, coffee cups and pieces of food — otherwise my meal was unenjoyable. All repeated acts or operations I performed had to be divisible by three, and if I missed, I felt impelled to do it all over again, even if it took hours.\n\nUp to the age of eight years, my character was weak and vacillating. I had neither the courage nor strength to form a firm resolve. My feelings came in waves and surges, and vibrated unceasingly between extremes. My wishes were of all-consuming power, and like the heads of the hydra, they multiplied. I was oppressed by thoughts of pain in life, of death, and religious fear. I was swayed by superstitious belief and lived in constant dread of spirits of evil, of ghosts and ogres and other unholy monsters of the dark.\n\nThen, all at once, there came a tremendous change which altered the course of my whole existence.\n\nOf all things, I liked books the best. My father had a large library, and whenever I could manage to, I tried to satisfy my passion for reading. He did not permit it, and would fly into a rage when he caught me in the act. He hid the candles when he found that I was reading in secret — he did not want me to spoil my eyes. But I obtained tallow, made the wicking and cast the sticks into tin forms, and every night I would cover the keyhole and the cracks in the door and read, often till dawn, when the rest of the family slept and my mother started on her daily tasks.\n\nOn one occasion, I came across a novel entitled Abafi (The Son of Aba), a Serbian translation of a well known Hungarian writer, Josika. This work somehow awakened my dormant powers of will, and I began to practice self-control. At first, my resolutions faded like snow in April, but soon I conquered my weakness, and felt a pleasure I never knew before — that of doing as I willed. In the course of time, this vigorous mental exercise became second nature to me. At the outset, my wishes had to be subdued, but gradually desire and will grew to be identical. After years of such discipline, I gained so complete a mastery over myself that I toyed with passions which have meant destruction to some of the strongest men.\n\nAt a certain age I contracted a mania for gambling, which greatly worried my parents. To sit down to a game of cards was for me the quintessence of pleasure. My father led an exemplary life, and could not excuse the senseless waste of time and money in which I indulged. I had a strong resolve, but my philosophy was bad. I would say to him, “I can stop whenever I please, but is it worthwhile to give up that which I would purchase with the joys of Paradise?”\n\nOn frequent occasions he gave vent to his anger and contempt, but my mother was different. She understood the character of men, and knew that one’s salvation could only be brought about through his own efforts. One afternoon, I remember, when I had lost all my money and was craving for a game, she came to me with a roll of bills and said, “Go and enjoy yourself. The sooner you lose all we possess, the better it will be. I know that you will get over it.” She was right. I conquered my passion then and there, and only regretted that it had not been a hundred times as strong.\n\nI not only vanquished but tore it from my heart so as not to leave even a trace of desire. Ever since that time I have been as indifferent to any form of gambling as to picking teeth.\n\nDuring another period I smoked excessively, threatening to ruin my health. Then my will asserted itself and I not only stopped, but destroyed all inclination. Long ago I suffered from heart trouble, until I discovered that it was due to the innocent cup of coffee I consumed every morning. I discontinued at once, though I confess it was not an easy task. In this way I checked and bridled other habits and passions, and have not only preserved my life but derived an immense amount of satisfaction from what most men would consider privation and sacrifice.\n\nFor more, see the Nikola Tesla page on Caterpillar.ink."
    }
]