[
    {
        "url": "https://medium.com/@TheHowAndTheWhy/notes-on-artificial-intelligence-equine-metaphors-civic-morale-infinite-games-bfe8dfd6e39e?source=tag_archive---------0----------------", 
        "text": "In the blue corner, humanity. In the red corner, machines.\n\nThe dubious wisdom of invoking this spirit of competition as a symbolic exercise. Contesting games which equate movement with a claim on the available space.\n\nThe danger that this confrontational dynamic becomes embedded in routines, prompting a formulaic antagonism. A lesson learned — in the way of most precedents — influencing the ways in which calculus is flexed.\n\nLikewise the Turing test as an objective aspiration. One that privileges systemic deception. Promising monumental kudos for an elaborate long con.\n\nAre there not better milestones to be conceived of on this journey — far less likely to become technical debts? Ways of canvassing help instead of conscripting algorithms to do a number on human comprehension. Relational precepts that put a value on communing with AI from the outset to the greatest possible extent.\n\nThere is no dignity to competition unless the outcome is in doubt and we are fast reaching the age of foregone conclusions in relation to finite, turn based games (where “intuition”, for all of its vagaries, is irreducibly task-based).\n\nFor which reason it seems inadvisable to roll out successive big hitters to champion humankind.\n\nNot only does this inflict grave wounds on the psyche of the vanquished gamer, but beyond her shattered pride, it’s worth considering the wider societal implications as these start to bleed out.\n\nNot least that we start to think of ourselves as former contenders, fatally unmasked as a race. Resulting in a punch-drunk populace which considers itself smacked down.\n\nThis has serious implications for civic morale. Especially at a time when we have so little faith left in authorities, leaders, institutions of every stripe.\n\nIn such a world our last redoubt is often the self. Our ability to look upon it kindly, credit it with promise, and tell it stories that make it want to go on.\n\nIt is the aggregate of these stories which enables society to go on also.\n\nDispel these baseline enchantments and the stories become nihilistic, darkly grand, and painfully substantive. So much so that they give birth to stampeding narratives which see red everywhere, in nearly everything, and demonstrate a propensity to gore.\n\nThis much we know already.\n\nOne way to subvert this defeatism would be to overhaul the fundamental benchmarks of what it means to be human. Those which we set great store by and put a premium on.\n\nMore importantly, those which enable us to exist — financially and materially — in the world at large.\n\nThis would involve retiring a number of risible metrics — including those which find us in competition with specialized technologies — and accept that we are greatly disadvantaged by having a life.\n\nOne sound measurement, moving forwards — how and why we should seek to excel.\n\nAll of the above would require a keener understanding of the difference between growth and stature.\n\nThe next few decades for humanity will be largely about knowing when to quit gracefully and how exactly to regroup.\n\nHuman productivity, as one of the salaried virtues, is fast becoming a busted flush at a systemic level. And looking forward, we can no more hope to outproduce artificial intelligence (or out-navigate it for that matter) than we can expect to trump it at chess.\n\nIn such a world we’ll need to acknowledge that being is a form of occupational leisure, and that the pursuit of this leisure becomes more and more of a responsibility if our existential needs are met.\n\nThere is a decent future in having this fact writ-large and better understood\n\nPerhaps the single greatest failing of the tech industry over the last thirty years — trumpeting creativity without inciting it in earnest.\n\nA kindly observer would say they were waiting for Moore’s law to catch up.\n\nA critic would say this same failure was predicated on a woeful misunderstanding of what creativity entails, and how satisfaction is to be had from it, and to what extent this satisfaction depends on mastery at source.\n\nA cynic would say this was because they were perfectly aware that great fortunes could be built on largely idle aspirations.\n\nBut in a world where the supply of content and artifacts far exceeds peoples’ ability to appreciate them, the major return on investment for our own creations — exchanged for time and energy — has to be recognized as mental flow.\n\nIt’s for this reason we do not need technology to condense the ten thousand hour rule — less yet, consider it redundant — but rather to expand upon the time spent.\n\nThis need becomes even more pronounced if we are to be relieved of ever more functions.\n\nSimilarly, in the longer run, it will prove necessary to remove ourselves to infinite games.\n\nThe H-Metaphor proposes that we view our interactions with systems as being consistent with the relationship between horse and rider. Each ceding control to the other at the appropriate moment as dictated by underlying circumstance and terrain.\n\nThis seems too staid and static as analogies go, at least at a macro level.\n\nBetter to say we have mounted a horse while trying to turn it into a centaur with the vague idea of ridesharing the century ahead.\n\nIdeally then we should be developing a pronounced ability to humour one another — us two thought patterns — joint custodians of the material facts.\n\nWhich is why we’ll need a buddy system blessed with magnificent resilience.\n\nWhich is why we’ll need the ability to reverse engineer verbs.", 
        "title": "Notes on Artificial Intelligence, Equine Metaphors, Civic Morale & Infinite Games"
    }, 
    {
        "url": "https://medium.com/@brucerobbins/i-agree-with-your-points-and-as-the-full-version-of-my-recent-medium-post-mentions-d45bea3764ab?source=tag_archive---------1----------------", 
        "text": "I agree with the point that there is a need to test an “end-to-end set of business functions that a system contains” and that these should be “conducted repeatedly only to ensure that the expected behaviour of the system remains stable”. Aside from having a good set of automated testing tools to run regression tests it is worth looking at tools to improve the testing strategy.\n\nCommenting on the role of machine learning in software production, in another post, I point out to a good example of how Google engineers use machine learning in in test strategies. Explained by Alek Icev, Test Engineering Manager this example is interesting because it looks at using machine learning to improve the algorithm used by the search code. As Icev points out, in “the real online world where we want to give answers (predictions) to our users in milliseconds and ask the question how are we going to design automated tests … embedded into a live online prediction system. The environment is pretty agile and dynamic, the code is being changed every hour, you want your tests to run on 24/7 basis …”\n\nI believe that the possibilities to utilise machine learning and deep learning as a part of the test process will influence agile significantly.", 
        "title": "A step beyond automated regression testing. – Bruce Robbins –"
    }
]