[
    {
        "url": "https://medium.com/@srikanthsiyer.web/machine-desi-hip-hop-a-fun-transliteration-experiment-with-rnn-2c2e143e5dae?source=tag_archive---------0----------------", 
        "text": "There has been a lot exciting developments on the use of Recurrent Neural Networks lately. After Andrej Karpathy’s post on the Unreasonable effectiveness of RNNs and a lot of cool experiments followed. Some of which are: TEDRnn, Find Your Dream Job , RNN Bible, DrumpfRNN. All of them make use of LSTM, a special kind of RNN that enables to connect previous information to the present task even in situations where gap between relevant information and place of prediction is large. You can find more about LSTMs in these amazing blogs written by Christopher Olah & Nikhil Buduma.\n\nI was aware that LSTM is pretty popular for generating text that sounded grammatically accurate albeit less meaningful. This made me wonder, would this be any good for transliteration? I had to scratch the itch. Having been heavily influenced by Bollywood, a monkey in my head wanted to try testing it with Desi Hip-Hop party songs. Probably because it thinks most of the lyrics are meaningless anyways. Will non-native speakers figure out if it is gibberish right away? May be not.\n\nTransliteration is conversion of a text from one script to another. For instance, the English transliteration of Hindi term ‘नमस्ते’ is ‘NAMASTE’, while its translation is ‘HELLO’.\n\nI managed to scrape just above 100 song lyrics transliterated in English by various bollywood hip-hop artists. The data consists of only about 157000 characters (certainly not a huge data-set). In case you are not very familiar with this genre of songs, most of them although written in Hindi are swayed by Punjabi with many English terms creeping in every now and then.\n\nThe model generates lyrics by predicting one character after the other and this is where LSTM’s long term context memory comes into play. This LSTM model was built using Keras with theano in the backend. I rented an Amazon’s AWS GPU based g2x instance (using grid K520) and ran about 120 iterations on the data that ran approximately for about 6 hours. I did try running the algorithm on my local machine with 4 cores and compared the time taken for each epoch . It was approximately 10 times slower than GPU.\n\nI set the seed text (required to start text generation) to something like “Ish your boy Ierr”, hoping that it will pickup some rapper’s pattern and generate something interesting. The model started learning and for each iteration it generated a lyrics, character by character. I ignored the first few iterations since it was undecipherable. I waited and checked the outputs after 30 iterations, then 60 and then 100, only to find garbage text that sounded close to no language. I began to wonder if lstm is really not that good for transliteration or was it me doing something funny.\n\nSure enough, it was the latter case. It was realized that the seed given to the model contained only English words and that the already sparse training data mainly consisted of Hindi/Punjabi words and very few English terms. I decided to give it one more try with randomly chosen seed (of 20 characters) from the training data. As expected, the first few iterations had results like:\n\nI checked up the results after the 10th iteration, still nothing very distinctly seemed like Hindi. It was the 19th iteration when I could see a ray of hope. The text did sound very much like a Hindi/Punjabi sentence and as expected it made absolutely no sense.\n\nAs the iterations progressed it sounded like what was intended. But as it was noticed earlier, for iterations with seed terms that extensively contained English terms, the words in the lyrics generated were difficult to read. The outputs of all the iterations could be found here .Having seen the results and considering the fact that this was run on a scanty-dataset, it would be reasonable to say that LSTM could very well be utilized for transliteration problems.\n\nThe generated set of lyrics were taken one step further. Few rhyming couplets(aabb and abab form) were randomly chosen and manually ordered. I now had a Machine generated Desi-Hip Hop song lyrics ready. To do justice to the lyrics, I collaborated with some talented people and came up with a Desi-Hip Hop music video. Don’t understand the lyrics? Don’t panic, Nobody does…!", 
        "title": "Machine Desi Hip Hop: A Fun Transliteration Experiment with RNN"
    }, 
    {
        "url": "https://medium.com/@karmel_a/guess-1f72888001fd?source=tag_archive---------2----------------", 
        "text": "guess what is the use and the name and me of a world\n\nwhat the world has been done\n\nthe same\n\ni would make my life in\n\nand the old man was sitting and the door is shut in\n\ni know not the wind and rain that is blown away from the sea\n\nbut it seems not a thing to do not but to see me again and to be my\n\nauthor george gordon\n\ngender male with an universal air of song\n\ni am a fool of the days of the\n\nwho is my love in his grave and my wife and his daughter\n\ni do for my life and his friend\n\nauthor robert william wordsworth p gregory or other\n\nthe old time of that hour\n\nthe time was finished\n\ni thought it was that day\n\nand when it reached\n\nbut the one that made the man of old old men of old days\n\nthat the world would have no better time and place than he was born to know it and i knew\n\nhe was as the man that is so much and more a woman than the world is very fair to see her\n\nhe knows what she does for ever love\n\nand he who loves not her to her and she does her love but when the world was young with love that he has not one time of life and love he is to himself\n\nand when she was born of his heart that was the love he made him of all that was not so\n\nauthor george gordon edward fitzgerald davis and woolsey\n\nin a song that i may be the only time of\n\nthe sun\n\ni have seen no one with me i am\n\ni have been my love of love to know\n\nbut the world is not for\n\nthe love of my heart\n\nand the wind\n\nthat blows not as if to be\n\nto be found by my side and my love of mine\n\nand the love which my spirit had done in\n\nto love that i should not know it\n\ni am glad\n\ni love that my love of my life is a love\n\nand of all the life and my spirit i am glad and true to thee\n\nauthor thomas moore scott\n\nthe time to come with the sun of heaven when the light has made\n\nand i shall not be the other\n\nfor the world was to me to morrow i\n\nand when in a moment we wandered to meet it\n\nthe sun of our life and a moment\n\nthe sun lit star of his love that shone out in light lit skies in a moment and\n\nand the sun was lit and we gazed and we\n\nDeep Gimble I is a proof-of-concept Recurrent Neural Net, minimally trained on public domain poetry and seeded with a single word.", 
        "title": "Guess – Karmel –"
    }
]