[
    {
        "url": "https://medium.com/adappt-ai/why-and-how-we-are-putting-artificial-intelligence-into-mobile-insight-apps-9f0d105a9955?source=tag_archive---------0----------------", 
        "text": "Why would we want to put Neural Networks in Mobile Apps\n\nThis is perhaps the most important question. As part of our day to day job, we filter roughly half a billion media items a day down to a few thousand, and those data streams are used to supply insights about risk, effectiveness, reputation and opportunity.\n\nIf we can supply five useful pieces of information to each user every day we would consider that a job well done, but five is a very arbitrary number and the reality is more about the ratio of useful information to relevant information that is most important.\n\nBack to an old adage content is everything, and by content we mean quality of content.\n\nLet’s consider some of the markers that help make information relevant:\n\nNot dissimilar to a complex chemical process, we use a variety of filters and interlinking operations to refine the data from a torrent down to a few drops.\n\nNeural Networks are capable of doing work that we might typically associate with humans and one of those tasks is figuring out what we might like based on our actions.\n\nWe have been using Neural Nets in our main platform for a while now. The prime use of that has been to strip away background noise and help us baseline. In the world of Neural Networks there are two schools of thought\n\nMassively powerful is generally achieved with re-purposed graphics processors capable of setting up huge data arrays that are incredibly fast to work with. This is the same technology that Bitcoin miners leverage in the hunt for evermore scarce and lucrative bitcoins.\n\nThe distributed model is nowhere near as powerful and necessitates a scalpel vs brute force, but it has one advantage, it is highly deployable and highly connected. By using ES 6 and Node.js to build our networks we have a base that can run on pretty much anything from smart watches and Internet of Things to mainstream servers.\n\n“But mobile apps based on JS are clunky aren’t they?” Yes they can be and we do prefer to build native mobile apps. Here again we have the open source community to the rescue. By using the React project to embed IO.js libraries into a native app we have the best of both worlds.\n\nIn truth technology is just at the beginning of this journey. The internet is by its nature distributed and has proved incredibly resilient and powerful because of that. As the Internet of Things expands, embedding a Neural Networks within layers of a network connected to data across the globe, we should be able to find the answers to questions far more quickly. In truth like pieces of a jigsaw puzzle, the answers to many questions we are asking are already out there, but currently we struggle to join the dots. Neural Networks embedded into the Internet of Things can give us one solution to this.", 
        "title": "Artificial Intelligence into Mobile Insight Apps : The ‘Whys’ and ‘Hows’"
    }
]