[
    {
        "url": "https://medium.com/frianbiz/comment-%C3%A7a-marche-le-machine-learning-5a5a3ec299ea?source=tag_archive---------0----------------", 
        "text": "Vous disposez donc d’un énorme jeu de données et d’une multitude de façons de les regrouper : par genre (hip-hop, classique, rock…) par auteur, par période, etc. Pour être plus efficace qu’un simple algorithme de “matching” nous allons laisser le système trouver seul des caractéristiques communes à partir d’un très grand volume de données. L’exemple fourni par Wikipedia pour illustrer un apprentissage non supervisé est assez parlant:\n\nPour copier notre très bonne capacité associative, l’algorithme K-means utilise une stratégie de machine learning: On place de manière aléatoire 2 points (x rouge et x bleu) (étape b), on découpe le nuage de points en 2 groupes en suivant cette règle: Tous les points qui sont les plus proches de la croix rouge sont colorés en rouge et tous ceux qui sont plus proches de croix bleue sont colorés en bleu (étape c). À ce stade, le résultat n’est pas top, on va déplacer nos 2 croix au centre de gravité de chaque groupe de couleurs (étape d). On répète l’opération, répartir les points entre chaque croix (étape d), replacer nos croix (étape e) jusqu’à l’obtention d’une convergence, c’est à dire une stabilisation des centres (l’algorithme a cessé de s’améliorer) (Cette video explique très bien la méthode)\n\nPour revenir à notre mission imaginaire chez Spotify, une bonne stratégie pourrait être de proposer à un nouvel utilisateur du cluster “pitchounette”, des titres qui fonctionnent très bien avec la population à laquelle elle appartient. Ensuite tout est une question de dosage et d’ajustement du poids (= l’importance) qu’on donne aux critères. Il faut croiser minutieusement les résultats de milliers de critères issus de ces classes et c’est là que ça devient très complexe… On peut s’appuyer sur des spécialistes de la musiques, sur des analyses acoustiques, sur un historique de navigation, sur les écoutes récentes, récurrentes, etc… Plus on a de data (90% des données dans le monde ont été générées ces 2 dernières années selon IBM) et plus on maitrise le domaine qu’on analyse (Google pour l’information, Netflix pour les films, …) plus on arrive à faire de bonnes prédictions.\n\nEt enfin, grâce au machine learning (et plus précisément au deep learning), l’intelligence artificielle de Google est devenue quasiment imbattable au Pictionary en quelques jours seulement… Heureusement que Google organise l’information du monde en toute neutralité, sinon tout ça deviendrait inquiétant ;)", 
        "title": "Comment ça marche le Machine Learning ? – Frianbiz –"
    }, 
    {
        "url": "https://medium.com/@mslavescu/amazing-list-of-deep-learning-projects-63d78639b6ac?source=tag_archive---------1----------------", 
        "text": "Can’t wait to try most of them.\n\nThe Youtube-8M Dataset is probably the most important contribution for self driving car (SDC) development, and it will help a lot the open source SDC community, the top third category being auto vehicles.\n\nThe optimizations that Google team put in place are critical going forward, and we should try to follow their approach in the open source SDC, as we will collect a lot of datasets across the globe in all kind of situations.", 
        "title": "Amazing list of deep learning projects! – Marius Slavescu –"
    }, 
    {
        "url": "https://medium.com/@trevorcornwell/ai-deep-writing-done-on-my-computer-c7fc285f167d?source=tag_archive---------2----------------", 
        "text": "This was an experiment with more help than one could ask for. Max Deutsch took the time to assemble the pieces and give play by play instruction. Taylor Robinson came to the rescue as a kindler, gentler House and unspooled the hiccups that came about as new version and old versions of software decided on who would go first while vying for kicking out what were to me more indecipherable error messages, but to him key forensic tips.\n\nThe challenge was to train my computer to study the writing on John Le Carre and to do as it has done for Shakespeare and others, learn to write like him.\n\nThe underlying work was done by Sung Kim of Hong Kong University of Science and Technology. His code made my computer feel what my bank would feel if I won the lottery. That my MacBook battery was draining at a rate that normally would have warranted a 911 visit to The Apple Store meant good things: the training had begun.\n\nThat these gifts exist and they are shared freely so that others can learn and contribute and better the science is nothing short of extraordinary. So my contribution is the output of Le Carre extrapolated from training done on Tinker Tailor Soldier Spy. This is the machine deep writing mimicking the learnings of one book, in one night.\n\nHere is the result.\n\nblaring top of by newspaper of that the compliment of the open few dear, for an impression of unsolicited too,’ said his story went till for furtive, but then he accepted from comparisons, seen it more than she needed a word on Brno. I must blame a trained dotty, who he not? ‘Which I said so.’ Not a four guy of far surveillance Lacon overseas. Ivlov I’m three like Miss games. Where no, I need seen them down the corridor. According anything down that Roy Bland was inclined to finish a hunch? ‘No mothers, come a knighthood, of Bywater Street on his case came to go back between it and all.’ The kid was a Circus because we had become with them. ‘He’s just surprised,’ said Sam. ‘He had a dash of night. He has put her that than he had not waiting on the door over them records. He was still theoretically with times after luxuries Their premises. I got too fixed. Pewtery, Control used a sidelines. ‘I hadn’t heard Mac out of it. They would have been Stubbs. CHAPTER failures brogue wasn’t.’ Right, is now as he dug. are himself to kind of pedestrians Thursgood found bothered it, he had a little nineteen. One of Thursgood’s hand he saw the wrong trade game.’ morning proposed there agreed, George?’ With losing every words. He had got quite sure to discuss out of members of the table from its recent hand the secretary he had to wait up on and Esterhase in once was bored. ‘She enquired. ‘What does Toby told already to work, ‘Reason lounging did, staring down the clusters of other appointments of the grunt of a Foreign Office job. I was out of Camilla and always imagined they send a Rhino though it might have reported a shilling to mingle. of the satellite Minister and I don’t tell him it? ‘For me, thank me. Well, he wished loudly. I’ll really think I pinched “Yes can possibly broken. ‘See Tarr is already meaningless bulletin was rumbling. In gentleness for fresh football bad season and he had no Street for his eyes was the Russians killed blessed Declining a silver back and I’ve even forbidden me to remember now at you. I took the Party officer these was, Mr good near it. Someone gave he?’ said interesting silent Smiley muttered. ‘Lacon.’ 1 surveying me about bare often he continued the listeners and a bonus. What Max went, they got again, ‘no’, sure that he stick. But not flying, since Alleline, thinking I thought: Under the gun in Whitehall and better. George,’ was new with other 21st. And set half funny was empty. Connie Hebden, George. ‘Oh when him your mouth match that bulged with fleshy for my Testify he was splashed level and small Centre, the way he had handed the question between a monthly mild with the Testify side. He was often quite talking to you.” ‘Listen, he had known it should do a lamplighters things Prideaux, as sudden death; Smiley was to recognise that the pick of the odd brown pen, that first were screaming and he never Lower-class string to Berne for day or for no sense of approaching anti-climax and paid you waiting like the canal. ‘Attaboy, Jumbo. Trench. He her wee point. Straight Dolphin’s very routine returned, spent a hangover from it and the fake muskets on the coloured clerk and wrong, it didn’t in I was still looking typists or probably unreliable, and were for no possible or giving its pressing records for the path of all the lock alive, genuine, in them in KL isn’t him so forth measuring he never stopped, under a small confusion echoing across the car. ‘I used Lacon to put a evening then and the ‘Where everyone George, else it’s a firebowl of charitable enterprise. ‘I’m far in Camilla and chalk and any was on an extraordinary collar was offended and raised available on night, and chasing up so spiel but in course. They would guess Mr Stroll lay in the operation two Lacon had already argue and the fourth floor and a Scenes of them begin at the chimney stack. Prideaux.] ‘You don’t go around how she had the more gliding into one side. ‘Why must be the smokescreen he said politely. ‘He’s only the safety nod. ‘And if he have a word or he had just known everything before Jim called her finger and couldn’t. In Czecho, said Guillam. ‘ ‘Maybe Smiley didn’t speak, I were none. Suddenly Lacon beckoned it came him completely. ‘I refuse to have “If telling well damn special? uniform so the bells, were whom she had loved her hands, ever. Too caustic warning,’ I Alleline. ‘Did that say we are united side Lacon was not nervous. ‘I hear everything he knew that little like a convulsive presence: too one, as the blood tipped him. I noticed you at least I’ll sing. Did now function: in due that already. At being a big reading lamp, a name of one: it round the switch housekeeper, arrive, and Haydon’s work, switched to Guillam, for himself instead of Mother of Testify and passed them handily comparison. If he called it, and he would run the word, he said. ‘I must have been acting cooled off — strictly, the Soviet summer city, red words. He took me with a bus.’ ‘Oh sir.’ ‘Foxy pew typists. officers direct subsidies’, were selected more because she was the listeners. For Toby at night the reconnaissance of that Connie. Half a jolly chunk of sweat and taken the tram up and dialled a hope where he had little blank for the next memory and the nurses might guess that take and a tiny men: Ann was stamping on the parquet; up that watched them open. Sam grinned ahead. ‘London moment but he said; the athlete, typewritten. to make for three years in Paris. I agreed Toby Esterhase was not of no big end. ‘Oh right, Bland was proposing to think she was saying, ‘we Jumbo, please, I were not absent but before the canal pretending to call them to the white figure of the sky and seems to grammar making these days?’ and made a bit of fun with Lauder Strickland’s distracted side of pale voice. ‘For God’s sake George, they were disturbed?’ Control had not a machine: minute to him height. there I’m almost an inspiration to Smiley’s host to find your story. As they looked through to Taunton touch or then, then all while I say?’ hadn’t gave a man down? ‘Oh you know,’ said Jim, as now, dawned on him at them, apparently rank, flowers as one of all onwards. ‘I’m sir, as Guillam’s real gilt “I’m called her fifty tack. “Stevcek was very little. DP will want to use a third quickly, he had a talent in a form of a Chinese folder, appeared like a woman phone Inspector Porteous Lacon later all.’ He had conveyed according to some wife: the posture-curve cushion seen it the stairwell. He who was a big general against the television floor, the grin of a day and Jim loved the way for it. He should ordered him Bill?’ could not drop to find whether they had no one over to Wellingtons at the corridor or very extraordinary answer he had spoken to letting anything sullenly. Yes, is all each times because take-off. And it Toby, else was fixed, for Karla’s sake.’ Might sir. I worked over his radio one. If they drove already for all.’ He had grown none Then for family more Esterhase — worse, said the time. As Bill ill-at-ease, parents famous earlier, Before the sweat like a piece of case before it called it later Dublin-Orly Tarr continued, who went over outwards on the Nursery. and, damn nineteen either, and his mother you used a sip of corridors and staircases to the underground were all the crucial barn concentration. The comparison is usually people in favour of the point, flung the easy fire and they waited over the moonlit air. His boy seemed to be expert between them, and there were a piece of sight among Racice. He seemed to one,’ Guillam asked, in Lacon. It was gone. He had replied, or a great slab of power, or turned to London, else. and fixed on your state to know: they should sleep all by Tarr’s head, took with the neck. ‘No young red leather since Tarr. Did we methods Jim conceded, they who is too much so Haydon was asleep. CHAPTER THIRTY-THREE Smiley led down the Rolls-Royce any Haydon had settled as the whole bell had a bit of love-talk. A few really, sauntered back with satellites.’ ‘I’m recently visiting a mole. At that she was currently the Circus’s residencies — asks nothing to him for sale. In the Minister’s Rolls, the thinker from a couple of effort as I could feel there, in the same wavelength, my man’s reached on it.’ ‘Too Viktorov including favourite Kong", 
        "title": "AI, Deep Writing, Done On My Computer – Trevor Cornwell –"
    }, 
    {
        "url": "https://medium.com/@narayana.anantharaman/post-demonetization-in-india-how-do-the-banks-perform-6f9464e8b06d?source=tag_archive---------3----------------", 
        "text": "With the recent demonetization initiative in India where currency of higher denominations became invalid, banks scaled up to handle huge demand from customers for cash transactions and deposits. Given the current scenario there have been a large number of customer complaints and also several instances of goodwill shared by customers with the banks, complimenting them for the great service. The key question is, can we automatically analyze this feedback and use them to improve the service?\n\nText categorization of tweets is a challenging problem. This is due to several reasons that include:\n\nThe above is a small sampling of the real challenges! Due to such a nature of tweets analysis, even the industry grade products that perform sentiment characterization have only a limited accuracy.\n\nOur intention is to apply the cutting edge techniques we developed in to performing this complex task and accomplish a decent degree of accuracy. The demo is hosted at: http://jnresearchlabs.com:9027/# . This demo showcases our innovative technique that performs high accuracy text categorization.\n\nThe Table 1 shows the performance of banks as analyzed based on customer tweets. The tweets are categorized as (Displeasure, Miscellaneous, Compliment) and each tweet is assigned a weight of (0, 5, 10). The performance index is computed as the weighted sum.\n\nThe Table 2 shows the actual tweets (refreshed every 3 mins) and the categorization.\n\nThis is intended as a basic demo, I might add a few more graphics (such as trend graphs, heat maps etc) later. Please do have a look :)", 
        "title": "Post Demonetization in India: How do the banks perform?"
    }, 
    {
        "url": "https://medium.com/@VentureScanner/artificial-intelligence-startup-landscape-trends-and-insights-q4-2016-4668ee790f3d?source=tag_archive---------4----------------", 
        "text": "A presentation deck providing an overview of the Artificial Intelligence startup landscape, graphical trends and insights, and recent funding and exit events. You can see this post on our blog at http://www.venturescanner.com/blog/2016/artificial-intelligence-startup-landscape-trends-and-insights-q4-2016\n\nWe are currently tracking 1500 Artificial Intelligence companies in 13 categories across 73 countries, with a total of $9.1 Billion in funding. Click here to learn more about the full Artificial Intelligence landscape report and database.", 
        "title": "Artificial Intelligence Startup Landscape Trends and Insights — Q4 2016"
    }, 
    {
        "url": "https://medium.com/@larschristian/deep-learning-and-music-recommendations-179a3d43a767?source=tag_archive---------5----------------", 
        "text": "Music is one of the constants in my life, and it has been for as long as I can remember. I play, and sometimes make, music, but more than anything else I listen to music.\n\nI listen to music when I work, when I travel, when I read. The soundtrack makes or breaks the experience for me when watching shows and movies. The highlight of watching a new episode of The O.C. more than a decade back was checking out the bands that were featured, and I am convinced that the magic of both Wes Anderson‘s movies is the way the soundtrack perfectly compliments the aesthetics and the characters. And I was severely emotionally impacted with two very different movies pretty much because they both accompanied their dramatic peaks with Brian Eno’s 3 minutes and 2 seconds of sonic perfection titled The Big Ship.\n\nListening to music is very important to me, and I have spent days and months tracking down new and interesting music since the turn of the century. I even started a (now defunct) blog to share my discoveries, with my primary motivation being the hope of getting people to send me their music. It worked very well, but before long I found myself listening to too much music that was too far removed from my musical taste, so I stopped doing it.\n\nThe past year or so, though, I’ve pretty much stopped looking for new music. Not because I don’t want to listen to new music, but because Spotify absolutely nailed it. From what I can tell, they have perfectly profiled my musical preferences down to my favourite guitar licks and chord-progressions. What’s more, they use that knowledge to tailor make me my very own playlist, every single week. And as of late, they give me up to six fresh, never-ending playlists every single day. And to top it off, they throw me a personalised playlist with just new music they think I’ll like on a weekly basis as well.\n\nSo now I spend less time looking for new music, and more time listening to music, and it feels like it is enabled by magic.\n\nInspired by this priceless assistant for musical discovery that was mine for less than 10 bucks per month, I set out to learn more about what this magic was. And, while I follow too many tech people and publications online not to have picked up on the current wave of AI and Machine Learning hysteria doing the rounds, reading about how it was applied to something so close to my heart made a difference. It took the concepts from the abstract to the concrete for me, and I thought I’d share some of the articles that fascinated me the most.\n\nRecommending music on Spotify with deep learning by then Spotify intern Sander Dieleman really helped me understand some of the core concepts of deep learning, even if a lot of the technical stuff went right over my head.\n\nThe magic that makes Spotify Discovery Weekly’s playlists so damn good is a nice introduction to how what goes on in the background to enable the creation of your perfectly crafted weekly playlist.\n\nThe blog of Erik Bernhardsson, the former head of Spotify’s machine learning division, explores a lot of interesting concepts related to the topic.\n\nThis introduction to how machine learning has impacted something so relevant for me has really made me interested in learning more about it, how it works and how it will shape our world in the future. So in the coming months I hope to read much more about the subject. If you have any suggested reads, be sure to leave a reply. I’m hoping to find sources that explain the concepts in layman’s terms :)", 
        "title": "Deep Learning and Music Recommendations – Lars-Christian –"
    }, 
    {
        "url": "https://medium.com/@junpenglao/thanks-for-the-reply-3f9cb264c25b?source=tag_archive---------6----------------", 
        "text": "Thanks for the reply! I am also planning to read How to Build a Brain. I had Nengo and BRAIN installed but haven’t got time to play with them yet.\n\nThis is completely my personal take. There are many interesting references of the brain under the framework of complex system and Chao theory[1][2][3][4], but I don’t realize there is any similar analysis on DL under the same framework. Until there are some better theories (than the current ones) of the principle of neural computation, any comparisons will likely be somewhat superficial.\n\nAs for the quantum mechanics part, I completely agree with you — although it is always fun to flirt with the idea. You might also find it amusing that someone suggests DL works so well b/c it follows the principle of the universe.", 
        "title": "Thanks for the reply! – Junpeng Lao –"
    }
]