[
    {
        "url": "https://medium.com/@mattvbrady/baby-oliver-cromwell-this-one-i-do-with-my-bare-hands-9871bc47cf7b?source=tag_archive---------0----------------", 
        "text": "Baby Oliver Cromwell: This one I do with my bare hands. I want him to be looking into my eyes when he dies. Sayonara, Lord Protector. The good Catholic citizens of Ireland send their love….\n\nBaby Genghis Khan: The windswept steppe. Two figures emerge from a yurt, a man and a woman. The woman holds a tiny baby swaddled in furs. Zoom out. We are watching the same scene through a sniper’s scope. Suddenly the woman looks directly into the scope, smiles… and throws the baby high into the air! Plot twist! Genghis Khan’s mother is working with me! I pick him off as he tumbles through the air with one shot. Not the hardest target I’ve ever hit… but not the easiest either.\n\nBaby Stalin: I take Baby Stalin to the fair. Imagine a montage of Baby Stalin and I laughing as we eat fairy floss, watch some clowns perform, or I try to hit some targets with a pellet gun to win Baby Stalin the fluffy teddy bear he wants. We end the night of the Ferris Wheel, marvelling at the way the twinkling lights of the town seem to merge with the stars in the sky. At the apex of the Wheel I sigh in contentment, pick up Baby Stalin, and casually hurl him to his death.\n\nBaby Mussolini: Football pass him into the mouth of Mount Vesuvius.\n\nBaby Hitler: The big one. The championship game. Final seconds, no timeouts. Baby Hitler is smart. He’s heard what happened to all his friends. He’s waiting for me in his Baby Bunker… and he’s defended by his Baby Cronies. Baby Goebbels mans a gun turret. Baby Rommel patrols the perimeter in a Baby Tank. I look at their preparations and smile…… from the cockpit of my X-Wing fighter, in the skies far above. They don’t even see me coming. I have the target locked in, thumb poised. I don’t even notice little Baby Goring slip behind me in his Baby Tie-Fighter. The Baby Luftwaffe Commander lines me up with precision. Baby Goring has me in the crosshairs, seconds away from death. When suddenly, he is blasted out of the sky as baby Winston Churchill swoops in! “You’re all clear, kid” Baby Winston Churchill gurgles to me. I take a breath and fire the proton torpedos. It’s a bullseye of course. The Baby Bunker explodes in a ball of flame.\n\nThe word “hero” is overused these days. I’m no hero. I’m just a man willing to do what needs to be done, and kill a whole lot of babies.", 
        "title": "Baby Oliver Cromwell: This one I do with my bare hands."
    }
]