[
    {
        "url": "https://medium.com/udacity/this-week-in-machine-learning-28-october-2016-79bdf69c5134?source=tag_archive---------0----------------", 
        "text": "This week’s top Machine Learning stories, including AI agents that both encrypt and explain themselves, and more!\n\nMachine Learning is one of the most exciting fields in the world. Every week we discover something new, something amazing, something revolutionary. It’s incredible, but it can also be overwhelming. That’s why we created This Week in Machine Learning! Each week we publish a curated list of Machine Learning stories as a resource to help you keep pace with all these exciting developments. New posts will be published here first, and previous posts are archived on the Udacity blog.\n\nWhether you’re currently enrolled in our Machine Learning Nanodegree program, already working in the field, or just pursuing a burgeoning interest in the subject, there will always be something here to inspire you!\n\nUsing deep learning techniques, Google’s Google Brain invents its own encryption methods, even without prior knowledge of any specific cryptographic algorithms.\n\nIBM and Slack team up to use Watson to power new features for the chat service’s popular Slackbot, as well as to make Watson’s capabilities available to more developers.\n\nWearables and machine learning work together in the myCareCentric Epilepsy project, helping researchers and patients investigate the condition with 24/7 data.\n\nResearchers at MIT present a new way that neural networks can be created that not only generate classifications and predictions, but also explanations for their decisions.\n\nThe Nightmare Machine, a collaboration between scientists at MIT’s Media Lab and CSIRO Data61, automatically creates scary versions of famous landmarks and faces.\n\nScientists at Rockefeller University combine human ratings of different chemicals’ odors with machine learning to generate predictions of how other molecules will smell.", 
        "title": "This Week in Machine Learning, 28 October 2016 – Udacity Inc –"
    }, 
    {
        "url": "https://medium.com/@juang294/shortly-after-starting-insightmedi-we-identified-the-value-of-crowdsourcing-a-database-of-medical-5949a0c676a5?source=tag_archive---------1----------------", 
        "text": "Shortly after starting InsightMedi we identified the value of crowdsourcing a database of medical images. It was obvious that even though we started with the idea of building a social platform for healthcare professionals, we could potentially have a real, more direct impact on the quality of the patient outcomes if we could build a dataset large and diverse enough to train machine learning algorithms.\n\nOur strategy for gathering the content — the medical images — was novel in the healthcare world from the get go. Practitioners and students from all over the globe would provide the images through the app, our direct channel of communication with the InsightMedi community. If we could scale our community and create enough value to promote continuous sharing, we might have an interesting formula for unprecedented, low-cost data growth.\n\nTraditional methods for acquiring medical images are extremely expensive and bureaucratic, making it almost impossible for anyone without a massive wallet to even attempt to do this. We knew we had something in our hands that was worth pursuing.\n\nOn December 2015 we held our first (official) annual meeting and we set out our BHAGs for the next 10 t0 30 years. Don’t be fooled by our current size, we’re building InsightMedi to stay. We’re creating a company to innovate and become relevant in the healthcare space.\n\nOne of the goals we set is:\n\nAnd you may wonder what would be the purpose of this? Why would we want to do such a thing and how would it help us make that impact in the quality of care that I mentioned earlier?\n\nOne of the main challenges today for physicians is the increasing number of patients requiring healthcare services. More patients mean more health data to be processed, and a lot more pressure to come up with a diagnosis, always in a short amount of time.\n\nWe envision InsightMedi as a tool beyond the social aspect of the current platform. We want it to become an ever learning diagnosis machine with the capacity to advise physicians accurately, in a short amount of time. We want to create an Assisted Diagnosis Service, accessible to everyone from within our platform.\n\nSo we started drafting a plan to make this possible within the next 5 years. A feasible strategy to build and process the database at scale, and ship a product that puts our newest developments in the hands of our community as fast as possible.\n\nBenefits of this type of service are clear but the challenges might need some serious examination. We’ve been around long enough to know about things like initial skepticism, data jealousy between institutions, image quality issues, platform limitations, costs of infrastructure, and so on.\n\nOn top of all of those mentioned above we have legal implications, IP protection, commercialization rights, multi-organizational agreements, and international regulations.\n\nIt was clear that this was a grand-challenge type of task, especially for a small company like InsightMedi. It was also clear that if we wanted to tackle this challenge we needed help.\n\nThe main two areas where we are in need of support are:\n\nIt is clear that each area brings its own subset of challenges to tackle, but before we got into the details of this we decided to start contacting Research Centers and Universities, to test the overall idea and gather initial impressions.\n\nThe proposal described our approach to solve this puzzle, a collaboration strategy between InsightMedi and those institutions looking to participate, working together to develop algorithms based on Fuzzy Logic and Deep Learning techniques. The goal of those algorithms? To extract and represent knowledge from medical images and thus create a cloud-based diagnosis service.\n\nInitial response could not be better and a key factor was the clear value proposition we were making to everyone with whom we talked.\n\nIf you like you can watch us present this idea at the Isaac Newton Institute for Mathematical Sciences.\n\nA great partnership starts with a complementary skill set and a group of valuable contributions from each side.\n\nUsually, established institutions would provide resources available at Research Centers (eg. Centre for Mathematical Imaging in Healthcare at the University of Cambridge), workforce (developers/researchers), a database of images, its own institutional relationships (eg. Schools of Medicine and Hospitals), and valuable experience at protecting IP and publishing results of all the work developed.\n\nInsightMedi would provide a stable platform that is currently in the hands of thousands of healthcare professionals around the world, its own database of images, its workforce, and partners like Johns Hopkins University, one of our current investors.\n\nThen the synergy obviously comes from taking advantage of each other’s strengths, under a clear collaboration agreement, to tackle a particular problem at a given time (eg., diagnosis of melanoma, heart disease, lung cancer, kidney stones, and more).", 
        "title": "Shortly after starting InsightMedi we identified the value of crowdsourcing a database of medical…"
    }, 
    {
        "url": "https://deephunt.in/deep-hunt-issue-13-32e95dff0b07?source=tag_archive---------2----------------", 
        "text": "One of the founding fathers of the deep learning movement is building a Silicon Valley-style tech incubator for AI.\n\nResearchers from MIT’s Computer Science and Artificial Intelligence Laboratory (CSAIL) have devised a way to train neural networks so that they provide not only predictions and classifications but rationales for their decisions!\n\nMicrosoft has released an updated version of Microsoft Cognitive Toolkit (CNTK), which is used to speed advances in areas such as speech and image recognition and search relevance on CPUs and NVIDIA GPUs. With the new version, researchers also can do a type of artificial intelligence work called reinforcement learning.", 
        "title": "— Issue #13 –"
    }
]