[
    {
        "url": "https://medium.com/@lauradinneen/power-and-productivity-the-next-step-for-big-data-407e8cd2beb8?source=tag_archive---------0----------------", 
        "text": "I keep an eye on the goings on over at Data Driven NYC, and just stumbled across this talk by Tristan Zajonc, cofounder of Sense Platform.\n\nNow, you have to stick with it a little bit, especially if data science is a world of pain for you. But what he’s saying is actually a world of magic, as he talks about two developments in data science worth knowing about: Probabalistic programming and Deep reinforcement learning.\n\nDisclaimer: I am not a data scientist. But I do love data, I am insight-driven, and work for an insight-driven digital agency. So apologies if I miss out any of the technicalities — I’m intentionally trying to simplify these ideas.\n\nThis is about different ways to work with a load of data to figure out the cause of certain outcomes. It’s a new-ish approach to simulating problems to automate inference.\n\nCurrently, this tends to work in a linear fashion, is highly complex and requires a lot of processing time and resource. Statistical modeling and inference take stuff that’s already happened, and try to predict what will happen in the future by telling the computer how one thing causes another thing. With probabilistic programming, you don’t need to know what the causes are, so you don’t need to tell the computer that this thing causes that. Probabilistic programming works out the explanations and linkages for stuff happening automatically, and simulates future events based on that.\n\nIt’s really interesting for me and the conversations we’re having at Bloom, as we’re exploring ways to move from social data insights to predictive intelligence using social data. Probabilistic programming makes this much more achievable — faster, more reliable, with less expertise and resource required. Probabilistic programming can also weave together many datasets and different data types, which is great news when thinking about the huge array of digital data options available to us today.\n\nI found this explanation of probabilistic programming on the O’Reilly website really useful. They highlight some useful examples of this being used in practice, for example more effective climate modeling, more humane clinical trials, improvements to self-driving cars.\n\nDeep reinforcement learning is about developing the ability to automatically connect data insights with decision-making capabilities. For me there are two reasons this is flipping exciting:\n\nThe step from machine learning towards artificial intelligence that this approach offers, means that data is fuelling something called deep learning. We can now use multiple layers of testing and experiments to teach computers to do crazy things like image recognition. Way back in 2012 Google demonstrated this by teaching their machine to recognise cats after watching YouTube for a week.\n\n2. We’re able to fine-tune processes to super-optimised levels\n\nThe reinforcement learning part of deep reinforcement learning is all about automated testing and improving. We can highly optimise processes by teaching computers to observe and learn from the results of their actions, in order to know next time which sequence of events gets the best results. IBM ran a reinforcement learning experiment to optimise the debt collection process and ended up making $90million in additional revenue.\n\nProbably helps explain why Google bought a UK artificial intelligence startup called DeepMind which specialises in deep learning and reinforcement learning for a whopping £40million at the start of this year. Big money for big data.", 
        "title": "Power and productivity: the next step for big data – Laura Dinneen –"
    }, 
    {
        "url": "https://medium.com/@NegativeMind/facebook%E3%81%AE%E9%A1%94%E8%AA%8D%E8%A8%BC%E6%8A%80%E8%A1%93-deepface-6b5f74cd854b?source=tag_archive---------1----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "Facebookの顔認証技術『DeepFace』 – NegativeMind –"
    }, 
    {
        "url": "https://medium.com/@NegativeMind/google%E3%81%AEdeep-learning%E8%AB%96%E6%96%87-c0763f73f9c2?source=tag_archive---------2----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "GoogleのDeep Learning論文 – NegativeMind –"
    }
]