[
    {
        "url": "https://medium.com/@jennagalbut/a-plea-to-your-soul-c1b9d189e16f?source=tag_archive---------0----------------", 
        "text": "Listen, I know it’s been tough. I know at times you’ve wanted to quit. I know you’re tired of having to keep moving up a hill that keeps growing taller. More than all of that, I know that you have this gut feeling that keeps you up at night.\n\nI know you have this undeniable feeling at the center of your stomach that you were meant for more… Do More. Be More. Have More. Give More.\n\nI know. Because I feel it too. It’s the feeling we all have. It’s the struggle every soul being temporarily human has.\n\nI think I know what it is. I think you know it too.\n\nSome call it a calling, a profession, a need, or “dharma”.\n\nNo matter what name you give it. The facts are the same. It is uniquely yours. It is unavoidable. It cannot be changed. It cannot be ignored. It cannot be shunned away. It is a gift meant to be shared with the world.\n\nI know you have it, because you’re alive.\n\nI know you must own it, because that is why you were born.\n\nI know you know of it, because you wouldn’t be in search of it to the depths that you are if not.\n\nHere’s some good news: This new moon is here to help.\n\nMay this new moon energy help us get clear, set intentions, and make a new declaration in fulfillment towards ourselves.\n\nThere are many phases to living your purpose full out, just as there are many phases of the moon.\n\nEach phase is needed. None can be skipped. For the moon to be full it first must be half… Each phase brings its own blessings.\n\nHere’s a breakdown of how the stages may appear in your life:\n\nMaybe you are doubtful, you’re body achy, your mind depressed. Pain becomes so great that you decide to do anything to get out, you are willing to try something new…\n\nNot quite sure where you are going but you are following feelings and signs that may lead you to healing.\n\nYou reach a mountaintop, a new sense of relief, lessons learned, you understand, the lightbulb switches on.\n\nNow you know that you have something to share with the world, you know you can help people, you know it is your duty.\n\nDoubt creeps in, old fears pop up, resistance appears, insecurities arise, you question who the hell are you to do this, you’re not “X” enough…\n\nYou are asked to help, and when you show up as yourself; you realize you can help and truly make a difference\n\nNow you are willing to move forwards\n\nYou get through it, you walk through the storm, you make it out, you learn a lot, you feel victorious\n\nJust so that you are highly aware that this journey is gonna be hard as fuck\n\nYou step into it with pride and joy, you honor the challenge, you face it head on, you are a warrior\n\nYou make the decision to do it. To go for it. To live your life fully. To be the full expression of who you are.\n\nEach time letting go of an old lie.\n\nAnd suddenly there you are…\n\nUnafraid of what may come your way,\n\nUnamused by what they say about you,\n\nYou know you’re only option is to move forwards.\n\nYou know you must.\n\nSo you declare it. You claim it. You own it.\n\nYou say “This Purpose Is Mine.”\n\nAnd in this moment I get to choose who I shall become.\n\nWill I walk towards my greatest self, Or walk away?\n\nYou and I both know the answer.\n\nMay you know with full faith the power of your divine propose. May you be strong, confident, and fierce in your abilities. May you know, just as I do, how amazing you truly are. May you honor your process. May you remain present. May you bring forth from within you your greatest gifts for mankind. May you… BE YOU.\n\n… For more inspiration like this: Join the tribe of over 100,000 souls over at Jennagalbut.com", 
        "title": "A Plea To Your Soul – Jenna Galbut –"
    }
]