[
    {
        "url": "https://medium.com/@dhbogucki/light-in-the-dark-epilogue-caaeecf550c6?source=tag_archive---------0----------------", 
        "text": "Steadfast commitment creates opportunity for more people to discover their own capacity to challenge their fears and to rise up with discipline.\n\nIf people are trusting; being first, being last, being late, struggling, forgetting, and or degree of perceived effort will not produce judgment.\n\nWhat have I learned? Contemplation with a community ritual creates opening. You inevitably challenge your own views because you have decided to listen, and take in the views of those with whom you have communed.\n\nReflecting on this last committed day was a challenge to finally get to do. Last night was an important birthday party. Dinner happened later than normal, and took immense effort. I kept watch on the clock, but was still a bit late for my candle lighting. Being able to steal away to write, and publish was not going to happen in the prescribed time frame.\n\nMy candle lighting was then followed by a ritual fire. Dinner was scarfed down in the least mindful way possible. Then I promptly went to bed. I did make the effort to read some of last nights meditations. Again this morning I made sure to read more.\n\nAt around the seventh hour of work yesterday it was made clear some people would have to come in. Since some others have been busy doing overtime, and I have avoided it, I took up the call. As soon as that was done I bounced off to Blue Ridge Pride to hang out with my Sweetie, and numerous friends. When I could not put it off any more I departed. Sweetie is volunteering, I have come home to carve wood, and make this final post for the seven days.\n\nWhat is clear is that this light has poured over everyone who participated, and everyone paying attention.\n\nI have a piece that is stirring in my mind. I took some photos that describe everything I want to communicate about love. Before I dive in I am going to allow it to culture in my veins. I want to feel it on my skin. I want what I write to do it’s job. It must be skillful and precise. I want you to take up this view, to experiment with the view, and to grow love like respirating trees.\n\nThis is my place of being after seven days.", 
        "title": "Light in the Dark: Epilogue – DHBogucki –"
    }, 
    {
        "url": "https://deephunt.in/deep-hunt-issue-9-ed412b8f2463?source=tag_archive---------1----------------", 
        "text": "Google Research releases YouTube-8M: large and diverse labeled video dataset and 1.5TB of inception-v3 features.\n\nGoogle releases the Open Images dataset, a strong alternative to ImageNet –larger-scale, with a better class set:\n\nThe inaugural competition by Amazon is focused on creating a social-bot, a new Alexa skill that converses coherently and engagingly with humans on popular topics and news events.\n\nArtificial intelligence is quickly shaping up to be one of the key defining technology areas of our time. A day after announcing a new artificial..\n\nFacebook, Amazon, Google, IBM and Microsoft come together to create historic Partnership on AI\n\nEven though they are fierce rivals, they have come together to partner on AI. An industry-wide effort to further public understanding of AI and promote ethical standards in the application of machine learning algorithms.", 
        "title": "— Issue #9 –"
    }, 
    {
        "url": "https://medium.com/@digitaldavide/i-computer-del-futuro-non-si-programmano-si-addestrano-d99d6a69fde4?source=tag_archive---------2----------------", 
        "text": "La logica cablata di tanti anni fa era quella dei flipper e dei jukebox, quando in mezzo agli organi meccanici si alzavano i primi vagiti dell’elettronica. La logica era abbastanza semplice: premi un tasto si accende una lampada, arriva un suono si muove un braccio etc. I circuiti più complessi potevano realizzare funzionalità più interessanti, pensiamo agli ascensori, ai televisori, agli impianti stereo etc. Cablata perché a seconda della logica che volevamo realizzare dovevamo proprio attaccare i fili in modo diverso.\n\nQuesta è stata una vera è propria rivoluzione, che di fatto ha reso l’elettronica irrilevante e ha incoronato l’informatica come tecnica assoluta per il dominio del mondo.La rete, poi, ha reso tutto questo liquido e globale e as a service. Eppure anche quest’era forse sta per giungere ad una fine.\n\ne forse siamo all’alba di una nuova rivoluzione, così come la CPU è divenuto il componente definitivo nel mondo dell’elettronica, forse dobbiamo ora salutare la nascita del componente definitivo nel mondo dell’informazione. Il classificatore/decisore/regressore, insomma un modello matematico/statistico capace di ingurgitare dati e fornire predizioni. Un componente in grado di fare qualcosa simile in fondo a quello che fa il cervello umano, no non dico pensare, ma riconoscere, giudicare, valutare. Parole come deep learning, reti neurali, machine intelligence, etc. sono tutte variazioni sul tema ma il concetto è sempre lo stesso. Macchine che apprendono.\n\nLa conseguenza diretta di tale trasformazione avviene prima di tutto sull’hardware stesso. Abbiamo assistito all’evoluzione dei processori dallo z80 all’I7 e come questi siano divenuti delle macchine elettroniche sempre più complesse e sempre più articolate con set di istruzioni in continua crescita proprio per la loro natura general purpose. Cioè le CPU devono accomodare le esigenze di tutti i possibili programmi che potrebbero in teoria essere scritti e poi girare su di loro.\n\nMa cosa succede quando ci si rende conto che dal brodo primordiale di tutti i programmi possibili e immaginabili comincia ad emergere una sola classe di questi, elitari e intelligenti, non nel senso che pensano, ma nel senso che rendono per sé stessi “intelligibile” e codificabile quello che per i normali programmi non lo sarebbe. Addestrabili a “giudicare” e separare vero da falso, tumore da rumore, Van Gogh da Gaguin. Tradurre il parlato, riconoscere un viso, guidare un’auto, riconoscere un pericolo, riconoscere un nemico, etc.\n\nMa allora forse ci servono CPU diverse da quelle di oggi. In fondo una volta capito come deve essere fatto il software addestrabile, quello che ci serve è un circuito elettronico tutto sommato meno generalista e più specializzato. Se la mia elettronica deve far girare un solo programma non ci interessa più che sia programmabile in senso lato, torniamo a qualcosa di “cablato”.\n\nInfatti questo succede in altri settori, non necessariamente legati alla AI. il Bitcoin mining è un caso emblematico, verificare le transazioni Bitcoin e generare nuovi coin è stata un’attività altamente proficua, tant’è che per ottenere il massimo di prestazioni con il minimo consumo energetico sono stati realizzati dei computer ASIC, non più CPU generaliste, ma elettronica specializzata e pre-programmata per fare una cosa sola, il mining dei Bitcoin.\n\nNon vuol dire che non serviranno più, e quindi ci saranno sempre job opportunities per developer e architect. Ma se ritorniamo allo scenario dove invece di tanti software diversi programmati per fare cose diverse, abbiamo pochi software addestrabili a risolvere infiniti problemi diversi, non abbiamo più un programmatore che si scervella tra cicli for, chiamate a funzioni, e infiniti cicli di trial and error per vedere il suo programma eseguire tutte le linee di codice. Abbiamo invece un software scatola nera che ingurgita dati e sputa sentenze, una rete neurale capace di classificare ad esempio … e a questo punto non è tanto una questione tra Java, Python, C++, etc. le guerre di religione nei forum nerd saranno su Boltzmann machine Vs Convolutional network.\n\nTensorflow è il nuovo framework Google per il deep learning (link) che si aggiunge a varie altre soluzioni nel settore. La caratteristica di TensorFlow è che gira allo stesso modo su una macchina o su un cluster e prevede il deployment su GPU. Ma per aumentare le prestazioni perché non costruire un hardware dedicato allo scopo? Ecco che nasce TPU\n\nLe Google TPU sono circuiti integrati per ad-hoc (ASICs) sviluppati appositamente per l’apprendimento automatico. Rispetto ai processori, sono progettati in modo esplicito per grossi volumi di dati, usano una minore precisione (8 bit) e non dispongono di hardware per rasterizzazione / texture mapping (non gli serve).\n\nGoogle ha dichiarato che le sue TPU sono state utilizzate nella sfida di Go: AlphaGo Vs Lee Sedol.", 
        "title": "I computer del futuro non si programmano, si addestrano"
    }
]