[
    {
        "url": "https://medium.com/@tedsta/deep-learning-in-rust-a-walk-in-the-park-fed6c87165ea?source=tag_archive---------0----------------", 
        "text": "This is a sequel to my previous post several months ago. Last time, I introduced a shoddy library named deeplearn-rs that allowed you to build and (manually) train neural networks that run on your GPU via OpenCL. I told you to “take a gander” at some atrocious code that constructed a rather useless XOR network and then didn’t bother to train it. For reasons unknown, I still got positive feedback. Thanks, internet :)\n\nDeeplearn-rs has come a long way since January!\n\nLet’s see what it looks like before we dive into the details:\n\nThis snippet builds a batched 2-layer network with biased fully connected layers, ReLU activations, and MSE (mean squared error) loss. I’m really pleased with how the API turned out. Check out the full MNIST example to see how it’s trained and validated.\n\nThe Operation (matrix multiplication, in this case) needs the shapes of the input variables and access to the GPU context so that it can create the intermediate GPU buffers it needs. The Graph needs to know the input variables and the shapes of the output variables. It was pretty ridiculous to ask the poor API user to supply of all of these.\n\nThe solution was to separate Operation descriptions from their implementations. I introduced an OpBuilder trait and an OpDescriptor struct.\n\nUnder this system, there are two structs associated with every operation.\n\nBelow is the new matrix multiplication implementation:\n\nNote that <MatMul as OpBuilder>::build figures out the shapes of the input variables, checks for dimension errors, and constructs the MatMulImpl struct, which actually runs the forward and backward passes. The new system is slightly more complex, but much more convenient for the end user.\n\nEven with the improved convenience of node creation, building layers was still too inconvenient for my tastes.\n\nManually creating the weights, adding the nodes, and getting the output variables can be such a drag! I want to build layers with one-liners!\n\nI thought long and hard about how to simplify layer creation for the user. I thought about complicating the operation system further by allowing you to make composite operations out of other operations. And then complicating it even further by giving OpBuilder another associated type “Variables”, which would be a tuple of some VarIndexes for the Graph::add_node to return to the user. Then we’d have to build some notion of which variables to build automatically in OpBuilder::build (i.e. weights). But MatMul seems like a pretty general operation, what if the user doesn’t want their weights made for them? All of this is wayyy too complicated.\n\nInstead, I opted to place layer creation at a higher level of abstraction. I just wrote some functions that build common layer types. Here’s the declaration for the function that adds a biased dense layer:\n\nYou supply the graph, the input to the layer, the layer size (number of neurons), and the initializers for the weights and bias (maybe a normal distribution, for example). You get back the VarIndexes for the output, weights, and biases. Nice!\n\nThere’s now a Trainer struct. Right now, it just backpropagates the gradients to the learnable variables and adds the gradients to the variables at each epoch. I guess that makes it Stochastic Gradient Descent. I intend to implement fancier trainers like RMSprop and Ada Grad eventually. The trainer takes your graph, the number of epochs you want to run, an update function, and your training data. The update function is called every epoch and is where you can read the values of your different variables so that you can monitor your network’s progress.\n\nThe MNIST example runs in 75.6 seconds on my Toshiba Satellite laptop with an Intel Integrated IvyBridge graphics card running the Beignet OpenCL driver. It achieves 89.8% validation accuracy. Pretty terrible, but here I am just stoked that it all works.\n\nNext, I’m going to write a LSTM layer and build a simple char-rnn model.\n\nAfter that, the rough plan is:\n\nI’m graduating from undergrad this coming Saturday (WOOT). Once I find a job and get some money, I’d like to buy a beefy desktop with a real graphics card that can run OpenCL 2.0. Rust’s OpenCL bindings haven’t gotten a lot of love lately, and I’d like to write my own bindings with OpenCL 2.0 support. Then, I’d like to take advantage of the OpenCL 2.0 support in gpuarray-rs and deeplearn-rs. I think device-side kernel enqueuing would be really useful for things like generic broadcast/reduce operations. Stuff for another blog post on another day.", 
        "title": "Deep Learning in Rust: a walk in the park – Theodore DeRego –"
    }, 
    {
        "url": "https://medium.com/latelier-verrocchio/lintelligence-artificielle-et-l-avenir-de-notre-monde-partie-1-2-5904d164f4cf?source=tag_archive---------1----------------", 
        "text": "Les hommes les plus brillants de cette planète (Elon Musk, Bill Gates ou encore Stephen Hawking) s’inquiètent très fortement de l’émergence des Intelligences Artificielles, et je pense que nous devons tous nous y intéresser de plus près pour en être, au moins, conscient des enjeux.\n\nL’intelligence artificielle est la science dont le but est de faire faire par une machine des tâches que l’homme accomplit en utilisant son intelligence. Ce n’est pas qu’un simple concept de sciences fictions associé à Terminator ou Star Wars. Elles sont déjà partout autour de nous, et elles se développent à une vitesse exponentielle. On peut les classer en 3 grandes catégories en fonction de leur niveau d’intelligence :\n\nLe Deep Learning n’est pas la simple conséquence de l’augmentation de la puissance de calcul des machines et de l’expansion de nos connaissances en neurosciences : c’est également une résultante de la très forte croissance des données, des Big data. Ces big data ne sont ni plus ni moins que des informations, que nous créons chaque jour, et nous en créons toujours plus. En 2013, 90% des données et informations disponibles dans le monde dataient d’il y a moins de 2 ans. Tout ce que nous faisons, les 4.2 millions de choses que nous likons sur Facebook et les 500 000 photos que nous partageons sur Snapchat chaque minutes dans le monde, viennent alimenter ces intelligences. Et c’est grâce à cela qu’elles se nourrissent, qu’elles apprennent à apprendre.\n\nPour faire simple, plus le progrès avance, plus il accélère : en anglais, cela s’appelle the Law of accelerating returns.\n\nEn Mars 2016, l’Intelligence Artificielle développée par Google, Alpha Go, a battu le meilleur joueur du monde au jeu de Go. On a tous plus ou moins entendu parler de cette nouvelle, sans comprendre réellement ce que celle-ci impliquait. Cette victoire, anecdotique en apparence, est une étape supplémentaire vers les formes d’intelligences plus évoluées, vers les Artificial General Intelligence et les Artificial Superintelligence. Si l’on interrogeait les experts mondiaux quelques mois auparavant en leur demandant quand est-ce qu’une IA battra le meilleur joueur de Go du monde, leur réponse aurait été “environ une dizaine d’année”. Cela s’est finalement produit en quelques mois.\n\nLe Go est un jeu infiniment plus complexe que les Échecs qui nécessite des techniques de réflexion beaucoup plus élaborées de la part des IA. A titre d’indication, il y a environ 10⁸⁰ atomes dans l’univers, et 10¹⁷⁰ combinaisons possibles au Go. Comment AlphaGo a t-il fait pour gagner ? En analysant des millions de parties professionnelles et en y jouant lui mêmes des millions de fois. Le Deep Learning. (Si vous souhaitez comprendre comment cette prouesse a pu être possible, je vous invite à aller regarder cette vidéo).\n\nLes experts affirment ainsi que nous atteindrons probablement les AGI d’ici 2030 et les ASI devraient suivre vers 2045. Nous serons donc amené à cohabiter avec une nouvelle espèce, au moins aussi développée et intelligente que la notre, d’ici une quinzaine d’années. Et l’Histoire de notre monde nous a bien appris une chose : en parvenant à dominer son environnement, l’espèce la plus intelligente devient toujours l’espèce dominante. Tout comme l’Homme domine actuellement le monde animal. Vision du future assez inquiétante, logiquement c’est là qu’on commencetous à flipper. Qui sait de quoi seront capables ces machines lorsqu’elles seront 10 fois, 100 fois, 1 000 fois plus intelligentes que nous ? Probablement de progrès jamais vu à notre si petite échelle.\n\nQue feront les chauffeurs de taxi quand les voitures rouleront toutes seules ? Que feront les employés de bureaux moyens quand les IA seront capables de répondre au téléphone ? Que feront les médecins quand les IA feront des diagnostics plus efficaces et pertinents ? Que ferons-nous des avocats qui, en soit, ne font que lire et interpréter des textes de lois ? Toutes ces choses là ne concernent que des tâches bien précises. C’est à dire des ANI, que nous maîtrisons déjà !", 
        "title": "L’intelligence Artificielle et l’avenir de notre monde [Partie 1/2] 💻"
    }, 
    {
        "url": "https://medium.com/@n4utilius/the-data-pub-abril-2016-segunda-parte-591da9c5d29c?source=tag_archive---------2----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "The Data Pub — Abril 2016 [Segunda parte] – Kevin Martinez –"
    }
]