[
    {
        "url": "https://aiinvestor.com/deep-learning-in-the-financial-press-8b5177a3faf8?source=tag_archive---------0----------------", 
        "text": "Over the last 12 months, the number of articles discussing deep learning technologies and associated companies has accelerated dramatically. Using Sens.ai, I identified 152 articles covering the topic, with more than 50% of those occurring in Q2 2016 alone.\n\nOnly 10 of the 24 companies that make up my AI Winners portfolio were mentioned in these articles. This gives me another great data point that we are only in the early innings of financial services discussing and embracing the AI revolution.\n\nUnsurprisingly, Google accounted for 34.8% of the mentions. I hold a nearly equally weighed 38.4% position of GOOGL in the AI Winners portfolio. The other top mentions were NVDA (24.2%), AAPL (12.9%), FB (9.8%), MSFT (6.8%), and AMZN (5.3%).\n\nThe focus on Apple in these articles is dramatically overweighted versus my portfolio model, where I only give it the slightest 0.2% weighting in the AI Winners portfolio. I may be underselling Apple slightly because I do not attribute them to any core AI Builder technologies, but their performance in the AI wars has been dismal thus far.\n\nAmong the articles detected was a Reuters piece from last September that attributes a hiring goal of adding new AI headcount at apple.\n\nThese proposed headcount don’t show up in our analysis of open jobs as of Q2 2016. Either Apple ate their fill of AI experts in 2015 and has stopped hiring, or their strategy for ramping competency is even more opaque than I thought.", 
        "title": "Deep Learning in the Financial Press –"
    }, 
    {
        "url": "https://medium.com/@simons.brenna/artificial-intelligence-vs-human-intelligence-how-do-they-measure-up-456bdeaafd16?source=tag_archive---------1----------------", 
        "text": "Artificial Intelligence vs. Human Intelligence: How Do They Measure Up?\n\nThere’s no denying that artificial intelligence is light years ahead of what it was just a few years ago. The technology continues to advance at an ever-increasing rate. But the ultimate goal of artificial intelligence researchers is to replicate human intelligence. So how do artificial intelligence and human intelligence measure up? You be the judge.\n\n1.The so-called “deep learning” that artificial intelligence is capable of isn’t really the type of profound learning like humans are capable of. Rather deep learning refers to an interconnected neural network. That means that artificial intelligence has immediate access to a wider body of knowledge, but humans are still capable of more profound thought.\n\n2.Artificial intelligence systems are able to beat the greatest chess masters in the world but they need millions of pictures (labeled by humans) to be able to learn to correctly identify a cat. Even a toddler can learn to differentiate between cats, dogs, and other animals after just a few instances of exposure to them.\n\n3.Intel’s latest processor, the i7, is one of the best CPUs that the average person can go out and buy. With four cores, it can perform four separate tasks simultaneously. But that’s no match for human biology. Even super computers are no match for the human brain’s 80 billion cells.\n\n4.The human brain can do what it does with just 10 watts of power. Artificial intelligence would need 10 terrawatts to imitate the human brain. That’s a trillion times more energy to do what the human brain is already capable of.\n\n5.Artificial intelligence runs off of algorithms programmed by humans. The algorithms haven’t actually changed much. What’s changed is the ability for artificial intelligence to run algorithms much quicker than ever before. Certain tasks, like mastering chess, depends on algorithms which is why artificial intelligence has the upper hand when it comes to playing chess.\n\nWhy even try\n\nIf after all these years, human intelligence is still vastly superior to artificial intelligence, why do artificial intelligence researchers even bother? Because despite its weaknesses when it comes to certain cognitive tasks, it can still do some things exceptionally better than humans. Artificial intelligence can sort through vast amounts of data in seconds, a task that would take humans days, weeks, or even years. Artificial intelligence is much better at humans when it comes to recognizing patterns hidden among large amounts of data. Artificial intelligence is far superior to humans when it comes to mathematical reasoning and computing as well.\n\nIn the end, humans need artificial intelligence. They can automate some of the more simple cognitive tasks for us such as pulling up our favorite song or performing a quick mathematical calculation. They will make our lives easier. But artificial intelligence still needs us as well. If true artificial intelligence capable of rivaling human intelligence is ever a reality, it will only be because very intelligent humans created it.\n\nArtificial Intelligence News brought to you by artificialbrilliance.com\n\nSource: bigthink.com/errors-we-live-by/should-we-fear-ai", 
        "title": "Artificial Intelligence vs. Human Intelligence: How Do They Measure Up?"
    }
]