[
    {
        "url": "https://blog.insightdatascience.com/insight-artificial-intelligence-fellow-program-launches-in-silicon-valley-and-new-york-c86c7d20ce2b?source=tag_archive---------0----------------", 
        "text": "We’re excited to announce the launch of the Insight Artificial Intelligence Fellows Program. This free, seven-week professional fellowship program will help scientists and engineers with machine learning experience to learn cutting-edge techniques in deep learning and join top AI teams in Silicon Valley and New York City.\n\nThere are rapid advances being made in intelligent system design and many companies are looking to implement the latest techniques in their products and businesses. As a result of the incredible progress in this field, there is a shortage of researchers and engineers who are able to take the latest academic advances and translate them into applied products and systems.\n\nThe Insight AI program will focus on bridging the gap between academic machine learning and applied product development. Machine learning researchers and engineers from Facebook, Google TensorFlow, Twitter, IBM Watson, Salesforce, Fast Forward Labs, Intel, Bloomberg, and many top AI startups will be mentoring and hiring during the fellowship. During the program, Insight AI Fellows will get to work on cutting edge applied AI problems provided by top AI startups funded by Y Combinator, Data Collective, Khosla Ventures and others.\n\nIn addition to working with leading machine learning engineers and scientists from the top AI teams in Silicon Valley and New York, Fellows will join our network of over 750 Insight alumni now working as data scientists and engineers across the US. Many Insight Fellows who have gone through our data science, data engineering, and health data fellowships have gone on to do cutting edge work in artificial intelligence and will be actively involved in the AI program.\n\nApplications are now open for the in-person, full-time AI fellowship sessions in Silicon Valley (March 2017) and New York City (June 2017) — the program is free and need-based scholarships will be provided to assist with living and moving expenses.\n\nFind out more and apply at http://insightdata.ai", 
        "title": "Insight Artificial Intelligence Fellow Program launches in Silicon Valley and New York"
    }, 
    {
        "url": "https://medium.com/@DavidToussaint7/lintelligence-artificielle-renait-des-ses-cendres-fbb8d4d35986?source=tag_archive---------1----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "L’Intelligence Artificielle Renait de ses cendres – David Toussaint –"
    }, 
    {
        "url": "https://medium.com/@ooohiroyukiooo/how-deep-learning-allowed-computers-to-see-69583a16199d?source=tag_archive---------2----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "How Deep Learning Allowed Computers to See – Hiroyuki Takayama –"
    }
]