[
    {
        "url": "https://medium.com/@Staqu/you-love-shopping-we-make-it-easier-staqu-technologies-2961471a2631?source=tag_archive---------0----------------", 
        "text": "Consider that you are roaming in a shopping mall and you fall in love with ravishing fashion stuff. After numerous tussles with your sub-conscious, you decide to go for it but the moment you take out your wallet, your extreme desire meets the “middle class society” syndrome and like always, you decide to buy it online availing the discounts available there.\n\nIf you are fortunate and endowed with linguistic intellect you will describe your new found favourite apparel in simple query words on some e-commerce website. If your query meets with the exact “meta-data” of that item, you will get your fantasy there.\n\nBut let’s face the truth, as per research, universal search engines (like Google/Yahoo/Bing etc.) based on natural languages with lucid search query (linguistically) yield results with the best probability of 0.51 . It means half of the time you get different results than what you were expecting. Another thing to note is that, this “best result” was only for simple linguistic searches.\n\nOur current scenario is different and challenging in two ways — firstly, brain has limited linguistic capability of converting the pictorial elements such as the pattern, shape, colour, etc. in simple query words (just have a look at any kurti/sari/curtain etc. and try to describe it in words ;) ). Secondly, even if you somehow manage to convert that image in some natural language query, you won’t search for the item on universal search engines with infinite data. Rather, your query will be run on the limited data (actually meta-data) available on our database.\n\nBy the way, if you are really feeling inquisitive about what would be the probability of searching for an image using a simple query word accurately,let me tell you that you can write an excellent research paper on it ;) .\n\nLets avoid being nerdy and get directly to the point, what if two paragraphs ago you made your search using simply the image. I mean, once you saw some stunning dress just click the pic and search it online leaving the rest on Staqu’s intellect and “Deep Learning” ;). We at Staqu are crunching data and smoking GPUs to provide you sophisticated cutting edge visual search technology. The results shared here are based on the visual queries performed on women suits (Note: These are the average results).", 
        "title": "You love shopping we make it easier Staqu Technologies"
    }
]