[
    {
        "url": "https://medium.com/syntax-and-semantics/natural-language-processing-vs-machine-learning-vs-deep-learning-ba072ed242ca?source=tag_archive---------0----------------", 
        "text": "Natural Language Processing (or NLP) is an area that is a confluence of Artificial Intelligence and linguistics. It involves intelligent analysis of written language. If you have a lot of data written in plain text and you want to automatically get some insights from it, you need to use NLP techniques. These insights could be — sentiment analysis, information extraction, information retrieval, search etc. to name a few.\n\nMachine Learning (or ML) is an area of Artificial Intelligence (AI) that is a set of statistical techniques for problem solving. These techniques can be applied to a wide variety of problems which are not limited to — vision based research, fraud detection, price prediction, and even NLP. In order to apply ML techniques to NLP problems, we need to usually convert the unstructured text into a structured format.\n\nDeep Learning (which includes Recurrent Neural Networks, Convolution neural Networks and others) is a type of Machine Learning approach. It is an extension of Neural Networks. Deep Learning is used quite extensively for vision based classification (e.g. distinguishing images of airplanes from images of dogs). Deep Learning can be used for NLP tasks as well. However it is important to note that Deep Learning algorithms do not exclusively deal with text.\n\nThe image below shows graphically how NLP is related ML and Deep Learning. Deep Learning is one of the techniques in the area of Machine Learning — there are several other techniques such as Regression, K-Means, and so on.\n\nML and NLP have some overlap, as Machine Learning is often used for NLP tasks. LDA (Latent Dirichlet Allocation which is a Topic Modeling Algorithm) is one such example of unsupervised machine learning.\n\nHowever, NLP has a strong linguistics component (not represented in the image), that requres an understanding of how we use language. The art of understanding language involves understanding humor, sarcasm, subconscious bias in text, etc. Once we can understand that is means to to be sarcastic (yeah right!) we can encode it into a machine learning algorithm to automatically discover similar patterns for us statistically.\n\nTo summarize, in order to do any NLP, you need to understand language. Language is different for different genres (research papers, blogs, twitter have different writing styles), so there is a strong component of looking at your data manually to get a fell of what it is trying to say to you, and how you- as a human would analyze it. Once you figure out what you are doing as a human reasoning system (ignoring hash tags, using smiley faces to imply sentiment), you can use a relevant ML approach to automate that process and scale it.", 
        "title": "Natural Language Processing vs. Machine Learning vs. Deep Learning"
    }, 
    {
        "url": "https://medium.com/@walidsaba/where-artificial-intelligence-meets-censorship-on-social-media-738f53ab3f6?source=tag_archive---------1----------------", 
        "text": "I have seen many posts on Facebook in this election cycle where users were blocked from posting their memes (basically an image with some text on top). I initially thought that was pushing the conspiracy theory a tad too much. I mean who cares about some image posted on Facebook and what difference will it make to warrant any attention. Until … it happened to me! Yup. I posted an image, and I was actually testing these claims in the process, and at first it went through. Of course, initially it will. Apparently, however, the image was later blacklisted (and I’m not sure why, it can make no difference in the entire scheme of things — I mean the universe will still work as it has always worked with or without this image on the net!)\n\nI tried again, but apparently some ‘software’ has had that image and it (that specific image) was now in the ‘negative’ examples and it will never get through again. My reaction? I laughed! I really did, and I will tell you why in a moment. But as someone who worked in Artificial Intelligence (AI) for 20 years now — and still do — and as someone who is familiar with the latest technology at the likes of Google and Facebook (as far as AI is concerned) I knew that they are using an image recognition/image matching technology where they have invested 100’s of millions of dollars. Now I have written elsewhere that their insistence on investing in a technology that will never be able to scale to deliver true machine intelligence, the kind of which is needed for true language comprehension and human-level reasoning, will result in wasting time, resources, and might result in an AI winter — one that is much worse than the one we lived in the 1980’s. But that is not the subject here. The main point I want to make is that these algorithms — that are just a little bit more than (deep) neural nets that are supposedly trained to identify certain patterns — are as dumb as an ant. Knowing that these ‘supposedly’ intelligent deep learning algorithms are anything but, I then laughed uncontrollably (it might’ve also been the wine and the background comedy I was listening to).\n\nYes, I did laugh. I really, really laughed! Because I knew I can post the image I wanted and those ‘smart’ programs would not know I just posted what they just rejected.\n\nThese so-called intelligent deep learning algorithms are data-driven (they only deal with data, not even information structures, not to speak of any knowledge) and as such they do not have nor do they perform any deduction or rule-based reasoning or anything close to these horrible medieval practices. They simply, in the end, compute some function and compare the result to a certain threshold (in other words, they, roughly, in the end grab a number — say ‘5’ — and act on it, regardless if it was the result of ‘2+3’ or ‘15/3’ or if it was the number of countries in the UN that have veto power!) So, no reasoning, no deduction, no thinking. Alright! That suits me fine. So, rotate the damn image a few degrees and repost! Voila! Or, better yet change the colors a bit or add some text that wasn’t there. Or a combination of these. There’s no high-level reasoning to detect that in effect that was the same ‘message’. Worse yet, because of the simplistic manner in which they operate, they might have blocked other images that ‘computed’ to a similar value (which, again, is just some data value)!\n\nSo, fellow revolutionaries: since they still insist on doing faulty Artificial Intelligence, let’s go ahead and post our revolutionary graffiti, but don’t forget: when blocked, just rotate, retouch, and reword! Hey, none of this will make any difference and we’re only having fun. So let’s have some more.\n\nTheir Artificial Intelligence is still not so intelligent — and I told them so!", 
        "title": "Where Artificial Intelligence Meets Censorship on Social Media"
    }, 
    {
        "url": "https://medium.com/@leighton.wong/strata-hadoop-2016-%E6%80%BB%E7%BB%93-c8adec05dfb0?source=tag_archive---------2----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "Strata Hadoop 2016 总结 – 王大磊 –"
    }
]