[
    {
        "url": "https://medium.com/@sokolin/human-art-is-dead-9955e86c2e93?source=tag_archive---------0----------------", 
        "text": "Within a few days, software artists around the world deployed neural network implementations of the algorithms that could render any image with the skill of a master. A few days thereafter, a twitter bot was launched ( link ), giving this Promethean power to the masses. By September 8th, a massive amount of existing artistic style was indexed and automated ( link ). From Kandinsky and Picasso, to Egyptian hieroglyphs and Japanese prints, our fledgling AI has learned how to see and render the world as would a human artist.\n\nOn August 26, 2015, a team of data scientists succeeded in capturing creativity itself ( academic paper link ). Using a similar approach to how Google’s Deep Dream visualized phantom animals in photos, the team identified and unearthed the styles of human expression across several key variables.\n\nWe stand today yet on another precipice. This quiet revolution is a thief that enters the night. Its guide is a timid developer geeking out on the similarities between the human brain and machine learning. It is the engineer teaching a software brain the sense of image recognition.\n\nPainters could not have seen it coming, this cold metallic threat of photography. How could a technology ever rival the vivid human energy captured by a master painter? But here we are two hundred years later. Portraiture is dead. Glass lenses and digital hard drives capture the human visage in bits and bytes, by the millions every day.\n\nThe first photograph ever was taken in 1826. It was crude and took several days of exposure to achieve a poorly composed and grainy image of a roof.\n\nWhat are the next logical steps in this evolution? Doubters will surely have a myriad objections. For example, aren’t these transformations simply a visual filter on existing content? Or, that teaching an algorithm to “mine” for art is not the same as creating it.\n\nWhat is the creative process itself? The creative process, beyond mere rendering and illustration, is the combination of styles and influences in new and surprising ways. To take a famous example, here is Picasso sitting in his studio with artifacts of African Art, which led to his signature abstracted style in the Les Demoisells d’Avignon on the right.\n\nThis masterpiece is a combination of the following variables:\n\nTake now the beautiful but perhaps crude output of the neural networks.\n\nMy answer is a resounding yes. First, train the network on two existing art styles. Second, process them both on an image of four nudes. Third, take the outputs and refine the strength of different variables until results are in line with a human sense of visual aesthetics.\n\nOf course. With thousands of artists and approaches indexed, infinite permutations are possible.\n\nWithin two weeks from the publishing of this groundbreaking paper the answer is a loud, fundamental YES.\n\nMachine learning does not provide “the right answer”. It gives a set of outcomes based on variables with associated probabilities similar to human intuition. The AI has to be taught — refined and rewarded for what we deem to be the right behavior or aesthetic sense — very much like a human child.\n\nBut what we see today is already unbelievable. It is the development of artistic intuition and a skill to render it across any form factor that carries software and sees the world.\n\nWhat then is left to us? What should an artist focus on to create new and challenging work, when our algorithmic sisters are faster, smarter and infinitely more educated?\n\nA quote comes to mind from a curator of digital art in relation to the work of Mishka Henner. Henner had used algorithms to find 51 US military bases using Google Maps, and selected striking and beautiful abstract compositions of the subject matter. Google Maps is infinite. And like a needle in a haystack, meaning and beauty must be found by a trained eye.\n\nAnd so it must be with the neural networks, who will play and create beyond our wildest imagination. But it is up to us to teach and guide them, to frame their intuition into a brush that reaches for the sublime.", 
        "title": "Human art is dead. – Alexey Sokolin –"
    }
]