[
    {
        "url": "https://blog.hyperverge.co/hyperverge-2-0-part-i-8ab80fd644e0?source=tag_archive---------0----------------", 
        "text": "Having spent pretty much the entire time since our inception in near-perfect stealth mode, we finally decided it was time to break out of it and unleash ourselves on the world. Just kidding, it’s not as dramatic as we make it seem. What has been dramatic though, is the past few months. Several cycles of sleepless nights, ridiculously long meetings, furious ideation, and relentless prototyping have transpired, and we have undergone a tremendous amount of change. We now have a very interesting product under development, and we will start giving out sneak peeks and demos soon!\n\nIn the meanwhile, we are extremely excited to present to you the brand new HyperVerge identity — one that we believe truly represents who we are as people, and what we strive for as a company. Thanks to our friends over at Beard Design, we now have very cool branding collateral. Take a look!\n\nThe new HyperVerge logo is futuristic and distinctive — something that we felt really resonated with our outlook. It is befitting of our technology, which appears simple, yet is highly advanced.\n\nWe particularly fell in love with the font Beard chose for us, as it is simple yet exudes sophistication. The black and white colour scheme further captures all the characteristics we were looking for.\n\nWith our HyperVerge brand, we promise to empower through innovation, providing our users the ease of leveraging powerful technology without any compromises. Just like our name — ‘HyperVerge’, which stands for pushing beyond (Hyper-) the limit (‘Verge’), we hope to constantly outperform ourselves, testing our own boundaries and positioning ourselves at the forefront of technology. We are supercharged, and raring to take on the world, one photo problem at a time.\n\nWelcome to the start of a new journey, and we hope you stay with us for a long time to come!\n\nStay tuned for part two as we take you through our branding journey", 
        "title": "2.0 — Part I –"
    }
]