[
    {
        "url": "https://machinelearnings.co/machine-learnings-11-86e6bc7cf3fb?source=tag_archive---------0----------------", 
        "text": "1/ Facebook, Amazon, Google, IBM, and Microsoft built a partnership to conduct research and promote best practices in advancing artificial intelligence. link\n\n5/ IBM Watson created the first movie trailer created entirely by artificial intelligence. link\n\n6/ MIT scientists developed a device that uses radio waves to detect whether someone is happy, sad, angry or excited. link\n\n7/ Las Vegas casino announces plan to use BrainChip machine learning security technology to detect dealer errors by monitoring video streams.link\n\n9/ Clarifai launched custom training and visual search products to make it easier for developers to build AI into apps. link\n\n10/ Otto announced plan to offer freight hauling services using autonomous trucks in 2017. link\n\n12/ Google introduced the Open Images dataset of ~9 million URLs to images that have been annotated with labels to help the machine learning community train deep neural networks from scratch. link", 
        "title": "AI Brings the Big 5 Together — #11 –"
    }, 
    {
        "url": "https://medium.com/@marcelo_tibau/intelig%C3%AAncia-artificial-e-suas-tend%C3%AAncias-2103e430e703?source=tag_archive---------1----------------", 
        "text": "Nos últimos 15 anos, IA conseguiu cumprir a sua expectativa histórica de permear a vida do ser-humano. É verdade que um dos grandes responsáveis por isto são os “pequenos” equipamentos que carregamos em nossos bolsos e bolsas diariamente, os smartphones. De todo modo, ao se tornar uma força central em nossa sociedade, a própria IA vem se modificando. O grande objetivo das mentes por trás do seu desenvolvimento, não é mais construir sistemas que são inteligentes, mas construir sistemas inteligentes que são confiáveis e focados no ser-humano.\n\nPode parecer um simples “jogo de palavras”, mas a realidade é que esta visão traz uma mudança profunda no direcionamento das pesquisas no campo da IA. Para resumir este direcionamento, usarei apenas um termo: dados. Quem tem familiaridade com a hierarquia DIKW percebe imediatamente o que isto quer dizer. Dados são a base em que se constrói o conhecimento. Ao focar neles, as pesquisas em Inteligência Artificial se aproximam cada vez mais do que transforma o ser-humano em ser-humano, a alta capacidade de aprendizagem — de transformar conhecimento em sabedoria.\n\nDeep Learning: sei que parece título de filme B, mas penso que vale a pena dar uma explicação um pouco mais técnica aqui do que na “palhinha” de algumas linhas acima. É chamado de aprendizado profundo, a habilidade de se treinar com sucesso redes neurais convolucionais (em teoria da informação, convolucional é um tipo de código para detecção de erros). Em machine learning, a rede neural convolucional funciona de maneira inspirada no córtex visual dos animais, reconhecendo largura e altura de um volume e se ativando quando “vê” algo similar em uma determinada posição espacial. Um dos campos que mais se beneficiam disto é o da visão computacional, que pode ser aplicada em reconhecimento de objetos (e atividades gerais de reconhecimento) e áreas de percepção artificial como voz e linguagem natural (os idiomas que falamos). Sei que a maioria não ligará “o nome à pessoa”, mas saibam que coisas comuns que usamos — como os filtros para fotos de aplicativos como Instagram — se beneficiam destes conhecimentos.\n\nAprendizado por reforço (reinforcement learning): não sei quantos dos que me leem tiveram a experiência de terem “aulas de reforço” no colégio. Lembro do drama que era para mim chegar duas horas antes das aulas às quintas-feiras, para ter aula de reforço em português. O objetivo deste tipo de aula era, no meu caso, utilizar a língua portuguesa em situações práticas reais (escrever cartas, interpretar textos e entender suas implicações). Funciona de modo similar no caso das máquinas, envolve ensiná-las a aprender algo necessário para executar ações no mundo real. O modo de se fazer isto é através de estruturas sequenciais para tomada de decisão baseada em experiência. Este campo, estagnado há décadas, tomou um impulso com o surgimento do deep learning. Um exemplo prático é o AlphaGo, desenvolvido pela Google, para ensinar máquinas a jogar o jogo chinês Go (para mais detalhes tanto de um quanto de outro, incluí links que direcionam ao site do AlphaGo e à explicação do jogo original na Wikipédia). O AlphaGo foi treinado inicialmente através de um banco de dados criado por especialistas humanos no jogo e posteriormente, via aprendizado por reforço, praticando através de jogos contra si mesmo. A aplicação desta área é bem dinâmica, atua desde viagens espaciais até extração de petróleo em grandes profundezas (como no caso do nosso pré-sal).\n\nVisão computacional: esta é a forma mais proeminente de percepção da máquina hoje. É uma das áreas de IA que teve a sua evolução impulsionada pelo aparecimento do deep learning. Pela primeira vez, os computadores são capazes de executar algumas tarefas de classificação visual melhor do que as pessoas. Combinada com computação gráfica, tem sido a responsável pela “explosão” da tendência de realidade aumentada.\n\nProcessamento de linguagem natural: muitas vezes usado em conjunto com o reconhecimento automático de voz, o processamento de linguagem natural é outra forte tendência da área de percepção da máquina. 20% das consultas ao Google já são feitas por voz e alguns testes já mostram a possibilidade real de usá-lo para tradução em tempo real. O foco dos estudos está se concentrando cada vez mais no desenvolvimento de sistemas capazes de interagir com as pessoas por meio do diálogo (e não simplesmente reagir a comandos digitados).\n\nInternet das Coisas: também conhecida pela sigla IoT (Internet of Things), é um dos grandes focos de pesquisas na área de Inteligência Artificial. Está relacionada à ideia de que uma grande quantidade de dispositivos (ou coisas) podem ser interconectados para coletar e compartilhar seus dados sensoriais (eletrodomésticos, veículos, edifícios, máquinas fotográficas e roupas são alguns exemplos). Embora seja uma questão que envolva em grande parte a criação de tecnologia e a utilização de rede sem fio para conectar os dispositivos, há um enorme desafio no processamento e uso inteligente destas imensas quantidades de dados (a serem) gerados que ainda precisa ser equacionado. Outro ponto, é que atualmente esses dispositivos utilizam uma quantidade grande de protocolos de comunicação incompatíveis. IA está sendo utilizada tanto para desenvolver soluções para lidar com esta possibilidade exponencial de big data quanto para ajudar a domar a “Torre de Babel”.\n\nHá ainda outras tendências que de tão específicas, prefiro não abordar — como computação neuromórfica (neuromorphic computing), criação de algoritmos baseados na teoria dos jogos, sistemas colaborativos, dentre outros. O que une estas tendências não citadas e as demais que comentei é a sua característica human-aware (centrada no ser-humano — como mencionado no início do texto). Isto quer dizer que por mais complicado que possa parecer, todas estas iniciativas são especificamente modeladas e desenvolvidas com o foco nas pessoas que se espera que elas interajam. Por enquanto não há o risco de se criar algo como o sistema Skynet — do Exterminador do Futuro. O maior risco trazido pelo deep learning para o aprendizado da máquina, é o processo conhecido como overfitting. Assim como nós, seres-humanos, as máquinas também apreciam a boa e velha decoreba. Quando percebem que uma resposta não muda, elas simplesmente a decoram. O overfitting ocorre quando tentam generalizar algo que é específico, usando o que decoraram. Como se pode ver, o que faz a diferença em qualquer aprendizado é o contexto.", 
        "title": "Inteligência Artificial e suas tendências – Marcelo Tibau –"
    }, 
    {
        "url": "https://medium.com/the-technews/vocalzoom-sensor-can-recognize-what-you-say-by-detecting-your-skin-vibrations-b7f2f49fb614?source=tag_archive---------2----------------", 
        "text": "Your skin is your reflection. Anything about you, from your age to when you last fall sick can be known from your skin. Using that fact, an Israeli startup named VocalZoom wants your skin to do much more complicated analysis, understanding what you say.\n\nThe skin of our face makes exquisite vibrations while we talk. The amount of vibration is too low to be seen by human eye, but with an instrument called interferometer, VocalZoom team noticed it detect weird measurements.\n\n“When it measures the face, we found out that the vibrations were caused only by the speaker’s voice and were not affected at all by any background voice,” said VocalZoom CEO Tal Bakish to Digital Trends. “At this point we realized that we have a disruptive technology to extract the voice of speaker in any noisy condition.”\n\nThe team built a sensor that can measure vibrations just by focusing on the speaker’s face from within a few feet, which are then translated into an acoustic signal. “This acoustic output is then fed into a typical speech enhancement or noise-reduction[program] to be fused with an acoustic microphone to create a practically noise-free signal that is fed to an automatic speech recognition [program],” said Bakish.\n\nVocalZoom claims the resulted signal features very limited background noise, compared to those recorded by microphones and noise reduction units. Bakish hopes that signal may help match facial gesture with a speech to build more secure and accurate speech verification software.\n\n“Over the past decade, solutions have relied only on data collected for training and strong processing technologies, such as neural networks and deep learning,” he said.“Now it is clear that to reach the 100 percent performance required for user adoption, the microphone technology needs to improve.”\n\nThe startup is currently in a partnership with Intel, Motorola Solutions, 3M, and some other companies. You can expect its technology featured in consumer devices as early as the next year. Also, they want to include the feature for voice control in vehicles and discussing it with some major car makers.", 
        "title": "VocalZoom sensor can recognize what you say by detecting your skin vibrations"
    }, 
    {
        "url": "https://resources.trainingdata.com/how-deep-learning-allowed-computers-to-see-be52a97e5330?source=tag_archive---------3----------------", 
        "text": "One of the biggest challenges of the 21st century is to make computers more similar to the human brain. We want them to speak, understand and solve problems — and now we want them to see and recognize images. For a long time, our smartest computers were blind. Now, they can see. This is a revolution made possible by deep learning. Machine learning: The first step Understanding machine learning is quite easy. The idea is to train algorithms on large databases to make them able to predict results from new data. Here’s a simple example: We want to predict the age of a tree thanks to its diameter…", 
        "title": "How deep learning allowed computers to see –"
    }
]