[
    {
        "url": "https://medium.com/38th-street-studios/vision-inspiration-conversation-the-story-behind-the-modern-domestic-woman-7bf49733925a?source=---------0",
        "title": "Vision, Inspiration & Conversation: The Story Behind The Modern Domestic Woman",
        "text": "When our team was approached by Elizabeth Rago, syndicated columnist and freelance writer, about building a website and brand for The Modern Domestic Woman, we knew it was going to be a great project. Elizabeth came to our team energetic about her online community, excited to get things rolling, and most importantly, had a real mission and vision for her story.\n\n38th Street Studio is thrilled to have had the opportunity to work with Elizabeth during her journey, and we wish her nothing but success as she continues to build her empire.\n\nHear from Elizabeth about The Modern Domestic Woman and the inspiration behind her growing community.\n\nWhat is this mission of The Modern Domestic Woman, and what inspired you to create this community?\n\nThe Modern Domestic Woman came to life when I was writing for an editorial partner of the Chicago Tribune and All Things Girl, an Arts & Literary eZine created by Debra Smouse. After both publications came to an end, I had established such a lovely conversation on Facebook with readers that I knew this potentially powerful community couldn’t go away. So I purchased the url and the rest is history.\n\nThe mission is two-fold: to provide a space where women can feel safe and not judged, and also to provide content and stories that connect with women all around the world. Humor is a must at The Modern Domestic Woman, so our vibrant Facebook page is always hopping with conversation about anything from home decor to struggles like anxiety, the latest books we’re reading, pretty things like nature and fashion…\n\nWhat inspired me? I’ve spent so much time trying to jam myself into a box that was like everybody else, but I never had peace with the outcome. There was so much negativity and snark in my news feeds, I reasoned if I put out into the world what I truly felt in my heart — humor, passion, love, a desire to build other women up and not shoot them down — my “tribe” would come.\n\nWhat prompted you to reach out to 38th Street Studios for website design and branding?\n\nI was extremely impressed with the A Step Above Dance Academy, Inc.(ASA) branding and website. I’ve worked with Shannon Clayborn (Studio Owner/Artistic Director of ASA) and I love her high standards and keen eye for business. If she was happy with 38th Street Studios, I knew I would be too. Referrals are a powerful testimony.\n\nWhat aspect of your new website are you most excited about?\n\nIt’s clean and not cluttered. It’s easy to navigate. The 38th Street Studios team tapped into all the unique nuances that make me, me, yet never lost sight that I wanted to create a community for women all over the world. They designed a site that would invite all women to my space — and I’m thrilled to be the hostess of this digital international coffee klatch.\n\nWho or what is the inspiration for your blog?\n\nAll the women I know and love are the inspiration for my blog. Nature is a huge inspiration. My mother plays a big role in what I write about because she molded me into the woman I’ve become today.\n\nWhat is a favorite inspirational quote you live by?\n\n“Seize the moment. Remember all those women on the ‘Titanic’ who waved off the dessert cart.” — Erma Bombeck"
    },
    {
        "url": "https://medium.com/38th-street-studios/launched-how-we-built-a-website-we-were-actually-proud-of-b3ff6ec85dc6?source=---------1",
        "title": "Launched: How We Built A Website We Were Actually Proud Of",
        "text": "We are excited to announce that 38th Street Studios has recently undergone a complete website makeover. And — not gonna lie — we think it’s pretty sexy. We know what you’re thinking: “Ken, your website looks great. What’s your secret?”\n\nHonestly? Our amazing team. Without their expertise, creativity, and hard work, none of this would have worked so seamlessly. Before I dive into our strategy behind the beautiful creation, I feel the spotlight should be swiveled over to them. It is no lie that this took blood, sweat, tears, and a few late nights. A big shout-out to the 38th Street Studios team for all they do!\n\nAs for the “secret sauce” in our strategy, it’s no secret that we learned from the pitfalls of our old website. When we began our journey, we were unsure of how or where 38th Street Studios would fit into the industry landscape — you could say we had an identity crisis. We knew we could offer specific services and expertise, but we weren’t really sure how to put the pieces together. As a young and budding start-up, we felt we had to peacock our way to the top. For us this meant “serious business talk,” sentences that were slightly confusing and convoluted, and a showcase of everything we do on the home page without a strategy or story. Our internal confusion ultimately resulted in us building a website that lacked direction and clarity. And we weren’t proud of it.\n\nThen (sadly) we forgot about it, and focused more on our clients rather than giving our own domain the TLC it desperately needed.\n\nThis is common. Often times companies, especially agencies or startups such as ours, spend so much time and energy providing their clients with the best services and products possible that they forget to spend time building their own brand. It’s difficult to have an objective view; what you think is great might seem confusing to your clients.\n\nThis is exactly what happened to 38th Street Studios, which is why we finally decided to revamp our image and design a new website. We came together and recognized our website’s weaknesses, and worked to build one that accurately portrays our energy, our services, and our vision.\n\nHere’s what our Director of Marketing Lauren Santee, had to say on the four key principles we chose to focus on when building our new website.\n\nThe first and most important aspect is to identify your purpose. Your entire website (navigation, design, content, etc.) should all be driven by this — so nailing down what you want your website to accomplish is key.\n\nRather than doing the work for us, our old website actually gave us more work. When clients visited the old website, they would immediately come back to us with more questions. The lack of purpose and intent of our old website confused potential clients, and we would have to take more time and effort to try and clearly define what we were offering them.\n\nThankfully, we’ve cleared up this communication bug. The purpose of our new website is to educate our visitors on the exact services we offer, as well as our skills, expertise, and knowledge in the industry.\n\nBy including individual service pages, posting regular content (such as this blog), and focusing on content that engages our users (which we did not have before), we are able to accurately portray and achieve our purpose, and educate our viewers by forcing them to insert themselves into our brand’s narrative.\n\nAnd because the second purpose of our website was to grow our inbound leads, including call-to-actions was also a huge part of our strategy. We now have a way to prompt people to contact our team to learn more or request a quote — which is huge.\n\nCommunicate Your Message (Tell Your Story)\n\nWhen it comes to communicating your message, content is everything. It’s important to think about the tone you want to take and what type of emotional response you want your users to have. This will ultimately drive the style and the purpose of your writing.\n\nWhen communicating your message, it’s also important to fully embrace your brand and avoid portraying an image that doesn’t represent your brand or its beliefs. For example, on our old website we thought that the only way to be successful and build trust in this industry was with overly professional and serious language. It definitely did not fit our brand or style, not to mention us as individuals. So with our new website, we decided to embrace our youthful and relaxed energy by utilizing a more informal and laid-back vibe. And, because we are just being ourselves and making our website more appealing to read, our new site has already been much more successful in helping us reach our purpose.\n\nAnother important aspect to consider is how you want your website to naturally guide users, as well as the end action you want them to take. Do you want them to purchase a product? Contact you to learn more? Follow you on social media? All of the above? Developing a solid website flow is the number one way to make this happen.\n\nOn our home page, our core intent is front and center, followed by the services we offer, and ending with our portfolio. Like a story, it has a beginning (our purpose), a middle (what we offer), and an end (our final product). It goes without saying that following this structure is the easiest way to develop your brand’s storyline and flow.\n\nKeep It On Brand\n\nLast but not least, be sure to keep your website on brand. There’s nothing worse than visiting a website that does not represent the business, not to mention one that is completely off brand. Everything from the font, colors, logo usage, language style and verbiage should all be consistent with the look and feel you have chosen for your company.\n\nThe best way to keep everything on brand across all channels (social media, website, digital ads, print collateral, and so on) is to develop a style guide. We did this for our company just a few months ago and I have to say it has made developing assets and keeping everything consistent so much easier — especially if you have a large team with multiple members working on the same project.\n\nWe hope you found these tips helpful for your website. Remembering the four major principles — Purpose, Story, Flow, and Brand — will bring you one step closer to developing a website you’re excited about. We know it did for our company."
    },
    {
        "url": "https://medium.com/38th-street-studios/stop-and-smell-the-free-photos-f83600e91f5c?source=---------2",
        "title": "STOP! …and smell the (free) photos – 38th Street Studios –",
        "text": "Negative Space not only has the name that fills designers’ dreams; it has photos for everything. After using it for a while, I’ve come to see that it’s a good resource to use if you are looking for photos of people and interactions with an artistic, laid back, and somewhat hipster elegance. You can tell what type of photographer is drawn to this platform, and designers and marketers with a similar aesthetic should hang out in the same e-space to find similar photos.\n\nPixabay is one of the big ones; their photos are almost always found and featured on all other free platforms. The photographers who post on this platform exude a more natural, sharp, and clean artistic style. If you are looking for vivid colors in natural settings, check out Pixabay the next time you need a photo.\n\nThe most basic and one of the better known resources out there is Pexels. While they are a free photo resource, they also offer different categories and incentives for photographers, meaning the lineup of images is continuously updating. Take their photo challenges, for example; these will help you gain some additional inspiration while providing you with new and varied images every day.\n\nDeath of the Stock Photo is on a mission to fuel the world’s artistic endeavors via approach and process, one free resource a time. The feel of the images from Death to the Stock Photo is more of a Scandinavian-chic; however there are plenty other styles mixed into their stash. So, if you’re feeling a little “stick-it-to-the-man-iosis” from big Stock-Image businesses (School of Rock reference if you’re wondering), then make Death to Stock your go-to.\n\nWhenever I want a nature scene with a subdued tinted filter, I think of Unsplash. They have plenty of other styles and categories that don’t fit this description as well, but they seem to have strength in all things natural and scenic. Looking for a backdrop for your next inspirational quote? Unsplash. Or perhaps a photo of a mountain and valley with a beautiful sunset behind a winding road to enhance your business metaphor? Unsplash. Best of all, they have consistently high quality images that they add to each week. If you need a fresh perspective through a new (camera) lens, Unsplash is the place to be."
    },
    {
        "url": "https://medium.com/38th-street-studios/se-no-10-most-common-seo-mistakes-to-avoid-9f30ba390244?source=---------3",
        "title": "SE … NO! Common SEO Mistakes To Avoid – 38th Street Studios –",
        "text": "SEO is constantly changing due to search engine developments and evolving user needs. Strategies that might have been your bread-and-butter last year may no longer be relevant in today’s market (don’t worry, we’ve all been there). But one thing that hasn’t changed is the power and importance of SEO: as many as 75 percent of users never scroll past the first page of search results, meaning that getting your website to rank on SERPs is … well, everything.\n\nAre you doing all you can for your SEO? If your SEO strategy still contains any of the following mistakes, it’s a sign you need to rethink your plan and regroup with your team.\n\nKeyword stuffing is the worst. Filling your website with loads of keywords and jargon creates a horrible user experience and can come off as “spammy”. Most brands have recognized this SEO shift and now use keywords in moderation, choosing to focus more on content that is relevant and user-friendly. If you missed the boat, or are fearful that your website might use too many keywords, you’ll want to check your keyword density. Essentially, this tool will provide you with a percentage breakdown of how many times you use certain words or phrases. One to three percent density per keyword is the sweet spot. Anything more and Google will throw a red flag.\n\nJust because you can’t stuff your website with keywords does not mean that you can’t provide your users with a healthy serving of quality content. All content on your website should be related to your keywords and your business. If you sell ice cream, there’s really no need to have content on your website that talks about the pet store down the street (sorry, pups). Not providing users with a relevant experience is often a result of trying to fit too many topics within a single piece of content or web page. In order to fill your website with quality, relevant content, you must first think about what search terms your audience will be using to visit your site, as well as the questions they are hoping to have answered once visiting each page.\n\nSlow and steady may win the race, but not when it comes to your smartphone. With 80 percent of Internet users owning a smartphone, and 48 percent of users beginning their product hunt with a mobile search, your business has every reason to have a fast, mobile-responsive website. Not only is it great for your customers, but having a mobile-friendly website is a must for SEO. Google and other search engines can recognize when your website is not mobile responsive and may penalize your site with a lower ranking.\n\nWe all know that backlinks are a huge factor in Google’s ranking algorithm — in fact, it’s the number ONE factor. But what some businesses still don’t understand is that it’s better to have three high-quality backlinks than 50 low-quality ones. Getting backlinks from irrelevant sites is counterproductive and will actually hurt your rankings. Instead, your backlink strategy should focus on connecting with well-respected and quality websites that are relevant to your business and goals, as well as removing any backlinks that aren’t clean.\n\nWhile we may never truly know if Google views social shares as backlinks, or if social signals can actually boost your rankings, we do know there is some type correlation between social signals and ranking position. Although social media is not a direct ranking factor (or so they say), social media still has the power to get your content in front of more people, help you build an interested audience and stay highly visible in your market.\n\nAnd, don’t forget that your social profiles can actually influence the content of your search results. Meaning that your profiles have the ability to rank in Google, only further increasing your exposure and improving your social SEO. Bottom line, having a strong social presence is one of the best ways to promote content and be found online, which is what SEO is all about.\n\nLocal search is key for businesses that focus on customers within a certain city or region and rely heavily on foot traffic, like a local ice-cream parlor or restaurant. More than 25 percent of all searches have local intent and over 85 percent of brand engagement by consumers is local; in order for these searchers to find your business, your website must be properly optimized. Some quick ways to improve your local SEO is to claim and optimize all local profiles (Google Maps, Bing Maps, Yahoo Maps, Yelp, etc.), include local keywords in your copy and meta tags and continuously monitor your online reputation on all platforms, such a customer reviews."
    },
    {
        "url": "https://medium.com/38th-street-studios/survey-says-surveys-are-a-great-marketing-resource-473c40cd3467?source=---------4",
        "title": "Survey Says: Surveys are a Great Marketing Resource",
        "text": "Market research is essential to understanding your target market. You want to know the ins and outs of your buyer’s preferences, the groups with whom your business will flourish, and their personal everyday habits. Contrary to what you might believe, it doesn’t take a huge market research firm to derive a few conclusions about your audiences based on a couple of questions and insights — especially if you are just starting your own business and don’t have $50k lying around. Yes, there is a time and a place for deep dives, especially if your audience is changing and your company is undergoing a massive structural marketing-strategy shift. But if that’s not the case, there is a cheaper and simpler alternative out there for you: surveys. Yes, that’s right! Questionnaires have a time and place for your business no matter what its size, and best of all, they don’t have to be long and boring.\n\nHowever, not all surveys are created equal. It may sound easy; hash together a few true/false questions and bingo! You have your survey. But oh, how much farther from truth could you be. A survey may seem simple and straightforward, but this holds true only if done right. A survey is one of the most powerful, quick, and effective tools you have at your fingertips, and to quote Peter Parker’s Uncle Ben: “With great power comes great responsibility.” Be responsible in creating powerful surveys and you will get insanely insightful data.\n\nWhether you want to know where your audience hangs out the most on- (or off-) line, to whether or not they think your product is ugly and not worth a dime of their money, a survey can be very powerful. For this week’s blog, we’ve lined up some of our favorite survey tools to date. They all have different features and capabilities to allow you to pick the one that best fits your budget and business model. And who knows? You might even find a new little business opportunity casually laying in your data, smiling up at you.\n\nPossibly the most widely known and free survey platform out there, Survey Monkey offers an extremely user-friendly and streamlined tool. They offer comprehensive tips and tricks to survey creation, from length to content and question type. The services offered vary widely, so go ahead and take some time to pick the right model that suits your business’ needs.\n\nI love and respect Typeform not only for their approach to surveys, but their attention to wrapping detail and user experience into a beautiful platform that is actually relaxing and enjoyable. Even their emails give me email-design and content goosebumps. They have both free and pro-version options at a slight cost with varying features at each level. If you want a good design experience as well as worthwhile, rich data, Typeform is your go-to survey generator. After all, they understand that “how you ask is everything.”\n\nIf you haven’t heard of Survey Anyplace, check them out. They offer a platform that lets you build interactive questionnaires instead of the run-of-the-mill surveys that you would normally expect. This means that with additional logic, some gamified elements, and the use of mobile features, you can create pieces of content that are engaging in addition to offering respondents valuable information in return for their data. Create anything from a regular survey to an assessment, decision tree, calculator, or quiz in a fun format. This case is a great example that shows how you can use their tools to collect valuable data that generates leads, all while bringing value to respondents in return.\n\nEver get caught spiraling down BuzzFeed Quizzes and end up learning that your personality most closely resembles a chicken nugget? We’ve all been there. While sometimes random and pointless, BuzzFeed Quizes can actually be quite useful; after all, they are essentially masked surveys that people take for fun. Take advantage of this illusion by adding some questions that would be helpful to you and your business. Want to know what you buyer’s preferred color is? Add that into a personality quiz or the next “Which Disney Prince Would You End Up With?” test. Users also like to be rewarded, so keep in mind that tying in an incentive at the end of the quiz is always a great added bonus, such as a discount on your product or a free ticket to an event.\n\nOnce you’ve picked your survey platform, remember to keep the survey quick and simple; no one enjoys sitting through a long drawn out survey that seems to have no end. Case in point: the ETS GRE Test asks test takers to take an optional survey about their testing centers once you’ve completed the mind numbingly long exam. It lasts over an hour. Need I say more? There is no question why improvements haven’t been made to any of their centers because ain’t nobody got time for that. Don’t be like this survey… make yours short, simple, and to the point. By following this rule you will surely have a larger pool of data in a shorter amount of time.\n\nYou should also consider purchasing targeted audiences. By analyzing a specific demographic, you’ll get concentrated responses and insights from a very specific group of people. Rather than asking a general and potentially irrelevant audience who’s not at all interested in buying your product or services, analyze the audience that matters.\n\nAnother thing to think through when making your survey is to insert “opportunity questions”. These types of questions prompt the audience to identify pain-points. In other words: areas that are confusing or difficult for customers in either the buying process or design of your product. Use your survey as a critiquing opportunity to get candid feedback that uncovers areas for improvement. You can do this by sprinkling in some free-form answer boxes to your question prompts so respondents can answer openly and freely.\n\nAnd lastly, give your survey takers some incentives. They have graciously taken the time to sit down and give you some information about themselves, and therefore deserve to be rewarded. Providing a discount code for their next purchase or a free sample of product is a great way to make your survey-takers happy. However, be aware that if you want unbiased and uninfluenced answers, sometimes it’s best to not let test takers know which brand is conducting the survey. In this case, a gift card to a local cafe or Amazon could suffice. Use your best judgement when thinking about incentives."
    },
    {
        "url": "https://medium.com/38th-street-studios/time-series-with-structured-deep-learning-e911c1ef9923?source=---------5",
        "title": "Time Series with Structured Deep Learning – 38th Street Studios –",
        "text": "Let’s get right to it and begin to break the myth that deep learning is not for structured data! To begin, let’s take a look at the series we will want to be forecasting.\n\nThis looks like a good series to potentially forecast given the high degree of seasonality, many periods of seasonality, and is relatively trend less. If there were some sort of increasing or decreasing trend in this series, we might want to try and make it stationary by differencing. However, since this is not the case, let’s look at what we can do to our data.\n\nThe original data set comes with just a “Date” column that is comprised of just a month and year, and a counts column. One nice feature of using the fastai module is that they tend to incorporate many best practices and have many prewritten functions that I find myself writing all the time. One such is their add_datepart() function. This attempts to grab any sort of feature available from a general date object. Example use, is as follows:\n\nThis results in our dataframe now containing the information of\n\nThis is great, but since our date information is monthly, we can drop columns like “Week”, “Day”, “Dayofweek”, “Is_month_end”, “Is_month_start”, “Elapsed”.\n\nNot bad for 1 line of code to add all of the features and 1 line to drop the unwanted columns. Now, since this is a time series, we may be interested in the previous time components to predict the future ones, a concept known more specifically as auto correlation. One approach to incorporating auto correlation with neural networks is to use Long Short Term Memory (LSTM) units. These tend to have worse performance in practice for structured time series problems than the fully connected approach that I will demonstrate in this post, however, I will cover them in a future post since they seem to work incredibly well when it comes to Language Modeling. Since we are not using an LSTM approach, we have to create our own lags on the structured data. Here is an example of how to do just that.\n\nAt this point we have the features engineered and now it’s time to prep our data to go into our model. Let’s specify our continuous, categorical, and dependent variables, and cast them to the appropriate type. PyTorch prefers continuous variables to be of type ‘float32’ and the fastai library uses type ‘category’ in order to properly encode variables that need maps from objects to indexes before placing into the neural network.\n\nWe now get to use another extremely handy tool from the fastai toolbox, proc_df. This takes our data and scales our continuous columns appropriately and creates the maps for our categorical columns.\n\nNow, let’s go ahead and take the log of our dependent variable and split our data. In many other types of modeling scenarios, we might want to randomly or stratify sample. Since we are dealing with a time series, it is better practice to use the most recent data as our validation set. For the sake of simplicity in this post, we will just use a validation set and not create an extra holdout test set.\n\nWhen dealing with time series data, we are usually more interested in being 10% low or 5% high as opposed to being off by a count of 22. Since we want to view our accuracy in terms of these percentages, we generally use validation metrics in terms of percent errors. Let’s go ahead and define our validation metric of exponential root mean squared percent error. A nice feature of fastai is that you can input multiple validation metrics to watch, so why not?, let’s also define the common mean squared error as well. Then, we instantiate our ColumnarModelData object, which will serve as our object to abstract back all of the data loading and transformations.\n\nFor the inputs to our neural network, the continuous variables will do fine, however, we have a choice for the categorical variables. We can either do an explicit representation of them by means of one-hot encoding or effects encoding, which would essentially make a column for every unique level in our categorical variables, OR……. Use categorical embeddings."
    },
    {
        "url": "https://medium.com/38th-street-studios/the-best-things-weve-recently-heard-and-watched-c695fed076cf?source=---------6",
        "title": "The best things we’ve heard in a while … – 38th Street Studios –",
        "text": "Looking for a little inspiration? We’ve got you covered. The team at 38th Street Studios has come together (once again!) to compile some of our favorite videos and podcasts. From motivational messages, tutorials and educational videos, we’ve got something that everyone will find useful — either on the job or in life in general. Enjoy!\n\n“I am a fan of the MFCEO podcast. He is super aggressive and raw. However, what I like most about him is that he is true to himself and really talks about the truth about the hardships of building a brand and starting a business.”\n\n“For a long time in high school I was addicted to TED talks; I subscribed and watched every single. I have always been addicted to learning new things and the array of diverse topics on TED only fueled my addiction. This TED talk is my all-time favorite and I enjoy watching it every single time.\n\nIt inspires me on so many levels. I am very environmentally minded in general, so obviously this played well for me. I often feel like I do a really bad job listening because I jump to my answer so quickly. There is a power in silence all the way down to the pauses in a discussion. Thinking about how powerful not speaking is changed my perception of ways of working with others, especially with my teammates and co-workers.”\n\n“I’d highly recommend the fast.ai lectures taught by Jeremy Howard and Rachel Thomas. They have three parts with 21 lessons that are geared towards teaching state of the art concepts in artificial intelligence and deep learning as it applies to computer vision, natural language processing, and structured data problems. It’s aimed towards any general coder who wants to pick up deep learning skills. I think it would be incredibly useful for anyone in a data science or back-end engineering role.\n\nI find them incredibly useful, not only because the lectures are very practical and the theory is easily applied, but they have built up a very active learning community around the platform. As opposed to many other courses out there that are focused on theory, this course puts you directly in the driver’s seat; they allow you to drive the race car on the first day while picking up what makes it function along the journey.\n\nAlso, as an honorable mention, Rachel Thomas has a computational linear algebra course that is related to these lectures. These help with more understanding of the intersection of math and good computer science practice in terms of algorithm efficiency which help augment understanding from the deep learning lectures mentioned above.”\n\n“Marketing Over Coffee is one of my favorite podcasts — hands down. This podcast covers everything from presentation skills to AI for marketers, and everything in between. The fact that John and Christopher meet and record each episode in a café makes it a fun and light-hearted way to stay up-to-date with the latest trends. They’ve basically set up each 20-minute episode to feel like a casual, out of office conversation … which is awesome. I’d recommend downloading a few shows a month and listening to them on your way to work.”\n\n“I would recommend Aaron Draplin’s series about Logo Design on Skillshare.com. I found it useful because Aaron does a great job at stressing simplicity. He also displays an interesting old school Midwestern aesthetic which I can relate too growing up in the suburbs of IL. I would recommend it to any graphic designer as it has a strong message of balance within design, which all artists should have a great understanding of.”\n\n“A few years ago I really got into graphic design. The best introductory course I found was Graphic Design — An Overview of the Field on Udemy by Mason G. The course is not free, but I think it is well worth the $10 price. He doesn’t go into the specifics of how each individual example is created, but he does explain the foundations of good design. Covering the ins and outs of logos, packaging, posters, book covers, motion graphics, websites, annual reports, environmental graphics, and editorial design, this course will give you a taste of it all. I’d recommend this course for anyone interested in either getting their feet wet or trying to get some inspiration for their next project.”"
    },
    {
        "url": "https://medium.com/38th-street-studios/you-cant-have-it-all-at-once-2015bb3691a5?source=---------7",
        "title": "You Can’t Have It All!…at once. – 38th Street Studios –",
        "text": "|Hardest question for an entrepreneur to answer?\n\n“Tell me about your company…what do you want to do with your company?”\n\nAs an entrepreneur, this feels like a trick a question. Because after all, entrepreneur’s are 90% psychopath and 10% narcissist. So, of course, the real answer we want to blurt out when asked this question is “WORLD DOMINATION! I WANT IT ALL!!”\n\nThink about it, you set out to be an entrepreneur because you wanted to be your own boss, you didn’t want to follow someone else’s rules, and because you believed in your ability and vision to do something better than how it’s currently being done.\n\nSo why wouldn’t your answer as an entrepreneur be some variant of “WORLD DOMINATION!?” We already believe we are the best, we already believe we can do anything, and our vision is jaded because we are the ultimate optimist.\n\nHowever, in year 3 of being an entrepreneur, I have finally realized that the best entrepreneurs have the ability to control their passion and confidence and leverage that energy to focus on one mission at a time. I’ve also realized that the one mission, task, or goal they do focus on is a very simple one. And because its simple, they are able to perfect it. And then, that one small & simple mission, goal, or task blossoms into a larger one.\n\nI had a hard time accepting this. I was getting in my own way because I was making the process too complicated. What was worse was that I was holding my team back.\n\nFULL DISCLOSURE: I have the most talented team that ever walked this earth. I know every founder in the world says that….but I am telling you all those other founders are wrong.\n\nBecause of how talented they are I felt that I was doing them a disservice if I took on a small & simple assignment. I now know that is the dumbest thing I could have ever thought. Just because our team has the talent to do it all doesn’t mean that we should…at least not at once.\n\nBusiness is about two things. Discipline & momentum. If you can remain disciplined and focus you can build momentum for your business.\n\nThe journey of being an entrepreneur is already a difficult one. Don’t make it harder than it needs to be. If you and your team has the skill-sets to build and create something that is great…GOOD…focus those skill-sets and solve a small problem and grow the solution as big as you can. When you do that, you will pick up new skills, gain credibility, and hopefully if you do it right, earn a little bit of walking around money.\n\nBecause entrepreneurs are wired differently this is hard to wrap their head around. In a way, it feels like settling, which is the worst feeling an entrepreneur can feel. But its not settling it is just the truest form of patience. And patience is the number one trait every entrepreneur must have."
    },
    {
        "url": "https://medium.com/38th-street-studios/in-response-to-apples-new-intelligent-tracking-prevention-technology-maybe-it-s-time-to-listen-to-380948d9edcd?source=---------8",
        "title": "In Response to Apple’s New Intelligent Tracking Prevention Technology: Maybe it’s Time to Listen to…",
        "text": "“The customer is always right.” It’s a motto that has shaped the American service industry and how we respond and cater to our customers. So why is it that we insist on bugging, annoying, and bombarding our customers with pop up ads, hidden and delayed auto-play videos we can never seem to locate in the millions of pages we have open (at least for me), and screen-covering attention grabbers? The people have spoken! Customers have had enough, and Apple has decided to heed their wishes with a new and improved Intelligent Tracking Prevention (ITP) technology.\n\nEver notice a sales associate from Store A hover over your shoulder the entire time while shopping, and then follow you to Store B with a new coupon for an item you were looking at in Store A? No. Ever notice ads following you around the internet? Yes. This is a key difference between real life buying and internet buying. This practice may become less ubiquitous online in the very near future, thanks in part to ITP.\n\nIf you work at an ad agency or as a digital marketer, chances are you’ve heard about Apple’s new move to block excessive tracking on the Safari web browser. Big ad agencies like the industry giant Criteo are in a panic over the potential losses they face this year, feasibly accounting for nearly a fifth of their revenue.\n\nThe new ITP was announced in June 2017 and released for iPhones, iPads and Macs in September. The feature prevents Apple users from being tracked around the internet (comparable to when you leave a store and the sales person stays put) through vigilant management of cookies. These cookies are small pieces of code that allow companies, like advertising agencies, to continually identify users as they browse. Following the user from start to finish, a cookie doesn’t necessarily drop off once a browsing session is over, giving these companies more information than just product and buying preferences for an extended period of time.\n\nFor now, the new Intelligent Tracking Prevention technology works only on Safari. While not nearly as widely used as its competitor, Google Chrome, the Safari search engine is the default app on all iPhones worldwide, allowing it to hold a hefty 15% of the global market for web browsers. This also means that for the majority of tracking, it will be extremely difficult to follow the habits of those with iPhones. And this technology will not stop at Safari; Google has also announced that they are developing a similar technology for Google Chrome, which holds nearly 55% of the web browser market, scheduled to roll out later this year.\n\nApple has stated their reasoning for implementing such a technology is for the safety and privacy of their consumers, noting that “…information is collected without permission and is used for ad re-targeting, which is how ads follow people around the internet.” They’re basically saying that pesky sales person is following you home, to the kitchen, to the bathroom… (Boundaries, please.)\n\nIn light of all this, maybe our industry needs to take a moment to reflect. Technology is created as a response or reaction to a need or void. The rapid advancement of ad blockers, pop-up blockers (of which you have most likely installed on the very browser you are reading this on), and ITPs is a reflection of what consumers are asking for — less ads and more, genuine, real content. In reaction, ad agencies and marketing industries develop new workarounds and technologies to follow their customers, creating a mini digital advertising arms-race. I’ve even recently learned that Pop-Up Blockers are now packaging the data they receive and selling it back to ad agencies… it’s a seemingly never ending battle.\n\nPerhaps we are going in reverse with all the noise of auto-played pop-up videos and popovers, interstitial ads that take up the entire screen, and “wait, don’t leave us!” messages when you go to x-out of a window. It all echoes the early days of the internet when we madly x-ed out of tacky, rampant pop-up ads from multiple windows.\n\nSo let’s take a moment; pause, reflect, and think. How can we get creative without dropping our potential customers, or annoying them to the point of no return? We have a few ideas.\n\nGet Creative and Ask Questions.\n\nYou’re a Marketer. Creativity is in your (vocational and experienced) DNA! Try to get as targeted to people’s interests as possible, but keep an open mind for potential rifts in the data. Not sure how to do this without cookies? Identify people with an intent to purchase based on their buying history from what they have bought in the past, from either you or other brands, that your brand is aligned or associated with. Perhaps it’s time to bust out a good old survey and see firsthand what people are looking for, rather than trying to follow their every move and determine buying preferences based on “rational” economic models and data. People are not rational. They are human, which means their preferences and interests can change and evolve over time — just like your brand will … eventually.\n\nThat’s right: this will take time. However, things that are hard are worth doing. Sit down and think about what makes your brand stand out. Instead of following the latest squeezing-in-on-every-inch-of-the-webpage advertising strategy, think about where your audience is looking for stuff like this, rather than popping up in unrelated places like news outlets or YouTube. People do actually sign up for email subscriptions (I do), but only when they think and know it’s useful, interesting, and pertinent to their needs and wants. We both know that those unwanted and unasked for emails from which we have no idea how our contact info ended up on quickly find their way into our spam or trash box… never seeing the light of day (or screen) again.\n\nOne of the best techniques in advertising and marketing is humor. Remember Old Spice before 2010? It was known as the brand your grandfather used. But what I am sure of is that you view their brand differently now thanks to their humorous “The Man Your Man Could Smell Like” ad campaigns from 2010. They knew consumers didn’t associate Old Spice with younger audience, so they revamped their image and laughed at themselves. After all, he is on a horse, on a boat, and in the shower all at once. But you don’t care because it’s funny. And you remembered that. Whatever industry you are in, humor always works in some form or another, and everyone loves and remembers a good laugh, even if only for a brief second. You don’t have to make everything satirical and funny like Old Spice (for all we know that could be way off brand and not in sync with what your brand is trying to communicate). However, think about adding a small dose of humor into your content — people will remember it."
    },
    {
        "url": "https://medium.com/38th-street-studios/instagram-marketing-tips-for-any-business-18ac55c51cd1?source=---------9",
        "title": "Instagram Marketing Tips For Any Business – 38th Street Studios –",
        "text": "With more than 800 million monthly users (wow!), there’s every reason for your brand to have a presence on the platform — but only if it makes sense for your business, of course. If your brand is struggling to make the most of your Instagram account, or are looking for a few simple ways to better optimize your profile, these Instagram marketing tips just might be your saving grace.\n\nYou can include up to 150 characters in your Insta bio — including a link. And, because you can’t post links in individual posts, you need to make the most of your bio link at all times. A great way to keep your bio fresh is by changing your link based on your most recent post. For example, if you make a post about one of your blogs, try switching your bio link to that specific blog link — and, don’t forget to lead people to that bio link in your post (ex: Click the link in our bio to read the blog now!)\n\nStay on top of your bio link, and if you are leading people to it in your posts, make sure it is highly relevant to what you are promising. You don’t want to lead users to your link promising a blog post, only for them to find the link actually leads them to your home page. #annoying\n\nIf you don’t want to change your bio link each time you post, you can use tools such as Linktree to create a custom link that includes a page with multiple links, allowing you to share up to five links to help you make the most of your Insta bio.\n\nVideos have always been a great way to engage audiences and build trust, and 2018 will be no exception. In the past, videos were extremely costly to produce, but now that today’s smartphones are equipped with high-quality cameras, producing awesome videos on-the-go has never been easier.\n\nNot only does a strong video presence instill trust in consumers and increase engagement, video also has the power to increase online conversions and dramatically improve ROI. 57% of consumers say that videos gave them more confidence to purchase online, and 83% of businesses say that video provides good return on investment.\n\nCheck out these tips from Small Business Trends on how to create great marketing videos that actually convert.\n\n­­If you want to attract users to your business, you must give them a reason to care. Telling a story with your Insta posts is a great way to get users excited about interacting with your brand … not to mention, it also lets you showcase your business’s mission, personality and products is a way that does not feel like “marketing”.\n\nThe keys to telling a good story are consistently strong visuals and content that will cut through all the noise in people’s feed. Insta stories are also great for telling your story and reaching people in a new way — after all, the word “story” is in the name! However you choose to tell your story, just make sure the message and tone are consistent and sticks to the identity of your brand.\n\nMost of the time, businesses ask, “ How often should I be posting to Instagram?”\n\nAccording to Buffer Social, major businesses post once or twice per day to Instagram. Some brands even post as frequently as 10 times per day!"
    },
    {
        "url": "https://medium.com/38th-street-studios/free-resources-for-social-media-marketers-949adb08be8f",
        "title": "(Free) Resources for Social Media Marketers – 38th Street Studios –",
        "text": "The landscape of social media is fluid and ever changing. Contrary to what you might think, the strategy behind it for a business is much different from your daily casual habits. For beginners, the seemingly ubiquitous landscape takes on a new light in the business world where ethics, best practices, and engaging with different audiences fall into a new balancing act. In light of this ambiguity, we’ve created a list of the top resources we think you’ll need to check out in order to stay on top of your social media game.\n\nAs the description states: this blog presents “the industry’s top wizards, doctors, and other expert’s best advice, research, how-tos, and insights — all in the name of helping you level-up your SEO and online marketing skills.”\n\nHupSpot is all things social and marketing. A blog dedicated to all things marketing with a healthy section on social media do’s and don’ts. What I love about this blog is that they are always touching on the latest topics, asking relevant and timely questions.\n\nSimply put, a blog dedicated to analytics, marketing, and testing. With fresh content updated nearly daily, this blog will have you thinking about your social media strategy and how you can use additional tools to take it a step further.\n\nThis visually pleasing and social media savvy blog will make you want more each time you visit. Bear in mind that this blog presents information with the assumption that the reader understands social media basics upon entering the site, so if it’s all new to you, brush up on your social media ABC’s before diving in.\n\nIf you are wondering about the timing for your social media posts, Buffer Social will have your back (and your calendar!). Mixed with a fairly diverse array of digital marketing topics, research, and discussions, this blog has a bit of everything.\n\nWho doesn’t love a good TED Talk? TED has a special playlist dedicated solely to social media and digital marketing. We recommend you check out … all of them.\n\nThis is one of my favorite databases for all things learning. Similar to Khan Academy, Udemy allows you to explore various different topics and learn the basics of each category they have on file for free. If you want a more in-depth and involved educational experience, paid versions and courses are also available. Check out the Social Media Marketing section nestled under the Marketing Category. And while you’re there, check out all things marketing that they offer.\n\nIf you have a little extra cash to spare on your social media marketing education, Lynda is the go-to place. Bought out by LinkedIn a few years ago, Lynda has become the one-stop-shop of professional educational videos.\n\nNeed to save time and money? We all do, and this podcast will give you the insights you need to save in every which way. Focusing on services, tools, advice, and software, this is all things “bread and butter” of how to get started and keep going.\n\nThis podcast deals with all things internet. Not only will this podcast give you insights into the weird depths of the Internet, it will also give you a flavor for web trends and why certain content goes viral.\n\nThis entertaining and insightful podcast was created by Gary Vanynerchuck who started out blogging about wine and quickly gained traction in all things digital. Funny and interactive, this podcast will have you thinking more about not only about social media trends and history with a holistic and creative twist, but about business and entrepreneurship as well.\n\nThe Social Media Marketing Podcast is an on-demand talk radio show from Social Media Examiner. It’s designed to help busy marketers, business owners, and creators discover what works with social media marketing, and offer knowledgeable lessons from the pros that help you to avoid mistakes.\n\nThis book is good for basic social media info. Great for those who are lacking experience in the field and looking to learn everything related to social media marketing.\n\nAs its title exclaims, everyone can write. However, not everyone has the guts to do so; let along produce great content. This book is really great for content development tips, and could be applied to essentially all industries.\n\nThe Art of Social Media: Powerful Tips for Powerful Users\n\nAnother good resource for general tips and strategy, The Art of Social Media gives readers a fresh perspective from one of the former chief evangelists of Apple and a pioneer in business, blogging, all things social media, and much more."
    },
    {
        "url": "https://medium.com/38th-street-studios/tools-the-38th-street-studios-team-uses-to-stay-on-top-of-it-all-ab3f59b0c4fb",
        "title": "Tools the 38th Street Studios Team Uses to Stay on Top of it All",
        "text": "“Weirdly enough my go-to resources are Twitter and LinkedIn. I get to keep a close eye on our clients, the industry, and trends. On LinkedIn, I get to connect with clients and people in the industry that have similar networks, which also helps build connections and resources. I like to use any app inside the G-suite, as well.”\n\n“Sublime is a text editor I code in daily. Previously I was using Coda which was really nice for providing a built in FTP. However, as we started to move to local development, this feature became less important. After moving to sublime I don’t think I could ever go back. Sublime not only is incredibly lightweight and fast, but has a great open source community around it. Even after working with Sublime for months I am still finding small features I am so impressed with.”\n\n“One tool that I use all the time is Jupyter Notebooks. It is an interactive programming environment that allows for fast prototyping of code. Jupyter Notebooks allows for extremely easy and clean sharing of code along with the appropriate output along the way so that others can reproduce your work with ease. I use it for testing code before deploying many of our projects, and I also use it to create and validate predictive models before they are put into production.”\n\n“For me, Hootsuite is my go-to resource for content management. The UI is great, and the ability to build teams and share the workload is extremely convenient. Staying up-to-date with industry trends is a must, so I try to read at least one major article a day. As of late, my favorite blog resources are Moz, HubSpot and Kissmetrics, but I also really like the daily newsletters from Digital Doughnut and Buffer Social.”\n\n“Adobe Illustrator. This software is second to none when it comes to designing with precision. I value consistency and mathematics (such as precise grids) in all my designs. With Adobe Illustrator any artist is able to set up an artboard with parameters like these in mind. It is also great for producing any scale of digital visuals for any and all clients.”\n\nAs for me, Google Sheets is my go to. I use it to stay organized and on top of the multiple projects I have going on at once, as well as organizing content and dates for blogs such as this one. The most important feature is its collaborative nature: I can be working on a document, and my teammates can make live edits on the fly. As an added bonus, it saves the multiple rounds of saved versions directly, freeing up extra hard drive space for other projects I may have. I can have everything in one place, wherever and whenever I need."
    },
    {
        "url": "https://medium.com/38th-street-studios/review-getting-started-with-redux-by-dan-abramov-8c016f5a4995",
        "title": "Review: Getting Started with Redux by Dan Abramov – 38th Street Studios –",
        "text": "I have been working with React and Redux for over 9 months now, and I have to say, I love it. I love the community, the way the framework feels, and the philosophies it promotes. Hands down, it’s amazing.\n\nI started off my React journey when one of my business partners kept bringing up react native as a cross platform mobile app solution. Since our team is small (5 people with only 2 developers) maintaining web, iOS and Android platforms was challenging.\n\nI researched courses that could get me up to speed quickly and came across Stephen Grider’s “The Complete React Native and Redux Course.” I dove right in with the goal of rebuilding one of our apps in React Native. Not only did this course seem well reviewed but the content was directly applicable to our tech stack so it was a perfect fit.\n\nAfter completing this course, I wanted to know more about React. Prior to using it, we were writing web apps in Angular 1. Angular was a nice step up from plain html or jinja templating but stepping into React felt like all the weird things that didn’t feel natural went away.\n\nI came across another course for Redux weeks ago but couldn’t seem to find the time to go through it until this week. I always felt like I knew Redux pretty well, however I never felt like I knew it at the level of being able to teach it. I thought, if nothing else, completing this course could make me feel more confident about doing things correctly, as well as give me the ability to teach my teammates all about the library.\n\nI must say that I fell in love with this course; it’s awesome! I was excited to find a course this detailed, thorough, and accessible.\n\nWhy, you ask?\n\nWith React’s popularity — and thus by consequence Redux’s popularity — there are a ton of great learning resources out there for Redux. I started by paying for courses on Udemy, and I soon found that a lot of free ways to get access useful material exist on many similar platforms. This is certainly one of them.\n\nI found the information in this course to be presented in such a way that beginners to Redux and React could keep up; so much so that I have sent it to all of my coworkers who are just starting out.\n\nThe course takes the time to make sure you are keeping up and attacks concepts in a way that makes you feel like you could do it yourself. From fundamental principles to solid examples, you get a feel of the core assumptions of redux. From there the course takes you through building a ToDo app where you see the principles in action, in addition to seeing how Redux and React have evolved together to solve different developer problems.\n\nThis is where I thought the course went above and beyond. The course is made up of 30 videos with most lasting about 4 minutes each. This allowed me to get through the course in three sittings throughout the week, however someone could very feasibly do it all in one sitting.\n\nEven with how quickly you can move through this course, Dan does a great job of keeping a consistent flow to each video and section. He takes the time to recap information from previous videos, walks you through the lesson, and clearly recaps each time. I think this is nice for people who want to make sure they understand the holistic process.\n\nEach section is handled in a way where Dan walks you through the problem, most basic solution, writes an abstraction which is similar to the standard way, and finally implements the standard way of using redux (typically implementing the react-redux provided function). By taking this approach, his course extends its audience from those new to Redux to people who have been using Redux for a while. I, and I think many others, read docs and stack overflow posts and see people simply say:\n\nand use the provided functionality. This usually completely solves the problem and most people move on. Dan’s course takes it a step further in making me feel like I actually understand not only what these functions do but also how they came to be. Dan shows you the problems developers ran into while redux was being adopted and what they created to solve it. This was huge to me."
    },
    {
        "url": "https://medium.com/38th-street-studios/digital-marketing-trends-to-watch-out-for-in-2018-bfec9782f304",
        "title": "Digital Marketing Trends To Watch For In 2018 – 38th Street Studios –",
        "text": "2017 brought rapid changes to the world of digital: digital voice activated personal assistants, smart homes and electronics, as well as an ever increasing Influencer market that brought brands and consumers closer with social media stars acting as brand ambassadors and go-betweens. These advancements will evolve and change in the New Year, and the technology will only get better. Read on to find out more about the most talked about trends in digital marketing for 2018.\n\nInfluencer Marketing will see yet again another uptick from 2017 headed into the New Year. As shown last year, Influencer content is highly effective, and at a much lower cost. As they follow personalities that they instantly connect and resonate with, consumers feel more connected to the brand. When spoken to at a more personal level by voices that they trust and follow everyday on social media platforms like Instagram, Facebook, and Snapchat, rather than watching a commercial or campaign that tries to reach every demographic in one take, consumers are more willing to buy. On a similar, but different level to Influencers, are the everyday consumers who generate their own content. Whether it is customer reviews or specific campaigns encouraging customers to post photos or videos of themselves using products and brands, the 2018 consumer will become an even more integral part of the buying story and buyer experience.\n\nVideos, albeit not extraordinarily new, will start to take an even bigger space on the stage of digital marketing. Eye catching and easy to follow, video will be used more in explaining concepts, ideas, and instructions to users and clients. The higher engagement that video produces will surely have digital marketers pumped for the high ROI it will bring. However, video in the New Year will not just be produced in-house. Video content generated by social media Influencers will soar with the ever-growing accessibility to video equipment and cheap gear. Watch out for more video content on Influencers’ social media feeds, especially platforms like Instagram and Snapchat. However, not just any video will make the cut in 2018; high quality, professional videos that leave a lasting impression on users will be the most sought after by the end of next year.\n\nAnd speaking of video content on Instagram, the app is now the most widely used social media app amongst millennials: over 90% of users ages 18–35 use the photo-sharing app, and Instagram reported that a total of about 800 million users use the app each month. The platform has seen multiple enhancements in the past two years, including Instagram Stories, which allow users to share disappearing videos similar to that of Snapchat. In fact, users are slowly ditching Snapchat in favor of Instagram in part thanks to this new addition. Along with new features such as photo galleries and enhanced video sharing capabilities, Instagram has grown to become the one-stop shop for all things social. Look out for more B2C advertising and marketing tactics on Instagram going into 2018.\n\nVoice Search technology has been around for a while. Up until now, the technology hasn’t been robust enough to hit the mainstream market. But come next year, Voice Search will be the norm for consumers’ research. AI search and assistant platforms such as Microsoft’s Cortana, Apple’s Siri, Google Assistant, and Amazon’s Alexa have all improved immensely over the past few years, and their kinks and glitches have been — for the most part — successfully smoothed over. The successfulness of Voice Search will depend heavily on the ability of artificial intelligence to extract meaningful data from people and interpret it correctly. Once AI becomes advanced and is fine-tuned enough to keep up with all the nuances of the human voice –and brain — we’ll be seeing a massive shift from type-search to Voice Search.\n\nIn sum, professional video and quality content will dominate social media platforms in the near future, whereas AI and Voice Search will continue to evolve and improve to better meet the specific needs of consumers. We’re excited to see these new advancements, and we’re looking forward to seeing what the New Year brings us for digital marketing!"
    },
    {
        "url": "https://medium.com/38th-street-studios/email-marketing-basics-for-beginners-a550a6e10d6",
        "title": "Email Marketing Basics for Beginners – 38th Street Studios –",
        "text": "The degree of personalization can vary in an email. From simply including your client’s name to more advanced techniques like sending out content based on gender, location, and preferences, you can have a big impact on how you connect with your readers. Personalization is important because you are feeding them relevant content and information based on their needs, and it can also have a large impact on ROI: about a 26% higher open rate to be exact.\n\nA simple way to personalize an email is to include content based on your readers’ browsing or shopping habits. Email automation based on these actions sent out in a timely and personalized manor flows users through the buying process, leading you to higher ROI per campaign. For example, let’s say Alex has been browsing through your catalog of items, saw something she liked, and dropped it into her shopping cart. But, for whatever reason, she left her cart full and closed her browser. This is a perfect opportunity to send out a reminder message about those items. Adding content that is similar or related to her browsing history will prompt her to continue through to the final buying stage, ultimately landing you an additional sale for the day, all with one simple email.\n\nHere, MCM uses the abandoned-cart email strategy to remind the client about the items they left in their shopping bag while simultaneously offering suggestions for items they may be interested in:\n\nTo learn more about the different levels of personalization you can include in an email, check out Campaign Monitor’s handy guide. They offer a variety of examples and ideas that you can start using right away, no matter your level of experience."
    },
    {
        "url": "https://medium.com/38th-street-studios/the-week-ahead-an-entrepreneurs-thought-7ff3ae1c7cf1",
        "title": "The Week Ahead: An Entrepreneur’s Thought – 38th Street Studios –",
        "text": "“It’s not how you start, it’s how you finish”. \n\n \n\nFor any of you who grew up playing sports as I did this phrase was recited over and over again and became stuck in your head like one of those annoying Nicki Minaj songs you just can’t stop singing randomly throughout the day. \n\n \n\nWell, for me I can gladly say I am happy this saying stuck with me. The phrase “It’s not how you start, it’s how you finish” is something I tell myself every day which has become a soothing mantra whenever I feel the inevitable anxiety of being an entrepreneur….It also helps me when I’m on the golf course and I shank one into the water off the first tee box. \n\n \n\nIn my opinion, it’s a saying that every entrepreneur should at the very least remember. For me, I have found that the phrase provides a sense of hope and pushes me to believe in myself. \n\n \n\nIs the saying cliche? \n\n \n\nSure. \n\n \n\nHowever, it’s a little less cheesy than picturing Rocky Balboa screaming in my ear “It ain’t about how hard ya hit. It’s about how hard you can get hit and keep moving forward” with that terrible [East Coast??] accent while Eye of the Tiger plays in the background. \n\n \n\nThe point of it all is that no entrepreneur can predict the future. But as an entrepreneur, one of the greatest perks is that you have the privilege to do everything in your power to best control the outcome. \n\n \n\nIt doesn’t matter if you have bootstrapped your business, were fortunate (or unfortunate) enough to have raised capital to give it a jumpstart, or took over a family business. What matters is what comes next. \n\n \n\nIf you bootstrapped your company, cool. That story is only cute for so long. What do your sales look like? How are you going to grow? If you are growing how are you planning on sustaining that growth? \n\n \n\nRaised Capital? Sweet. How are your going to bring a 10x return on that investment? Who are you going to hire next to ensure quality control over your company as you focus on raising your next round? \n\n \n\nMom & Dad just retired and handed over the keys to the family business? Congrats. How are you going to earn the trust of the employees who have worked for your parents for 20+ years? How are you going to make sure that what your folks built keeps up with the modern times? \n\n \n\nI don’t ask these questions under the impression that I know the answers. In fact, it’s the complete opposite. I don’t know the answers and it’s ok not to. All that matters is how you react and what you do next. \n\n \n\nTo paraphrase the Founder of Linkedin Reid Hoffman: what is an entrepreneur? Someone who jumps off a cliff and builds a plane on the way down. \n\n \n\nAs an entrepreneur all you know is that you have a few skills, a passion you can’t stop thinking about, and that you THINK you have the stomach enough to pursue that passion and turn it into a [successful] business. \n\n \n\nYou hear all the time about how hard the journey is going to be on the path to greatness, how many sacrifices you are going to have to make, and how much you are going to have to hustle. But you really don’t know until you actually jump off that cliff. Until you actually get that call from the bank saying your account has been overdrawn until you have to take that second job to make sure you have enough money to pay your employees, or until your idea that you spent 6 months building gets rejected and you have to start over. \n\n \n\nAgain I say all of this to remind you that it doesn’t matter. I will also let you in on a little secret. No one cares. No one cares because of either…\n\n \n\nA.) They have gone through the same exact thing and aren’t here for your sob story. \n\n \n\nOr \n\n \n\nB.) They haven’t gone through it and they have no idea what it’s like or why you would put yourself through such struggle. \n\n \n\nLike I said it doesn’t matter. What matters is what you do next. What matters is not making the same mistake twice. What matters is listening to your mentors, trusting your team, and most importantly…having the discipline to remain humble. \n\n \n\nI was very blessed to have two great mentors in my life that I met at a late stage in life (by late I mean like 18 but its cool because I’m like 50 in entrepreneur years). One an accomplished entrepreneur and the other a successful executive in the corporate world. The two traits they share their ability to remain humble and their relentless effort to pay it forward. \n\n \n\nThose two traits are ones that I try and practice every day. Is it hard? Absolutely. However, those are the two traits that I know without a doubt I can control. Remaining humble and seeking to pay it forward not just when it is convenient but truly seeking to pay it forward when given the opportunity have given me both the optimism and discipline to keep striving to be better. Not just for myself but for others as well. \n\n \n\nI told my team that I was going to submit at least one post every Monday for our blog. I’m not going to lie I was nervous when I made this promise. I don’t have any followers, I am not a writer, and I am pretty sure I am an undiagnosed dyslexic. However, as I have stated throughout this post. It doesn’t matter how I start, what matters is how I finish. \n\n \n\n-KC"
    },
    {
        "url": "https://medium.com/38th-street-studios/i-wanted-to-share-a-small-series-of-photos-i-took-with-my-iphone-at-the-start-of-the-2017-18-winter-44e8ecb8d3d0",
        "title": "I wanted to share a small series of photos I took with my Iphone at the start of the 2017–18 winter…",
        "text": "I wanted to share a small series of photos I took with my Iphone at the start of the 2017–18 winter season. All photographs are taken throughout a 24-hour period all over Chicago-my current home. From Jefferson Park to the Loop, I aimed to capture the beauty the city gives us even in some of its worst conditions."
    },
    {
        "url": "https://medium.com/38th-street-studios/may-we-have-your-attention-please-how-to-market-to-millennials-1eae0e3e119c",
        "title": "May We Have Your Attention, Please: How to Market to Millennials",
        "text": "Capture the attention of Millennials with these marketing tips.\n\nMillennials (like most consumers today) have virtually any information they want at their fingertips. Because of this, it is vital for brands to be honest, authentic and transparent at all times. Millennials are being bombarded with thousands of messages every day, so providing them with a holistic and positive experience will set your brand apart from the crowd.\n\nThis group of consumers is extremely susceptible to influencer marketing and positive word of mouth. Focusing on user-generated content to help tell your brand story is the best way to increase organic audience engagement and reach. Contests, giveaways, influencer campaigns and guest bloggers are all excellent ways to let your audience become the star of the show.\n\nTo Millennials, social is everything. Not only is it how they choose to interact with brands, it’s also how they choose to share brand experiences with others — both positive and negative. A strong social presence is a must for brands looking to engage with this demographic. But, it’s not enough just to post on social, you need to be sharing rich content, encouraging organic engagement and making sure that all content you share is optimize properly for social sharing.\n\nMillennials care about a brand’s purpose, mission and impact on the world. Unlike older generations who care more about product features and benefits, younger generations want to know the whole story. What makes your brand different from others? What solutions do you offer to their problems? How are you impacting those around you? These are all questions Millennials want answered.\n\nListening to your consumers can be truly helpful when trying to figure out how users feel about your products as well as understand how they operate. Do they love it, hate it, wish some features could be changed? Millennials can, and will, tell you how they feel — you just have to be willing to listen.\n\nThis generation cares more about organic experiences rather than a hard sell. Aside from trust, Millennials find traditional ads annoying — pop ups, display, social media and YouTube ads are not very popular with this generation. To reach Millennials you have to focus on organic content that is honest, impactful and worthy of a share.\n\n7. Let Them Come To You\n\nIn today’s world, consumers want to seek out a brand, not the other way around. With unlimited information at their fingertips, Millennials prefer to make purchases on their own terms. Educating your consumers, relying on positive word of mouth and online reviews, and sharing content that matters will all help Millennials seek out your brand when they are ready to shop.\n\nIf you do plan on using ads to market to this generation, make sure they are timely and relevant to each individual user. Nowadays, consumers expect all ads delivered to them to be customized to their wants and needs — not just a generic ad for all users to see. Whether it’s a social media ad, email campaign, or on-site lead generation strategy, make sure the content you are delivering makes sense for each user."
    },
    {
        "url": "https://medium.com/38th-street-studios/developing-a-custom-cms-phase-i-4562b01e879b",
        "title": "Developing A Custom CMS — Phase I – 38th Street Studios –",
        "text": "As businesses, big and small, look to increase operational efficiency, the ability to create tailored tools becomes increasingly valuable. 38th Street Studios was contracted by D2K Traffic Equipment & Design to develop an internal web portal with the goal of increasing internal efficiencies via automation. The scope of the web portal continues to continually increase, however phase one included building a way to track purchase requisitions through the chain of approval. Originally, this process was handled with multiple pieces of paper that were passed up the chain of command. This standard process often had problems, such as finding lost requisitions, lack of approval with absences and difficulty with clear communication about a requisition being ordered, shipped, expected or delivered. Bottom line, this process needed to be streamlined, digitized and automated.\n\nThe development of this portal was not a one-time build, but instead was the start of a much larger portal, which would streamline all operational processes. With that in mind, our team wanted to build a foundation that would allow for expansion into additional modules while allowing interconnection between them. To allow for easy expansion and quick setup, we decided to move forward on a tech stack that consisted of Firebase, Python Flask and AngularJS. This stack allowed us to accomplish tasks quickly with an end UI/UX that was simple and easy to use. Specifically, using Firebase and Angular allows for a webpage that does not need to be reloaded for uploads, displaying the most up-to-date information to every user.\n\nTracking purchase requisitions is a relatively easy task at first glance, however this project had many hurdles along the way. The approval chain for a particular purchase requisition (from creator to approval and finally purchase) wasn’t linear, but instead a tree structure. This process needed to be handled through a user permissions setup that gave flexibility for various combinations of tasks. D2K also requested the ability to make notes just as they would on a standard piece of paper, so we incorporated a real-time chat feature in this tool, as well.\n\nNow deployed, D2K uses the system to find kinks in the chain of approval, decrease man-hours spent tracking purchase requisitions and has an improved way to track cash flow. In fact, time spent on every purchase order was reduced by 90 percent with the implementation of this tool. Additionally, D2K enjoys the benefit of being able to approve requisitions from any computer, reducing “stuck time” in the approval process.\n\nTake a look at what D2K Traffic Equipment & Design has to say about their new Purchase Order Tool:\n\n“D2K Traffic has integrated the Purchase Order Tool that 38th Street Studios development, and our entire business has experienced positive results. Our purchasing department is working at double the efficiency and our managers creating the requisitions are able to do so with much more ease. Our cash flow reporting is aided by a better detailed purchasing system and tracking the purchase order approvals has never been easier. This tool is a game changer for any business that has a requisition system with an approved vendor list, cash flow tracking, and purchasing approval rankings. It’s a must have!”"
    },
    {
        "url": "https://medium.com/38th-street-studios/four-linkedin-mistakes-your-business-may-be-making-1c10af30e021",
        "title": "Four LinkedIn Mistakes Your Business May Be Making – 38th Street Studios –",
        "text": "LinkedIn has no doubt become the most popular professional network in the world. Used primarily as a way to showcase your business or professional experience, LinkedIn also acts as a great way to interact with followers or customers, and connect with others in your industry. Is your business using LinkedIn to the best of its ability? Check out these four LinkedIn mistakes your business should avoid at all costs.\n\nTo have a well-rounded social media strategy, and to gain conversions, it’s not enough just to have a personal profile on LinkedIn — you need one for your business, too. Many businesses tend to focus on having a strong presence on Facebook, Twitter or Instagram, and often neglect their LinkedIn account — or forget it all together. If your business has a Facebook or Twitter profile, chances are that it could greatly benefit from having a LinkedIn profile. LinkedIn has the highest visitor-to-lead conversion rate of any social network — about 2.74 percent. That’s almost three times higher than both Twitter (0.69 percent) and Facebook (0.77 percent). Bottom line, a LinkedIn profile serves as a great way for your business to connect with industry leaders, learn more about your competition and connect with your audience on a professional level.\n\nSo, let’s say that your company does have a LinkedIn profile — when’s the last time you posted on it? A few weeks ago? A month? If you’re going to take the time to develop a LinkedIn profile for your business, make sure you have time to dedicate for regular posting, updating company information and interacting with your followers. Having a blank LinkedIn profile is almost worse than having no profile at all. Try to post to your profile at least once a day, and encourage your employees to interact with and share your content. In addition to posting, also make sure that your profile picture, header image, company information and services are all filled out correctly so that profile visitors can get a good sense of your business and company culture.\n\nWhat’s great about LinkedIn are the professional connections it allows you to make. Any employees that have a LinkedIn profile should be listed on your page — your employees should also tag your company profile on their pages in their work experience section. This allows visitors to connect with your company or employee pages, learn more about your business and build a stronger relationship.\n\nMany companies tend to think that just because they don’t work in a creative environment, that posting videos and photos isn’t necessary. WRONG. While your products may not be particularly visual, you can still include photos or videos in each and every one of your posts. Try posting video testimonials of satisfied customers, sharing photos or videos of company parties or conferences, or even creating infographics for your products and services. There are so many ways to engage your audience with visuals regardless of your industry.\n\nNow that you know how to up your LinkedIn game, get out there and show your followers what you’re made of. Happy linking!"
    },
    {
        "url": "https://medium.com/38th-street-studios/what-is-influencer-marketing-9823a15fdf8e",
        "title": "Why Influencer Marketing Rocks – 38th Street Studios –",
        "text": "Influencer marketing is a type of marketing that involves brands partnering with key industry influencers to promote their products or services. Many brands find influencer marketing to be a beneficial way to get the word out about their products without having to spend a lot of time and effort marketing to the masses, but instead letting the influencer promote the brand naturally to their fan base.\n\nSeeing as how most key influencers have a strong social media following, influencer marketing commonly involves some kind of social media or content marketing campaign. Tapping into an influencer’s followers is an amazing way for brands to expand their audience and get their brand in front users who are likely to be interested in their products.\n\nIf done right, an influencer marketing campaign has the power to completely revolutionize and reenergize a brand. Take a look at these top Influencer Marketing Campaigns that completely changed the name of the marketing game last year.\n\nSo, why should brands consider diving into influencer marketing? Well. here’s why.\n\nNo longer can brands simply bombard consumers with marketing messages in hopes that they are listening. Consumers do not want to be “talked at” by brands, but instead prefer to be “talked with”. Modern-day consumers are looking to build relationships and create a sense of community with brands, wanting to partake in conversations with the companies they are purchasing from. That’s where influencer marketing comes into play.\n\nNot only does influencer marketing involve creating organic conversation between a brand and its audience, it also takes into account the power of product reviews and referrals.\n\nInfluencer marketing is the perfect solution to solving this marketing gap by allowing real people to talk about their experience with products. It’s real, it’s authentic, and because of that, it is now more successful than ever before.\n\nInfluencer marketing is now making its name known as the most cost-effective customer acquisition method. Studies have shown that for every $1 spent on influencer marketing, brands tend to receive an average of $23 in return. Influencer marketing has also been shown to generate as much as 11 times more revenue than other digital marketing strategies, such as banner ads and other paid advertising.\n\nWhy does influencer marketing have such a great ROI? Simple. Influencer content is eternal, unique and authentic. Unlike paid ads where a brand’s message disappears after they stop promoting it, influencer content, such as blogs, social media posts and product reviews, continue to drive value even after the initial promotion stops. Why is this important? According to MDG Advertising, 70 percent of consumers want to learn about products through content as opposed to traditional ad methods. Consumers are tired of paid advertising, and instead want real life content — which is exactly what you get with influencer marketing.\n\nBrand influencers are very diverse in terms of age, content, social media followers, etc. Because of this, brands have a diverse set of influencers to choose from. This is beneficial for brands that are looking for a specific type of brand influencer, maybe someone from a specific industry, or someone of a certain age. Some brands may select one large influencer to market their product to the masses, while others may select several smaller influencers to target a small, but highly engaged, group. Having such diverse channels gives brands many options for achieving their marketing goals.\n\nBuilding a strong influencer marketing campaign can help brands increase their social media shares, engagement and reach, which in turn can increase website traffic, as well as help to build a strong link profile. The more social media shares a company receives, the more a brand’s quality content is being seen and the more backlinks being created, which is a major player in building a solid SEO strategy. According to MOZ, receiving backlinks from other high-authority domains is the number one factor search engines consider when ranking a site.\n\nInfluencer marketing is an extremely beneficial way for brands to market to the masses without having to spend a lot of time and money doing so. Influencer marketing allows brands to tap into preexisting communities that would be interested in their product, and advertise to them in a new and unconventional way, improving a brand’s ROI and aiding in building a strong SEO strategy. Bottom line, influencer marketing is almost always a win!"
    },
    {
        "url": "https://medium.com/38th-street-studios/top-facebook-metrics-to-track-86cc30b20f66",
        "title": "Top Facebook Metrics to Track – 38th Street Studios –",
        "text": "Nowadays, most businesses understand the importance of having a strong social presence. But, what most businesses still lack is a thorough, well-researched social strategy.\n\nSo, how exactly do you build a social strategy? It all starts with analytics. Measuring your social media presence and analyzing your metrics allows you to determine exactly what’s working and what’s not, and lets you focus your efforts on strategies that have proven results.\n\nHere are some key Facebook social media metrics you should be tracking:\n\nClick-Through-Rate (CTR): CTR is an important metric to measure because it lets you know how successful your content is at engaging your audience. And when paired with Facebook Pixel tracking for ads, you can track your CTR as it relates directly to conversions. You can also dive a little deeper into your social media CTR by looking at website bounce rate. Bounce rate refers to the percentage of visitors who leave your website after only viewing one page. Tracking the bounce rate of visitors from social networks allows you to compare that rate to website users who visit your site either directly or from another source. If your social media website bounce rate is lower than other sources, you can report that social media is driving the most valuable traffic to your website.\n\nFollower or Likes Growth: Is your audience base consistently growing? Understanding your audience growth rate is important to know when determining whether or not your social media strategy is working. If you are truly bringing value to your audience with rich, meaningful content, then it is only natural that your audience will continue to grow. If this is not the case, it may be time to take a closer look at your strategy.\n\nIn the Insights section of your Facebook page, you can track your page likes growth. Facebook will show you your likes, unlikes, organic or paid likes and net likes in a simple graph format. Here, you can visually see if you are gaining or loosing likes consistently.\n\nConversation (Engagement) Rate: What’s the point of posting if no one is engaging with you? In order to gain insight about who and how many viewers are interacting with your content, try tracking your conversation rate (a metric created by Avinash Kaushik). Your conversation rate is the ratio of comments per post (or per month) to your overall number of followers. This metric tells you exactly what percentage of your followers feel compelled to add their voice to your brand or to interact with your company socially.\n\nIf you’re looking at your engagement rate per post, you can then use this metric to predict how much engagement you will receive (on average) with different post types, audience members or time of day.\n\nReach/Impressions: Reach is the potential number of audience members you are able to communicate with. Impressions are the actual number of times a user saw your messaging — keep in mind that impressions will most likely be larger than reach because users can see the same message multiple times. These metrics are important to understand as they relate to engagement rate. If you are receiving high reach and impressions but have below average engagement rate (average: 1.92 percent), you may want to reevaluate your messaging and determine how you could better be engaging your audience.\n\nConversions and Leads: Because these metrics are directly correlated to revenue, conversions and leads are probably two of the most important social media metrics you can track. Facebook makes it easy to track conversions with their Facebook Pixel Tracking which allows you to optimize and manage cross-device conversions, as well as set up custom conversions that let you track basically any action on your website — button clicks, page visits, content views, you name it.\n\nMeasuring leads is also a great way to show social value. Generating measurable social media leads can be achieved through social media only promotional codes, gated content, contest or campaigns and hosting social media events. Just make sure that any links or information you share is trackable within your analytics software, like Google Analytics.\n\nTop Content: This metric speaks for itself. In order to best optimize your social strategy you need to know what content performs best with your audience. Because managing all social platforms is a full-time job, you should only focus your efforts on producing content that generates measurable results."
    },
    {
        "url": "https://medium.com/38th-street-studios/how-to-inspire-creativity-in-your-employees-8c6298c0ac82",
        "title": "How To Inspire Creativity In Your Employees – 38th Street Studios –",
        "text": "Creativity isn’t just important for artists and musicians, it’s important for all employees — no matter what their job role may be. If you want your employees to come to work feeling energized, excited and ready to tackle the day, you need your employees to continually be at their creative peak.\n\nWhy? Applying creativity to working tasks allows your employees to unlock untapped potential, increase problem solving and team working skills and get them genuinely excited about killing it at work. And, happy, creative employees equals increased productivity and business moral — it’s simple! Here’s how to inspire creativity in your employees today.\n\nThe typical 9 to 5 work day is no longer a mandatory requirement for most employees — you need to provide your employees with some degree of flexibility to accommodate all types of people. If you want your team to feel in control of their work schedules, offer them flexible hours, work-from-home opportunities or even unlimited vacation time. Studies have shown that flexible work schedules lead to higher rates of overall productivity and higher job satisfaction. The concept is simple, really. If employees are not fixated on punctuality, their minds are free to explore their boundaries and come up with abstract ideas that could ultimately help your business.\n\nIt’s not enough to just to encourage creativity; you have to be willing to listen to the creative solutions your team has developed. Build an environment where talking about and listening to new solutions is encouraged, and one where employees will be feel empowered to think outside of the box.\n\nAllowing employees to take breaks is also linked to increased productivity and job satisfaction. Building scheduled breaks into your work culture alleviates some of the pressure of continuous work, allowing your team to approach their work in a more relaxed, creative manor. Breaks also allow employees the opportunity to engage with each other on a personal level, which is another great way to foster office relationships and build a positive moral.\n\nStyle is the ultimate form of personal creativity. Letting your employees dress how they feel most comfortable or self-expressive, sets the standard for the type of creativity you are looking for in the work place. Of course you will have to provide some boundaries on appropriate attire, but allowing for a more flexible dress code can do wonders for your team’s creative vibe."
    },
    {
        "url": "https://medium.com/38th-street-studios/the-basics-of-app-store-optimization-aso-f966381c15bd",
        "title": "The Basics of App Store Optimization (ASO) – 38th Street Studios –",
        "text": "With so many apps out there, now more than ever, it is important to keep your App Store Optimization (ASO) on it’s A game. In order to do so, there are five key areas you should focus your efforts on — let’s take a look.\n\nAll app publishers are required to choose how to categorize their app. Categories allow users to better narrow down their search to specific industries, so it is extremely important that the categories you choose are relevant to your app, but also ones you can easily compete in. In the iOS App Store, publishers can choose a primary and secondary category, while in the Google Play Store only one category can be chosen. For the iOS App Store, the primary category is the most important, and is where the app will be displayed in search results and top charts. But keep in mind that the app will appear under both the primary and secondary categories in the Explore tab, so you want to make sure that your second category is relevant, as well.\n\nHere are a few questions to ask when picking your categories:\n\nFor best results with ASO, including keywords in your title is a must. Titles in the app store can be as long as 225 characters, allowing for plenty of keyword variations. A study recently conducted by TUNE showed that more than 50 percent of apps use keywords in their title, and that apps with keywords in their titles receive a 10.3 percent increase in the their rankings. One great app example of this is Zillow — who is targeting the keywords “real estate”, “homes for sale”, and “for rent” in their title.\n\nBefore choosing the right keywords for an app, you need to develop a list of potential keywords that users could use to find your app. Try visiting the top apps in your category to get a better idea of what keywords and phrases are currently being use. Keyword planner tools are a great resource to use when conducting research on the best keywords to choose. These tools will show the competition for each keyword, search volume and suggested keywords. Just like the categories, you want to choose keywords that are relevant to your app, but aren’t too competitive. You’ll want to include these keywords in your app description and title.\n\nThe screenshots you use on your app profile help showcase the core features and benefits of your app. Each screen shot you choose for your profile should be relevant, engaging and help explain key features to users. You can include five screenshots in the iOS App Store, and eight screenshots in Google Play. It is to your advantage to fill all the spots to maximize your app’s visibility.\n\nKeep in mind that the first two screenshots on your profile are the ones most visible to users, so be sure that they are especially engaging. Uber does an excellent job of using their screen shots to tell a story and peak user interest.\n\nReviews play a large role in app ranking, so you want to encourage users to leave reviews as often as possible — without being too pushy. Direct app feedback is a great way to get user opinion while users are currently interacting with your app. If users say they are unhappy with the app, your next response should direct them to give feedback on ways to improve the app. If users are happy with your app, encourage them to leave a review on your profile. You can also include an app review plug-in so users can rate your app without ever leaving it. Don’t forget, you can always reach out to trusted peers or beta testers and personally ask them to download and review the app, too."
    },
    {
        "url": "https://medium.com/38th-street-studios/exploring-stochastic-gradient-descent-with-restarts-sgdr-fa206c38a74e",
        "title": "Exploring Stochastic Gradient Descent with Restarts (SGDR)",
        "text": "This is my first deep learning blog post. I started my deep learning journey around January of 2017 after I heard about fast.ai from a presentation at a ChiPy meetup I attended (the Chicago Python user group). It was my first introduction to the topic and the only thing I knew about neural networks before were simple multi layer perception (MLP) models that acted as decent non-linear approximators for various prediction problems. Once I started my first couple of lessons, I was completely hooked on the amount of knowledge exploding about his subfield, especially because I had recently received my masters degree in analytics and was trying to stay up to date on becoming the best data science practitioner I could be. I am currently going through the third fast.ai course, which is part1_v2 using a framework built on top of PyTorch. One of the very important skills I have been picking up from these courses is the ability to decompose research papers that are coming out in the field and understanding / implement them. One of the interesting concepts I have seen come out is the idea of Stochastic Gradient Descent with Restarts, or SGDR.\n\nBefore, we get too far into SGDR, let’s first briefly cover what is the idea behind normal stochastic gradient descent and why do we use it.\n\nIn deep learning, you may have an architecture that may have millions of parameters and those millions of parameters are connected via functions that take some input and try to predict the output. When training a model, we know what the output should be since we pre-label our data. This leads to the idea of a “loss function”, that is essentially a function that attempts to measure the deviation of our prediction to the actual value we know is correct. Some common examples of loss functions include Mean Squared Error and Log Loss.\n\nYou can think of the entire idea behind deep learning as setting up some loss function and trying to update the many parameters the model has in some non random way to minimize this loss function.\n\nVisualized, you can see the example to the left that with 2 parameters we have some non linear loss function. If our parameters happened to be initialized to the blue dot, then we need a way to move around parameter space to the lowest point. This is where the idea of gradient descent comes in as our method to update our parameters and “search” for where the lowest point is. There are many different methods of applying the idea of gradient descent for this search such as Momentum, Nesterov, Adagrad, AdaDelta, Adam, and more. Each of these has slight nuances to how you take your next “blind” step around this hilly terrain. I won’t get too far into the math behind gradient descent and those various optimizers, but if you are interested, you can find a superb explanation of the math here. What all of these optimizers do have in common though, is that they use a technique called “annealing” for the learning rate (how small or large of a step to take), which essentially says that we can adjust our learning rate the more we train.\n\nTake for example this picture where the red line is the loss function. If we start at the point (3,9) and say we are going to find the direction of decreasing loss and take a step of 2 in that direction, the first step we take we will end up at (1,1). That’s great, but let’s say we take another step following the same rules, we now end up at (-1,1). And if we do the same rules again, we are back where we just were at (1,1). If we adjust our step size smaller as we get closer to this minimum, we can eventually end up closer to (0,0), which is the actual minimum.\n\nThese optimizers all follow their own pattern of finding this minimum loss by giving rules on how to adjust their step size, but what if we get stuck in a local minimum of this function? Even though some optimizers try and use ideas of momentum to have the ability to swing out of a local minimum, they are not always that successful. So a possible solution? SGDR\n\nThe idea behind SGDR as shown in this image is, instead of trying to add various forms of learning rate decay, let’s reset our learning rate every so many iterations so that we may be able to more easily pop out of a local minimum if we appear stuck. This has seemed to be quite an improvement in various situations as compared to the normal SGD using mini batches.\n\nAn idea to take this further is that that since we know we will most likely get closer to a global minimum the more iterations we do through our dataset, we need a way to lengthen the time spent decreasing our learning rate. Instead of restarting every epoch, we can lengthen the number of epochs in a multiplicative way so that the first cycle will decrease over the span of 1 epoch, the second over the span of 2 epochs, and the third using 4 epochs, etc. This can be visualized by taking the above graph and just stretching each decrease cycle out to twice the iterations as the previous decrease cycle. This tends to perform even better in comparison to the normal SGDR from above based on a couple of experiments I’ve tested.\n\nHopefully this helps to show that many of these cutting edge ideas that are making deep learning models perform better are relatively small modifications on the base methodologies, are easy to understand, and are fairly easy to implement."
    },
    {
        "url": "https://medium.com/38th-street-studios/seo-trends-coming-your-way-in-2018-2ed221ec522a",
        "title": "SEO Trends Coming Your Way In 2018 – 38th Street Studios –",
        "text": "Staying on top of changing SEO trends is a must if a website wants to see any sort of return on their investment. Not only can using outdated techniques result in penalties that could drag down a website’s ranking, but it also decreases the chance for organic website engagement. So, as 2017 comes to a close, here are some SEO trends to be on the lookout for in 2018.\n\nAccording to Google, 20 percent of mobile search queries are reported through voice search — this percentage is only expected to increase in 2018. Voice search presents a great opportunity for changing the way online users interact with your brand, but only if you’re taking advantage of this growing trend. The rise of voice search brings out the need for businesses to focus on optimizing their website for more long-tail keywords, as well as natural language that matches a conversational tone.\n\nBottom line, brands should think about how the average user would vocally search for products or services related to theirs. If your business currently uses Google Adwords, be sure to review the search terms users are using to seek out your website. This will give you a better idea of the types of keywords (both long and short tail) that are triggering your ads / website to rank.\n\nThe Internet has become increasingly more visual. Platforms such as Instagram, Pinterest and Google have already paved the way in developing visual search engines that engage and retain users — businesses need to think about doing the same with their websites. A strong SEO strategy in 2018 needs to consider the ways users consume visual data, and how search engines crawl, index and rank visual content.\n\nSome great ways to boost SEO for visual search include, creating engaging visual blog stories that encourage social sharing, developing a strong video marketing strategy, and reposting and repurposing content on a regular basis.\n\n2018 will be the year that brands will truly realize the power of putting mobile first. And, if 2018 is the year that Google deploys its mobile-first index, optimizing for mobile will be more important than ever! But, don’t freak out just yet — a mobile-first index does not mean that desktop content will stop ranking. It simply means that search engines will look at mobile content first when ranking a website. So, if your website is mobile responsive and contains the same content (or similar content) to that of your desktop design, you’re definitely on the right track. But, if your website is not mobile responsive, make sure that all primary content is on your mobile site or you will risk a negative impact for your brand.\n\nA featured snippet is a summary of an answer that is displayed at the top of Google’s search results, and has quickly become a source of major competition for companies trying to appear in “position 0” in search results. Featured snippets can be either in paragraph, list or table form, and has the potential to increase website traffic by more than 20 percent. With such great results, this brings out the need for businesses to optimize their site’s content to meet Google’s standards for featured snippets.\n\nOne way to optimize for snippets is to focus on content that serves as a quick answer. A majority of current featured snippets serve to answer a question in a more appealing way, so following a “what”, “how” or “who” structure is a good place to start. According to recent studies, Google’s Answer Box can see a CTR of more than 32 percent, so optimizing your content to fit this criteria could be a major win for your brand.\n\nBuilding valuable backlinks is one of the main ways Google measures a website’s trust — this tactic will only become more prominent in the years to come. Google attaches great value to quality inbound links, so the more high-quality backlinks to your website, the more reliable and trustworthy your website will seem, ultimately increasing your chances of ranking high in SERPS. But, take note that your backlinks must also be trustworthy and contain high quality content related to your site’s overall theme. Backlinks that are spammy or not related to your industry could actually hurt your ranking. Remember, quality is always better than quantity when it comes to your backlink strategy.\n\nAnd dont forget, just as you need backlinks to lead people to your website, you need to be leading people to other sites, as well. Including quality outbound links to popular industry websites is another great strategy in helping to increase your backlinks."
    },
    {
        "url": "https://medium.com/38th-street-studios/the-move-to-serverless-digital-ocean-heroku-aws-oh-my-ea5224a8d4bb",
        "title": "The Move to Serverless… Digital Ocean, Heroku, AWS, OH MY!",
        "text": "I have vowed to try and write more about what I am doing in the technology space from day to day, but this is actually something that we have been experimenting with at 38th Street Studios going awhile back now and I’m just documenting it now. This idea is around the new craze and buzz surrounding “serverless computing”, “serverless architecture”, “the cloud”, etc.\n\nFor the longest time, we had always used Digital Ocean for droplets that we spun up and hosted everything from marketing websites to web apps on. It was great for learning, plus you had complete control over everything That was great, however, a downside was… you had complete control of everything…. For example, as some of the projects we made began to get more traffic and scale, our droplet was getting pounded by more traffic than it could reasonably handle, not to mention having to take the time to understand and debug items like nginx and firewalls. To scale, we set up a droplet to act as a load balancer and distribute the requests it received to other droplets that had replicas of the same code base on it, which all talked to a database that we had to have a failover and automatic mirroring on. At the end of the day, our bill was high, we were debugging dev ops, and doing everything except making progress coding.\n\nThis is when we found out about Heroku. Ah yes, I remember the day when I read their homepage for the first time and all of my dev ops concerns were all of a sudden lifted off my shoulders with their free package. If we wanted to upgrade, it was only $7 a month per app! No more were the days of writing automation code to replicate code across servers, debugging ssh keys not being up to date on new servers, and setting up failovers ourselves. You just simply specify your launch command for your framework to start the server, include a requirements.txt file for python projects, push to your normal github repo, and deploy from github. It seemed so magical, with autoscaling servers, easy add ons (many of which are free) all within a single button click. However, still with them taking care and optimizing all of the dev ops for our apps. It was cheaper, but we were still paying for servers during non peak times and provisioning new autoscale servers was cheaper on time and money, but still more money than we wanted to be paying. Then came the era of acceptance of AWS and a serverless architecture.\n\nI want to note real fast, that we still use Heroku for certain things. It is really nice for having all of your operations and items in a single, fully managed dashboard. AWS does have a bit of a learning curve to it, so if you have someone with experience, or you want to gain experience yourself, it can be well well worth it. Just be prepared to bang your head against a wall for about 8 hours a week for your first month, but as technologists that’s sort of our thing so you are semi prepared already.\n\nAWS came on to the scene, revolutionizing the cloud computing game with their EC2 instances. You could spin up servers with a ton of flexibility and turn them off and on as you pleased. They also introduced Elastic Beanstalk, which allowed you to think about your app as a project and it took care of spinning up load balancers and autoscaling groups with EC2 instances. This is great because you get a similar idea like with Heroku (I still think Heroku is actually easier to work with than Elastic Beanstalk) while also having access to customize every component of the dev ops to your liking. However, something truly magical happened a couple of years later….. Lambda was born, and now introduce the realm of “serverless” computing.\n\nAWS Lambda is what is known as Functions as a Service (FaaS) and unlike an EC2 instance where you are paying whether your server is idle or is doing processing, with Lambda, you only pay for the compute time you use. One more time, YOU ONLY PAY FOR THE COMPUTE TIME YOU USE. Being a data scientist, this sounds amazing because now instead of using something like Flask on a normal server to serve different types of models, I just put it in Lambda and ping it via API Gateway and I cut my operation cost in a fraction! Woah woah woah, API Gateway…. What’s that???\n\nSo before I get into API Gateway, let me briefly mention how AWS is structured. AWS can be thought of as a suite of different dev ops microservices that each have a unique name, which can all be connected to one another easily. In your AWS account for example, you can get access to DNS setup via Route53, unstructured storage with S3, a simple virtual server with EC2, a load balancer with Elastic Load Balancer, and many, many more. Go in the console and look at all of the services. Before long, you will forget the first half of the list before you can finish the second half.\n\nNow that we know the basics of AWS, API Gateway is simply what its name states. It can be configured to accept http requests along with provisioning different api key credentials, set up paid api plans, easily do rate limiting, etc. The main feature that we have been using is triggering lambda functions and returning the responses.\n\nSo now that we briefly talked about some components that can be used in a serverless setup of an application, what is a full example?\n\nThe components that we will be talking about at a high level:\n\nYou can think of S3 sort of like a more flexible Dropbox or Google Drive. It does have some nice properties such as advanced permissioning and being able to archive old data to cheaper storage in what is known as Glacier if you don’t need fast access to it. The feature that we have started to really use though is it’s ability to host websites. It can be configured to serve a “static” website, which a couple of years back would mean that you can put a nice 1 page marketing site on here with an index.html page and some javascript. Because there isn’t really a webserver though, you didn’t have the nicities of routing out of the box for your url. However, we started adopting React for our web framework of choice, which using the single page app (SPA) concept, we are now able to use S3 to serve an entire web app!\n\nThis is great if your users hit the index page and then start navigating around your site, however, what if we want to allow users to go directly to a certain page that isn’t the index? Introducing CloudFront!\n\nCloudFront serves a couple really great purposes, but it is not completely intuitive right away on how to use it appropriately. CloudFront is a distribution network that allows you to cache your files on servers closer to your audience all around the world. What this means for you is that your site will load faster in addition to another concept that blew my mind, IT’S CHEAPER THAN JUST USING S3!!! By using this, you also can catch and redirect certain errors as well. For example if someone goes to yoursite.com/page2, you can add an Error Page that redirects them to your index.html, but it will then render your second page instead of the index. At first it feels sort of hacky, but it works perfect.\n\nGreat so now that we can serve our single page app, without a server, what do we do about a database? Depending on the size and use case of your project, we have found Firebase to be an incredible tool for various projects.\n\nFirebase is one of the quickest ways to get web and mobile apps up and running. They were acquired by Google a couple of years back and revamped a ton of their system to make it extremely fast to get up and running. They do this by already having some prebuilt items such as Authentication, linking of different auth accounts like Google, Twitter, etc., a robust api wrapper for numerous languages, and a scalable data solution that is lightening fast and REALTIME. For example, if you are building a transportation application and you want to monitor the movement of vehicles around a city, simply have the updates of the locations saved up to firebase via mobile app and if you are loading the data on a map for example, you’ll get updates pushed to your page automatically via their api. That means no configuration of webhooks, websockets, or apis and you have what would be considered a difficult engineering problem if done by scratch up and running in no time at all. Firebase is great for prototypes as well as web apps that don’t need massive scale because you get a ton of usage without ever leaving the free tier.\n\nAnother component to make this all work is Route 53, Amazon’s DNS service.\n\nRoute 53 is just a DNS service so you can really use anything you want to for this. We just chose it so that we could have all of our components in one place as well as have nice linking between everything since you can choose Route 53 domains you have set up easily from CloudFront. Also, you can get free SSL certificates, which is always nice as opposed to the archaic services still charging outrageous amounts for SSL like it’s still the 90's.\n\nAt this point, we have a pretty great stack in terms of extremely low cost and great performance with a modern feel. Even though there are a lot of articles out there about how front end programming is starting to become more and more full stack programming as compared to the php days, you will still have many tasks that you wish to perform server side. Right now everything is being done by our infrastructure components or by our front end React single page app and Firebase. To accomplish stuff server side in a “serverless” setup, we chose to use a package called Zappa for Python.\n\nZappa is an amazing package that allows you to write server side code like you are writing a Flask or Django application, but instead of using the web servers that come with these web frameworks, it takes the code in exact form and packages it up to be sent to the cloud for “serverless” compute. What I mean here is that it uploads and configures API Gateway and Lambda on your aws account with a simple 1 line command from the terminal. It also provides extremely simple configurations for scheduling lambda functions to fire on certain time schedules via CloudFront and storing extra files in S3.\n\nWe use Zappa to move code into production for doing things such as large batch processing jobs that happen overnight in some cases as well as building various microservices to power our applications. It also allows for extremely easy versioning and deployment of scalable models with api endpoints.\n\nYou will always want to pick the infrastructure that works for your use case and application. Hopefully some of the different options I have laid out here will help to inform various routes to go when trying to make those decisions as they all have their pros and cons. They all allow for learning different skills as well so if your on the path to become a unicorn / jack of all trades, try them all and more! Like I mentioned earlier, we still use a mix of these different solutions as well as mix and match different offerings of aws in various ways every day at 38th Street Studios.\n\nOne thing I didn’t go into much detail about in this post was database selection. That is for another time as I intend to discuss different options when it comes to applications and analytical database processing covering OLTP and OLAP options :)\n\nAlso, I’m a huge advocate of Docker for different deployment options as well, which I’ll hopefully be covering in another post too!"
    },
    {
        "url": "https://medium.com/38th-street-studios/creating-your-first-python-package-181c5e31f3f8",
        "title": "Creating Your First Python Package – 38th Street Studios –",
        "text": "This is my first blog post with hopefully many more to come, talking about how to create your first Python package and release it on PyPI. I’ve been writing software for my startup and for various ad hoc development projects for the past couple of years, however, after I put out my first package a couple of weeks ago, I realized there is so much one learns and sees the benefit of, that not writing code in a “good practice” way actually becomes more painful.\n\nBeing a data scientist first, best software principals weren’t always at the forefront of my mind when doing projects. After forcing myself to write tests and attempt to pick up more best practices, I find it being a mindset that I can’t believe I’ve lived without for so long. These are things learned from a small package, I put out in under 1 weeks too! For those of you who are interested, the package is called icd. I have also just released a second one called fastteradata, however, I accidentally got too excited and am currently in progress of writing the retroactive tests for it and doing a major cleaning of the code now.\n\nSome of the benefits of writing your first package, no matter how small, will be:\n\nEnough about the benefits, let’s get to it!\n\nFirst, let’s go through a very basic package example starting with the folder structure. A great resource for folder structure templates is a package called cookiecutter. There are many different templates to choose from, and you just pick one, call the command on a downloaded example, and in no time you have some basics filled out to get you started faster. In my case, I used the pypackage-minimal template because I wanted a simple skeleton and wanted to use pytest.\n\nAfter you use cookiecutter, you’ll want to make sure you have the following files, which we will go through each one at a high level. You can explore each one of these items in much more depth later on.\n\nGreat, now that we have the structure let’s look at actually writing some code. In your package_name directory, which from now on we will call animalsounds, let’s first start by creating an __init__.py file to represent the package. In that file, we can place something like:\n\nThis will be where everything gets imported for your users to access. In this case, we import the generator method from a file, sounds_generator. Now, create a sounds_generator.py file and place something like the following inside.\n\nYou’ll notice in this simple function that the doc strings are almost longer than the actual code logic. This is something that you will thank yourself in the future for a thousand times over. But now that we have our first python package function, what’s next?\n\nAny piece of code that you write, you should be writing with tests in mind so that you can better break apart larger functions into base components to hopefully get more reuse out of them. In this case, we wrote our package code first, however, you can also write your tests first, knowing your function can’t fulfill them and only then fill in the code until the test passes. There is a lot of great material out there for Test Driven Development (TDD) if you want to explore the philosophy behind it more. This is something that is a major level up in best practice coding that once you force yourself to do, everything seems so much easier.\n\nFor this example, we will be using pytest. So first, same as last time, within our tests directory, let’s place an empty __init__.py file. Next let’s write some tests! When using pytest, by default, it searches the tests directory for files and methods that begin with “test_” recursively. So let’s make a file called test_generator.py and place the following code in it.\n\nNow, with the following code, we have covered every case for our generator method. Pytest syntax for most tests will just be an “assert” command with your test of the function with known parameters compared to the expected behavior. The last test we wrote, we took advantage of testing even when we expect the function to raise an Exception case. This syntax in pytest is simply the line followed by an invocation of your method that should raise the exception. You can be more specific in these cases as well with specifying specific types of Exceptions.\n\nTo invoke the tests and see them pass, just cd to the root of the project and after making sure you have pytest pip installed, type in the terminal and there you go!\n\nNow that we have our code and our tests, let’s expand the functionality of our testing basis a little by introducing tox. Tox allows us to run through tests in multiple environments so that you can be sure your code will work with the differences between python versions as well as linux vs. osx. In our tox.ini file, let’s place the following code:\n\nThe above code essentially says we are going to try and test using python3.4, 3.5 and 3.6 environments lays out the dependencies, which in this case is just pytest and some code coverage libraries, and specifies the commands to execute in each environment. This is a great time to talk about code coverage.\n\nThe idea behind code coverage is to see what percentage of your code is covered by your tests. It gives a good idea of the confidence of deploying and trusting the methods you write can be repeatable and trusted. This is because the report comes back with a percentage vs. a normal build just having a pass or fail status based on if all 1 of your tests pass or all 1,000 of your tests pass. Codecov is a service that attempts to do just this. Pytest-cov is a package that allows us to generate the specified codecov reports from pytest, which you can see us invoking in the first command. Then the second command is what uploads the codecov report to the service so we can pull down the appropriate badge. When you set up your codecov account, you can sync up your specified github repo and are given a token for each repo. So when we run tox on our local machine, we will have to set the CODECOVTOKEN environment variable before running .\n\nUh oh, as you can see with tox testing the different python environments, you can see there is a syntax error for the python3.4 and 3.5 environments. That is because our package uses a new feature in python 3.6, the function string. We can either go back and change our package code for compatibility, or in this case, I like the clarity and syntax better, so let’s just remove the py34 and py35 environments in our tox.ini file.\n\nSo at this point, we have our package logic, our tests, multiple environments tests, and code coverage reports. Now what happens if others start contributing to our repo and someone edits code, but forgets to run tox or pytest locally before pushing to our repo? Bugs could be introduced and people who depend on your code now have things that break. This is where Continuous Integration (CI) comes in. For this, we will be using travis. What travis does is every time someone pushes to our github repo, we tell travis to run tests and generate new code coverage reports via tox and if something breaks the build, we can send off notifications alerting us of the tragedy. This then auto updates image sources for our code coverage and build passing/failing badges in our README.\n\nTo set up travis, we just connect our repo, insert our CODECOVTOKEN environment variable into the settings for our project, and we are good to go!\n\nSo now that we have all of the main code components for our new package, now we have to set the license, write documentation and example use in the README, and edit our setup.py file.\n\nFor the license, look up and pick out your favorite software license and just copy paste into your LICENSE.txt file.\n\nFor the README, use an online real time editor and try to write it in Rich Structured Text (rst) format with examples, docs, dependencies, installation instructions, etc. If you used cookiecutter, you should already have a nice template to work from.\n\nFinally, the setup.py file, you can follow a form like this:\n\nOnce we have all of these items, have pushed to github, have seen our continuous integration run our tests and generate the build passing and coverage reports, we can now upload our code to PyPI with confidence!! How do we get it up there though? Well, we are in luck because there’s a python package for that, and it’s called twine.\n\nTwine makes sure to package up and upload your code to the PyPI servers through a secure connection. You will have to also go on PyPI and create a user account before doing this, but after doing the one line twine command to register and upload, you now have your first package deployed!\n\nCongratulations! Try to pip install it and give yourself a pat on the back!"
    }
]