[
    {
        "url": "https://medium.com/@amolkhadikar/how-ai-is-making-us-smarter-27d82140e12f?source=tag_archive---------0----------------", 
        "text": "Two months ago, history was made when Google DeepMind’s computer program AlphaGo defeated Lee Sedol, a top world player at the game of Go. A board game of strategy, Go is orders of magnitude more complex than Chess. The victory, which came a decade earlier than expected was phenomenal for the field of Artificial Intelligence, but was it really a defeat for humans? Quite the contrary.\n\nIndeed, AlphaGo owes its victory to a number of scientists and engineers behind it who started working on it less than two years ago. However, we, as humans, have not only designed the AI but we have also grown smarter with it. The matches with AlphaGo seem to have inadvertently helped Lee improve his game. Lee has won every game that he has played since losing to AlphaGo. Why does it matter? Lee has been using innovative strategies that he has learnt from his opponent machine. He said in an interview, “My thoughts have become more flexible after the game with AlphaGo. I reflected on how weak the human intuition was. So I think my predictions of the next move have become more accurate when I play go”. It is an impressive example and yet an advance in just one of the applications of a vast field that is about to unfold its full brilliance. Consider a few more examples:\n\n· Robots have been found to help kids learn faster than before.\n\n· BMW and MIT researchers have found that humans working in collaboration with robots are more productive than either of them alone and reduce idle time by 85 percent\n\n· A deep-learning AI has been found to be better than doctors at finding cancer. Working in conjunction with physicians it can help in early detection of cancer.\n\n· A self-driving robot recently launched by Puma has been aimed at helping athletes improve their run by racing against them. It can be programmed to run at the athlete’s best speed, his rival’s best record or better yet, even Usain Bolt’s best speed (44 km/hour).\n\n· Surgeons have been automating surgeries on animals, getting involved when needed and focusing on more complicated procedures.\n\n· A web-service Textio has been helping recruiters write better emails and job postings by figuring out what they’re are trying to say and suggesting improvements within 0.3 seconds!\n\nI’m sure there would be many more such examples across industries. And these are still early days.\n\nYou’d notice that most of these products and services are still prototypes and are yet to enter mainstream adoption. As this wonderful Medium post shows, primitive forms of today’s mainstream technologies looked more like “toys” than serious applications. This is true of AI as well. Interest in AI is nascent and specialized fields of AI — like deep learning — look more like lab experiments today. However, they are poised to advance rapidly as technology makes large leaps and world interest in them grows (see Figure 1).\n\nNearly all large tech firms (Microsoft, Google, and Amazon et al.) have open-sourced their deep learning tools. Hardware that enables deep learning is much cheaper and faster than what it was just a year ago. Startups’ interest is at its highest — AI is the most popular term in Y-Combinator applications this year, and interest in AI has spiked in the last couple of years (see Figure 2).\n\nAs the AI tech evolves, it is bound to leave an indelible mark on human intellect and performance. It is fascinating to see that AI, even in its infancy, is making us smarter and more intuitive. Imagine the positive reinforcement it will grant us as it matures.", 
        "title": "How AI is Making Us Smarter – Amol Khadikar –"
    }, 
    {
        "url": "https://medium.com/@esh09r/artificial-intelligence-a99be80122e9?source=tag_archive---------1----------------", 
        "text": "Not long ago I didn’t know what that was. Honestly, its been about a week now. Not that I haven’t heard about it, not that I haven’t seen Ex Machina, not that Siri doesn’t respond to me. Its just that I don’t think the majority of people understand the current climate and future implications of AI. I’m not going to pretend that I do, but I know more now that I did last week. Heres to hoping that next week ill know more than I do today.\n\nI’ve always hated driving. It’s a big reason why I live in New York. Its way more dangerous than any other mode of transportation, yet I don’t know if anybody feels the same emotion getting into their car every morning that they do when a plane is taking off, or especially when it hits turbulence (which never actually crashes planes). There is a big difference between perceived danger and actual danger. Perceived danger makes people think self-driving cars are dangerous, deep learning is terrifying and drones are watching after their kids. Once more, all of these things are now coalescing in the not-too-distant future and coming like a tidal wave. The reality is not many things move in tidal wives, its only once the tide is too high do you mistake it for one. Artificial intelligence is already in your car (thats the “A” in “ABS”), its already in your phone (Siri) and its already in your manufacturing (Amazon bought Kiva for $775m 4 years ago).\n\nIf you haven’t been paying attention this election cycle, fear drives a lot of irrational thoughts and actions. The core fear of the blue collar worker concerning AI is that it will displace their job. Just like those guys in China and India did. They might be right, and if they are, the Chinese will probably lose those same jobs eventually. Regardless of nationality, there is an inflection point where if a robot is 15% cheaper than a human it will take over that function. However, historically technology has always created more jobs than it has displaced. I know that my job didn’t exist 20 years ago, and my entire industry didn’t even exist 10 years ago. Maybe those victims of globalization will find new jobs spawned from our nascent AI ecosystem, but im not sure those blue collar folks are applying to be the next machine learning dev at Facebook, or will even be qualified to be a janitor there when that time comes.\n\nI, for one, am not afraid of the coming shift towards AI. Likely due to the inevitability or perhaps thoughts that its already here. I think adoption and advancement will be faster than anticipated — its going to be an interesting remainder of the decade.", 
        "title": "Artificial Intelligence – Erik Hellquist –"
    }
]