[
    {
        "url": "https://medium.com/@semanticmd/introducing-semanticmd-cloud-80784a28e1d6?source=tag_archive---------0----------------", 
        "text": "If a Unix terminal isn’t your preference, we still got you covered. The SemanticMD Dashboard gives you a simple place to train and test your image analysis algorithms — with no coding required. Within the dashboard you’ll be able to quickly determine the accuracy of your image analysis apps and get insight into how you can improve it.\n\nSemanticMD Cloud solves a broad range of use cases ranging from basic medical image classification to tracking complex objects in videos through terabytes of data. SemanticMD Cloud in particular focuses on and excels at those times when you have complex, imaging data that needs to be annotated, analyzed and scaled out.\n\nThe usual solution is to spend hours cleaning and organizing datasets, annotating, and writing custom Matlab scripts. Even after this process, you are still left with the last mile problem of refining the algorithm until the accuracy is acceptable and finally throwing the script “over the fence” for someone to make it production ready. Our team at Carnegie Mellon University has experience developing hundreds of image analysis algorithms the hard way.\n\nWith SemanticMD, medical image analysis is simple: annotate data, use the API to train a classifier or object detection algorithm, and deploy. This removes your ceiling and lets you focus on the innovative aspects of medical image analysis. And of course, if you would rather have a managed service with SemanticMD Cloud and focus on your medical device or web application, our developers could help you with that.\n\nSemanticMD Cloud is available today in private beta. The introductory plan includes a total of 1 TB of storage space for your medical imaging data and a G2 Double Extra Large compute node with 8 GPU cores (see Amazon EC2 Instances). Several other plans are available during private beta to make it easier for you to meet your needs.\n\nAll SemanticMD Cloud plans come with:\n\nHead over to SemanticMD to request access today. If you have questions feel free to drop us a line at info@semantic.md.", 
        "title": "Introducing SemanticMD Cloud – SemanticMD –"
    }, 
    {
        "url": "https://medium.com/3blades-blog/what-will-be-the-key-deep-learning-breakthrough-in-2016-f28bedaa3515?source=tag_archive---------1----------------", 
        "text": "Google’s work in artificial intelligence is impressive. It includes networks of hardware and software that are very similar to the system of neurons in the human brain. By analyzing huge amounts of data, the neural nets can learn all sorts of tasks, and, in some cases like with AlphaGo, they can learn a task so well that they beat humans. They can also do it better and in a bigger scale.\n\nAI seems to be the future of Google Search and of the technology world in general. This specific method, called deep learning, is reinventing many of the Internet’s most popular and interesting services.\n\nGoogle, during its conception and growth, has relied predominantly on algorithms that followed exact rules set by programmers (think ‘if this then that’ rules). Even with that apparent reassurance of human control, there’s still some concerns about the world of machine learning because even the experts don’t fully understand how neural networks work. However, in recent years great strides have been made in understanding the human brain and thus how neural networks could be wired. If you feed enough photos of a dog into a neural net, it is able to learn to identify a dog. In some cases, a neural net can handle queries better than algorithms hand-coded by humans. Artificial intelligence is the future of Google Search and that means it’s probably a big influencer of everything else.\n\nAnd with AI finally dominating the game of Go:\n\nExperts consider these methods can accelerate scientific research per se. The idea of having scientists working alongside artificially intelligent systems that can hone in on areas of research is not a farfetched idea anymore. It might happen soon and 2016 looks like a good year for it.", 
        "title": "What Will Be The Key Deep Learning Breakthrough in 2016?"
    }
]