[
    {
        "url": "https://medium.com/@spunkywise/what-does-it-take-to-join-the-seriously-cool-google-brain-team-4d27797b32d?source=tag_archive---------0----------------", 
        "text": "What does it take to join the (seriously cool) Google Brain Team?\n\nThe Google Brain Team is machine intelligence team focused on deep learning. Deep learning is a branch of machine learning, and a hot career in 2016. Learn about the backgrounds of the team, and the machine learning courses you can take.\n\nHave you wondered how Google maps know the precise address of a building? Not long ago it was a manual, meticulous job a Google. That is, until the Brain Team trained machines to take over this laborious task. How much more efficient is machine over man? The entire Street View of France can be transcribed in less than one hour!\n\nAnother compelling area of research is around music and art. DeepDream was developed to visualize what deep neural net models were learning. The Magenta project is tackling the question, “Can machines be creative?”.\n\nRecently, Redditors were able to pick the brains of the Brain Team in a fascinating AMA thread. A question that struck a particular chord with Spunkywise was from a curious user, /u/i_like_quesadillas, asking if there is an atypical background for someone in machine learning? In other words, “Someone who isn’t a bonafide computer scientist, mathematician, or statistician but someone with a strong foundation in one of these skills but with a different focus/skill set/background.”\n\nI did my undergrad in English Literature with a focus on creative writing. I may be the only researcher in Brain with exactly that background :). In parallel, I worked as a self-trained database programmer for a few years. I was also an active musician, but not good enough to become a professional. Eventually I followed my passion for music back to graduate school and did a PhD in CS focused on music and AI. From there I moved into academia (postdoc working on music generation with LSTM; faculty at the University of Montreal LISA/MILA lab). I had the chance to join Google as a research scientist six years ago. I’ve genuinely loved every step of my research career, and I still credit my undergraduate in the liberal arts as being crucial to helping me get there.”\n\nMy background is graphic design and art history. I’d never imagined I’d be working in the high tech industry, let alone focusing on machine learning. After graduating from a traditional graphic design program (think lots of print), I decided to do a Masters and a PhD at the Media Lab at MIT. That’s where I learned how to program and that’s where I got started in data visualization. My work has always been about making complex information accessible to users. Today, this means building visualizations that allow novices and experts to interact with and better understand how machine learning systems work.\n\nBefore I learned any computer science, I was fascinated by finance and economics. So, when I went to college, I declared my major as economics and started doing internships in finance. However, the economics classes proved to be dry and repetitive, and my experiences actually working in finance convinced me that I should work somewhere that isn’t finance. So I switched majors to philosophy, which was a lot more fun.\n\nAbout halfway through college, I took my first CS course. It was all taught in Haskell, and was incredibly fun! It was too late to switch majors, so I persuaded the philosophy department to count my CS courses towards a philosophy major, as part of the study of the philosophical implications of AI.\n\nAfter that, I bounced around software engineering jobs a bit, until winding up at Brain, working on TensorFlow. My getting onto Brain involved a lot of luck and serendipity — it turned out that they needed someone to buildTensorBoard, and in my previous job I had serendipitously done a lot of data viz work. So I wound up having the chance to work with this awesome team despite not having a deep background in the field. It’s pretty much the perfect job, and perfect team 😃\n\nWell, I don’t have any kind of university degree, so I guess that makes me unusual. Basically, this is how I got here:\n\nAlthough I have a background in math, I worked in journalism for my first six years out of school. That experience gave me an enormous appreciation of the value of explanations, which informs my research today. Machine learning systems shouldn’t be proverbial black boxes: the better we understand them, the more we can improve them and use them wisely. (And by “we” I mean everyone — not just computer scientists and developers, but laypeople as well.)\n\nThe participants in our Google Brain Residency Program come from a wide variety of backgrounds, and we actively encourage people who have non-traditional backgrounds to apply. We believe that mixing different perspectives and types of expertise can spark creative new ideas and facilitate closer collaborations with other fields.", 
        "title": "What does it take to join the (seriously cool) Google Brain Team?"
    }, 
    {
        "url": "https://medium.com/@ooohiroyukiooo/deepmind-will-use-ai-to-streamline-targeted-cancer-treatment-ecdba8d7a104?source=tag_archive---------1----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "DeepMind Will Use AI to Streamline Targeted Cancer Treatment"
    }
]