[
    {
        "url": "https://medium.com/@Francesco_AI/artificial-intelligence-verticals-i-insurance-1691f8fb07ec?source=tag_archive---------0----------------", 
        "text": "In spite of those problems, in the last decade, we noticed a new trend emerging. Insurances, in the effort of trying to reduce moral hazard problems, they started offering premium discounts to their final customers in order to get extra information. This occurred either through a questionnaire (asking directly the customer for further data in exchange for a lower price) or indirectly through devices (healthy devices, black boxes, etc.). The real issue though has been the engagement side of this proposal, because of the opposite nature of information, rewards, and human nature. The rewards offered were indeed either temporary or provided only once and people got lazy very quickly, while the information stream needed to be constant.\n\nThe following step has been the introduction of apps to let customers monitor by themselves their own data and behavior, sometimes even given away for free the device itself. Leaving the customer with full power on his data had though an inverse effect, because people did not have the motivation in tracking down their improvements, and they got upset at the same time because they felt they were not getting the most out of that opportunity.\n\nRegardless of the specific innovative way in which insurers engaged customers, the process used in the insurance business did not change much in the past century. Expert systems and knowledge engineering dominated the sector setting the rules to be followed in internal workflows, but this is slowly changing with intelligent automation systems. We are actually migrating from rule-based decision systems to statistical learning and eventually machine learning.\n\nAI is helping (or disrupting, depending on how you see the matter) the sector in different ways. First of all, it can help increasing the customer engagement and retention problem which has been just mentioned. The abundance of data can be used indeed to refine the customers’ segmentation and provide personalized offers based on personal features. It also helps in reducing the costs through smart automatization or RPA (robotic process automation).\n\nSecond, AI is making people more aware of the risks as well as habits, and it is driving them toward better behaviors.\n\nFurthermore, the better pricing and risk assessment that AI is introducing analyzing more granular data will make some people uninsurable (i.e., too risky to be fairly priced and covered) as well as to turn back some previously uninsurable people into insurable customers again. The governments or central regulatory agencies should then start thinking about a “pricing/risk threshold” in which they intervene subsidizing the cost of relevant insurances (e.g., basic health coverage) in order to “guarantee the uninsurables”.\n\nFinally, it might be useful to think in terms of what an insurable risk is in order to see how AI can help with that.\n\nAccording to Jin Park (Assistant Professor at IWU), an insurable risk is identifiable through the following five conditions:\n\nAI is going to affect all those features: with a better and more detailed customer profiling, we won’t need indeed to have such a large base of insured units. It will turn some frequent events into accidental (e.g., affecting drivers’ behavior it will reduce the basic accidents into rare events) and it will improve our ability to forecast and compute both the probability and magnitude potential losses even in those cases too hard to be managed before. All the previous improvements will make many more premium under budgets, and therefore the conclusion is that AI will “lower” the threshold of what we consider nowadays an insurable risk, and it will make then more risks insurable.\n\nThere are plenty of startups out there working at the intersection of AI and insurance, and it essential to look at least at some of them to understand the future direction of the industry, as well as the kind of improvements AI is having in the insurtech space. An interesting thing to notice is that most of the innovation is happening in the UK rather than other countries, in all the segments proposed below.\n\nClaim processing: Shift Technology skims the valid claims from the ones that deserve further validations; Tractable instead is trying to automatize experts task for insurances; ControlExpert has a specific focus on car claims; Cognotekt optimizes internal business processes, as well as Snapsheet does; Motionscloud offers instead mobile claim management solutions; and finally RightIndem aims to help insurers to deliver on-premise smoothing the claiming flow.\n\nVirtual Agents & Chatbots: Spixii is an automated insurance agent who helps you buying any insurance coverage you might want; Cognicor is a virtual assistant that offers customer care services; Conversica identifies which leads intend to purchase, while Your.MD is a personal health assistant that analyzes symptoms and produces pieces of advice. MedWhat instead uses EMR (medical records) to assist the patient as it was a virtual doctor, and Babylon gives medical advice taking care of tight budget constraints. Insurify is another personal insurance agent who works as a comparator for car insurances.\n\nWhat today is called simply chatbot is going to be renamed in a few years robo-insurer. There are already few examples of companies toward that goal: Risk Genius is indeed an intelligent comparator which identifies gaps in coverage for the customer and PolicyGenius looks for the best solution that fits customer’s needs and characteristics, while Drive Spotter implements real-time video analytics to keep drivers safe(r). More generally, robo-insurers will be a quite wide class of agents who will end up providing different services, all of them with the final goal of helping the clients to undertake risk-mitigating actions and only cover the real (residual) risks.\n\nCustomers engagement: Oscar is probably the most successful insurtech company out there, with the final goal of making insurance simple and accessible to everyone through a great UX. Similar to Oscar is somehow Stride Health, while Brolly is a tool that helps customers in understanding their own needs and facilitates in one place all the insurance coverages in place, in a similar fashion to Knip. Adtelligence instead creates personalized offers and relevant products based on customer’s characteristics. Captricity uses machine learning to convert handwritten files into structured data, and this can be used to better understand the final customer. Finally, ValChoice ranks the service of insurers to the benefit of the client.\n\nTelematics: connected cars and telematics is a pretty big area itself (see CBinsights article to know more about it), but it would be worthy to point out the work that Greenroad, Vnomics, and Telogis are doing in capturing driving behaviors and habits as well as computing fuel efficiency. Cambridge Mobile Telematics works similarly, although it uses smartphone data and mobile devices habits. Navdy is trying to revolutionizing the UI/UX within vehicles, displaying information in such a way that the driver does not get distracted. Lytx uses vision technology to provide real-time feedbacks to the driver.\n\nUnderwriting: AI can be (and actually is) used to spot out hidden correlations to granularly segment customers and risks in a more efficient way. Even though it might in theory possible to identify some algos that could perform better than others (see the work Wipro did for fraud detection), data always come first, at least for the next close future. Many companies operate in the space, as for instance Carpe Data that provides predictive algorithms and data products for property and casualty and life insurances through the analysis of public data (e.g., social media data). Atidot created a machine learning risk management platform, while Tyche uses unstructured data to optimize the underwriting and claims process. Big Cloud Analytics collects data from wearables and formulates health scores for a better risk assessment, while Cape Analytics uses computer vision techniques on geospatial data to improve the level of detail on current houses conditions. Dreamquark creates a more accurate representation of the medical datasets to be used for underwriting purposes by insurances, similarly to FitSense that offers also apps products. Melody Health Insurance provides also low-cost insurances, while Uvamo uses AI to assess the risk of policy applications. A more accurate underwriting can even translate into covering events that are today quite risky (e.g., as MeteoProtect and Praedicat, and are doing for weather risk management).\n\nFinally, on a side, it is worthy to point out to pure technological enablers as Instanda, which offers a management tool to the insurance providers to manage effectively and timely new products launched; Insly, a cloud-based platform for insurance brokers; and finally, SimpleInsurance is instead an e-commerce provider for product insurances.\n\nP2P insurance: Lemonade, Friendsurance, and Guevara are peer-to-peer insurance startups focusing respectively on property and casualty insurance the first two, and car insurance the latter one.\n\nInsurchain & Smart Contracts: these are companies in the insurance sector that are driven by blockchain technology. Elliptic offers real-time AML for bitcoin specifically, while Everledger is a permanent immutable ledger for diamond certification. Luther Systems is instead a stealth-mode company working on the standardization of smart contracts. Dynamis provides a P2P supplementary unemployment insurance product, while Saldo.mx provides micro-insurance policies on the blockchain. SafeShare covers multiple parties with insurance cover at short notice and for varying periods, and finally, Teambrella is another P2P insurance platform run on the blockchain.\n\nInsurance on-demand: this class of startups put in customers’ hand the entire insurance buying process. Trov is probably the best example of this new class of players and it allows to ensure things by simply taking a picture of them. Cuvva is quite similar but with a focus on car insurance, Sure and Airsurety on travel policies, and Back me up is another example of on-demand insurance. But this class does not include only the proper on-demand business model, but also insurance startups which provide products that vary by location, time, use, or customer. In other words, pay-per-mile business model (Metromile), micro-insurance policies (Neosurance), or eventually Insurance-as-a-service models (Digital Risks).\n\nYan identifies four elements which constitute the insurance profit structure: premium earned and the investment income from one hand, and underwriting cost and claim expenses from the other. AI is and will be able to improve the cost structure, increasing at the same time the competitiveness and enlarging the customer base accessible to insurers, while optimizing internal processes and enhancing the transparency and robustness of the compliance flow.\n\nThe greatest challenge I still see in insurance is the cultural mindset which might prevent insurance to adopt early AI solutions, although this won’t probably have a long life given the incredible pressure to innovate the insurance providers are undergoing through.", 
        "title": "Artificial Intelligence Verticals (I): Insurance – Francesco Corea –"
    }, 
    {
        "url": "https://medium.com/@KunfengChen/training-and-validation-loss-mystery-in-behavioral-cloning-for-cnn-from-udacity-sdc-project-3-dfe3eda596ba?source=tag_archive---------1----------------", 
        "text": "Training and validation losses are important since training loss is used to recalculate the neuron network weights for better predictions. Ideally when you have models with lower losses the model should predict and perform better, but this is not the case at all when you run the models against the simulated driving car. Only way you can tell if the model performs well is to do the real test in the simulator.\n\nAfter I submitted the project, I have more confident and good enough of the training data recorded earlier, plus the GPU power from Nvidia Titan X to shorten the iterations. I have done a quick experiments on loss vs performance in CNN training.\n\nThe experiment is to train the model for 20 epochs and see the training and validation losses decline overall. Then with the check point plug-in enabled in Keras training module, we will load each 20 models saved in each epoch and test each in the simulator to see it’s performance.\n\nWith learning rate set to 0.0001 for 20 epochs, validation set at 3000 images for about 5% of the all data. Here is the training output:\n\nThe lowest training and validation losses are epoch 19, and 20. But the best performance during the testing in the simulator is about epoch 11, which has higher training and validation losses! Epoch 1, 20 and few others run out of the track at the first lap. On the other hand, epoch 11 and others stay on the tracks for a while until I stopped them.\n\nI have recorded the testing and uploaded them to YouTube. If we take a close look at the performance testing, the epoch 1 is not good and epoch 2, 3 , 4 are getting better and better. The car runs toward the left side touches the yellow lines during the first several epochs. The later epochs the car runs toward the center of the track and epoch 11 doesn’t touch the yellow lines at all! The performance degrades after epoch 11 and more jitter and sharper turns on the car.\n\nThis is why the mystery about the training and validation losses in the Behavioral Cloning. They are not a good indicator here in training the model. There might be something to do in my model or coding as well. This is really fun project to work on. I tested the model in the simulator each time when I did one change. Or I would get lost quickly and spend even more time on trouble shooting. Now I understand why we call deep learning empirical.", 
        "title": "Training and Validation Loss Mystery in Behavioral Cloning for CNN from Udacity SDC Project 3"
    }, 
    {
        "url": "https://medium.com/@sayoraga/deep-learning-f4676527f29d?source=tag_archive---------2----------------", 
        "text": "Traveling across India would be very inquisitive experience for anyone Believe me, Hindi isn’t the only language but well over 1500 different languages are spoken. You may end up encountering people of different languages/dialects for every hour. Yeah..! That’s true. But, in this digital age, you can pretty much speak/translate any language under the sun.! Thanks to Google and the technological advancements happening post y2k era.\n\nLanguage Translation is one of the application of Deep learning. This article aims to give you a simple example of Deep learning..! I’m not going to write the jargons but just to illustrate the application.\n\nBefore we dive in, I’d like introduce you to few folks in the paradigm of Deep learning.\n\nData is growing exponentially and most of the companies are very keen in collecting and storing the information. BigData is nothing but huge datasets, representing various information stored in different formats. viz., structured, unstructured over the year.\n\nTeaching the machines to predict the models by giving samples to it. Like you could show 4 legged animals by feeding the machine pictures of Dogs and two legged animals by feeding the machine pictures of Dinosaurs. Now, If you feed the picture of Sheep the machine will categorize it as four legged Dog. Still better than categorizing it as a Dinosaur. Let’s just call it as Legorithms :) That’s just a jargon I made up while writing this article.", 
        "title": "Deep Learning – Saran –"
    }, 
    {
        "url": "https://medium.com/@zainabz/the-coming-of-age-of-ai-part-i-834ccc70840b?source=tag_archive---------3----------------", 
        "text": "The next wave of technological revolution is going to be AI — after web, social, mobile. Our lives in ten years will not look remotely like they do today. Just like ten years ago we couldn’t have imagined that our phones will become our cameras, our navigators, our entertainment systems, our fitness trackers and even our wallets in addition to being communication devices. AI will change not only how we interact with our world but how we think.\n\nArtificial Intelligence, a term coined by John McCarthy has been around since 1959. It is only coming of age now. AI is essentially the process of making machines think for themselves. Even though the science and study of AI has been around for over half a century, it has only become a viable technology in the current age due to 4 essential forces —\n\nWhat we can do with AI in the future is only limited to our needs and imagination. Finding patterns in large volumes of customer service call transcripts, determining when we’re going to run out of pantry supplies and placing refill orders, driving us to work (this will happen sooner than we imagine), getting the oven pre-heated in time for dinner are all tasks that will be performed by intelligent machines in the near future.\n\nThere are two basic types of problems machines can solve for us —\n\nMore to come on how AI solves these two problems in future posts.", 
        "title": "The coming of age of AI — Part I – Zainab Zaki –"
    }
]