[
    {
        "url": "https://aiinvestor.com/speculating-on-the-ai-behind-art-app-prisma-40b90f9a5f6b?source=tag_archive---------0----------------", 
        "text": "As it happens every few months, a new photo app emerges out of nowhere and is crowned the NEXT BIG THING. This summer’s edition is called PRISMA. As reported by Josh Constine, PRISMA has vaulted to the top of the AppAnnie charts since it’s launch in mid-June. It now ranks #3 in Photo apps and #10 in overall app downloads for iOS.\n\nWhen I first saw PRISMA last week, I immediately thought about the research I have done in the deep learning art space. I’ve reviewed a number of different products that take photos and apply an artistic style culled from a specific artwork. The joy of seeing a POS (plain ol’ selfie) transformed to something resembling a Van Gogh or Kandinsky is really quite magical and many, many teams are working on it.\n\nGoogle introduced us to the world of deep learning applied to photos a year ago when they released the DeepDream code base (originally called Inception). DeepDream uses a convolutional neural network (CNN)to identify novel patterns in photos, and enhance their occurrence in the image. Some view it as the computer hallucinating things that aren’t there in an often artistic fashion.\n\nDeepDream leverages Caffe — a deep learning framework developed by the Berkeley Vision and Learning Center which is also released to open source. Caffe may seem a surprising choice when Google has focused so much recently on their competitive offering called Tensorflow. However, a year ago, Google’s DL leadership was much more fractured, and Caffe was a reasonable choice for Google Research to be playing with.\n\nSince the release of DeepDream, the development community has dived in in a major way. Nearly 9000 developers are following developments at DeepDream, and over 2200 teams have forked the code base. Forking means that a developer has taken the core open source code and is now altering it to be included in their own project.\n\nOne of the art apps I have been following is Deepart.io. The Deepart team hails primarily from Germany, and have published a scientific paper on the artistic neural algorithm work which is based on CNN work done at Oxford, which again is tied back to opensource projects on Github.\n\nThe path to the PRISMA app looks to have passed through Github’s Deep Learning archives as well. PRISMA’s front man is Alexey Moiseenkov, (Moiseenkov Alex — @darkolorin on Twitter) Alex is a 22 year old Moscow based coder with little to find in the open source world. PRISMA literally looks like a Q2 2016 activity for Alex and his small team. His name shows up related to a different photo related project in Github earlier in 2016.\n\nHowever, an account called prisma-ai (with the PRISMA triangle logo) was created on May 6, 2016. That account has little activity associated with it, mainly publishing 3 Docker related repositories. However, a contributor to those repositories is Moscow developer Oleg Poyaganov. Although Oleg’s LinkedIn indicates he works for another Russian startup (BABO), his recent efforts on Github show deep learning related activities.\n\nIn late May he built and then deleted a Torch converter module, and then he forked and contributed to a branch of Facebook’s Torch to Caffe extensions. It looks like PRISMA uses Torch or Caffe as it’s core CNN, and the PRISMA team is looking at porting their model to other DL frameworks.\n\nPRISMA leveraging Caffe would make perfect sense. It’s Berkeley built and Google polished. It has the largest art inspired community, and it is easy for non-experts to get up and running in iPython. Further, given that rumors abound of Facebook’s interest in PRISMA, it would not be surprising if they were looking to support Facebook’s DL offering — Torch.", 
        "title": "Speculating on the AI behind Art App PRISMA –"
    }, 
    {
        "url": "https://medium.com/@juliancastor_/ml-rowling-part-1-f4a627d44568?source=tag_archive---------1----------------", 
        "text": "“T-t-to DURSLEY! Swapping rat !” he screamed — He answered it stealthily. There on the corridor, he was nothing. He held out in little and found the first boy, shuddered at what’s galling himself. Every sound of Uncle Vernon, pounding to a moustache from down the train. The little absences he fought back on the long voice standing across the dogs, flickered over inside. Uncle Vernon will be mad, sitting some time. Harry ducked under the first black glass and George carried an affectionate leg. He drove expecting to pass home, as though it’s being has died in a place, the one. When Harry could reach it, the lighted pacing suddenly said good-bye, and Harry was particularly unlikely, note short of the case of his weirdest hair.\n\nHe drove expecting to pass home, as though it’s being has died in a place, the one. When Harry could reach it, the lighted pacing suddenly said good-bye, and Harry was particularly unlikely, note short of the case of his weirdest hair.\n\n“You know why there are three of Uncle Vernon? Grabbing the teacup, see the old woman flashing past.” said Harry. He’d had to say it. “…your dear knows I’m not completely lost. But something to the dark tweed stomach I’ll have done.” Harry kept himself in his zoo. “Dobby gave nothing to get him until last the Black family was a prefect” said Harry, holding it to pay the Brazilian boa affairs. Dudley couldn’t have been fun at his house. The curtains on his bedside table, the family in the room in the story arrived with butter thoughts. Then Ron seemed to be painful. More were much as they’d older. I worry somewhere but would not hear that she smiled.\n\n“Oy, That Weasley were to help him around the wineglass Dud. I’m thin empty !” said Kreacher.\n\nHarry had gone at him. Perhaps he didn’t hurry the sandwiches. Harry looked expectant.\n\nDumbledore’s eyes seemed to see his cousin, and was halfway until Harry started asking the living question of Magic, but inside his nose pulsing at a likely-looking absence of Harry’s early lady who Harry held. Rosmerta’s Weasley had already been sent a rash.\n\n“Dad!” spoke Uncle Vernon. The wizard who was flapping in, coming up at something and gave Black a VCR. He couldn’t say that’s not the spot. Uncle Vernon was stuffing it and he heard the glass on her beak. “Couldn’t be his murder… little liar.” he yelled. Cruelty was his hope and he got two first.\n\nHarry Dursley looked so stiffly. Harry was furious — how here he appeared in a world that yelled at Hogwarts.\n\nDudley was out to dinner and he was looking very Dursley. He arrived for Harry. “Mr. I have news from your bedroom” he said. Aunt Petunia winced so sharply.\n\n“Absent at seventeen. Uh-oh,” Harry sweared she did. “I want to leave Mrs. Dursley, over your chair.” He was already walking.\n\nDudley tried to burn with night. There hadn’t been doubt any particular owls were trying to amuse his mind toward people. He had wanted to say that he really thought. “He didn’t realize the Muggles! Look in the Department of laughter, because you’re a wizard”\n\nHarry had laughed. Harry found himself later joined by the Tulips. Harry felt an unexplained puppet, because there was a moment. “Yeah,” said Harry. The Dursleys had been in the remaining slot against the wand and Ron swooped Uncle Vernon. It was school.\n\n“But our funny cakes help!” suggested Hagrid. “And, Freezing Dudley means they barked over anyone like how if he had crashed back at the cupboard on his feet and saw me once!”\n\nHarry coldly could show no signs. “Boy. She hummed as casually but the boys is why she mustn’t not dare. Instead he could keep him for having his thing. I’ll sign Harry’s hair.” But he knew his head had been mixed a funny crumpled socks. Aunt Petunia was haunting him over the train.\n\n“Dobby floated up again from the dining room and pulled the mail.” said Aunt Petunia of his teacup. Harry realized it was Voldemort. She smiled.\n\nDudley smirked and sealed between his wand and then everyone was on. Harry left the meeting into the white-hot outside. He didn’t believe it.\n\nThe Dursleys got toward the middle and walked.", 
        "title": "ML Rowling — Part 1 – Francis Julian Castor –"
    }
]