[
    {
        "url": "https://medium.com/trend-note/sam-altman%E3%81%A8elon-musk%E3%81%AB%E3%82%88%E3%82%8B%E4%BA%BA%E5%B7%A5%E7%9F%A5%E8%83%BD%E7%A0%94%E7%A9%B6-open-ai-%E5%A7%8B%E5%8B%95-1db87bc24422?source=tag_archive---------0----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "Sam AltmanとElon Muskによる人工知能研究「Open AI」始動 – trend note –"
    }, 
    {
        "url": "https://medium.com/@futurebec/messaging-bots-the-shift-to-conversational-user-interface-7d9baad739d8?source=tag_archive---------1----------------", 
        "text": "Bots have gotten a bad rap for trolling on Twitter and other social media. Despite their current reputation, the market is on the verge of being overwhelmed by friendly, highly useful bots. In fact, soon there will be so many useful bots that the number of stand alone mobile apps we use will drop dramatically over the next 2–3 years.\n\nWe are on the cusp of shifting to a new user interface — CUI — Conversational User Interface, where business and play will be conducted and transacted via messaging, with automated software — bots. Bots will transform marketing, customer service and e-commerce. Bots will accelerate productivity within enterprises.\n\nWhere will these bots be, who will create them, and which players stand to benefit? Bots will be embedded in stand alone mobile apps and enterprise software, but most bots will reside within platforms — messaging platforms.\n\nThere will be challenges. Scale is an issue, today some bots use a combination of hard coding and live people to deliver. Some are introducing machine learning/artificial intelligence. Some are taking that even further into the most complex AI — deep learning and neural networks. Bot discovery is another challenge. Context and ease of use is another.\n\nI will publish new research on Bots soon, via a short form research note (5–8 pages), or via Analyst Inquiry. Email me at mb@markbeccue. com if you are interested in more details. www.markbeccue.wordpress.com", 
        "title": "Messaging Bots & The Shift to Conversational User Interface"
    }
]