[
    {
        "url": "https://medium.com/kosate/%E0%B9%80%E0%B8%88%E0%B8%B2%E0%B8%B0%E0%B8%A5%E0%B8%B6%E0%B8%81-alphago-%E0%B8%97%E0%B8%B3%E0%B8%87%E0%B8%B2%E0%B8%99%E0%B8%AD%E0%B8%A2%E0%B9%88%E0%B8%B2%E0%B8%87%E0%B9%84%E0%B8%A3-%E0%B8%89%E0%B8%9A%E0%B8%B1%E0%B8%9A%E0%B9%80%E0%B8%82%E0%B9%89%E0%B8%B2%E0%B9%83%E0%B8%88%E0%B8%87%E0%B9%88%E0%B8%B2%E0%B8%A2-%E0%B9%84%E0%B8%A1%E0%B9%88%E0%B9%80%E0%B8%84%E0%B8%A2%E0%B9%80%E0%B8%82%E0%B8%B5%E0%B8%A2%E0%B8%99%E0%B9%82%E0%B8%9B%E0%B8%A3%E0%B9%81%E0%B8%81%E0%B8%A3%E0%B8%A1%E0%B8%81%E0%B9%87%E0%B8%AD%E0%B9%88%E0%B8%B2%E0%B8%99%E0%B9%84%E0%B8%94%E0%B9%89-3a1cf3631289?source=tag_archive---------0----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "เจาะลึก AlphaGo ทำงานอย่างไร ? (ฉบับเขียนโปรแกรมไม่เป็นก็อ่านได้)"
    }, 
    {
        "url": "https://medium.com/@shiyan/materials-to-understand-lstm-34387d6454c1?source=tag_archive---------1----------------", 
        "text": "People never judge an academic paper by those user experience standards that they apply to software. If the purpose of a paper were really promoting understanding, then most of them suck. A while ago, I read this article talking about academic pretentiousness and it speaks my heart out. My feeling is, papers are not for better understanding but rather for self-promotion. It’s a way for scholars to declare achievements and make others admire. Therefore the golden standard for an academic paper has always been letting others acknowledge the greatness, but never understand enough to surpass itself.\n\nWhen it comes to LSTM, for example, there aren’t many good materials. Most likely what they would show you is this bullshit image:\n\nThere are many things on this image pisses me off.\n\nFirst of all, they use these f shapes (with a footnote “f” that looks like a “t”)to denote non-linearity and at the same time, they have f_t in their equations. And they are not the same thing!\n\nSecond, they have these dash lines and solid lines to represent time delay. So solid lines are C_t, and dash lines are C_t-1. There are 5 arrows coming out of the “Cell”, but only 4 are labelled. One C_t is incorrectly labelled with dash line. One solid line is supposed to be a dash line and C_t-1.\n\nThird, what the hell are black dots? You have to look at the equation to figure out that they are element-wise multiplications of two vectors.\n\nAnd finally, C_t is supposed to be calculated as a summation of f_t * C_t-1 and i_t * tanh(W_xc * x_t + W_hc*h_t-1 +b_c) (the third equation). But the image completely misses the plus sign.\n\nCompared to this shitty image, the following version is slightly better:\n\nThe 3 C_t-1 are correctly represented as dash lines. The plus sign is there too. Sigmoid functions are written with the proper sigma sign, not some freaking f_f.\n\nSee, things don’t have to be so difficult. And understanding shouldn’t be a painful experience. But unfortunately, academic writing makes it so almost all the time.\n\nPerhaps the best learning material is really this excellent blog post:\n\nAnd its diagram is simply beautiful:\n\nI think the most evil thing about the first two versions are that they treat C (the cell, or the memory) not as an input to the LSTM block, but rather a thing that is internal to the block. And they adopt this complex dash line, solid line thing to represent delay. This is really confusing.\n\nBut I do noticed one difference between the first two diagrams and the last one. The first two diagrams sum up the inputs with the outputs from the previous layer to calculate the gates (for example, f_t and i_t). But in the third version, the author concatenate them. I don’t know if it is because the third version is a variation or this doesn’t matter in terms of correctness. (But I don’t think it should be concatenation because the vector size h shouldn’t be changed. If it is really concatenation, the vector size of h will change to the size of x+h?)\n\nI drew a new diagram, which I think is better:", 
        "title": "Materials to understand LSTM – Shi Yan –"
    }, 
    {
        "url": "https://medium.com/@StephenMartindale/alphago-vs-lee-se-dol-game-three-76f2a88f72b3?source=tag_archive---------2----------------", 
        "text": "This morning, Lee Se-dol lost a third and deciding game in the challenge match against Google DeepMind’s AlphaGo. The fourth and fifth games will be played but the prize goes to the programme and the prize money will be paid to various benevolent causes.\n\nThe game started with a high ‘Chinese’ fuseki which was soon broken up by a vital battle that affected the whole board, a product of Lee Se-dol’s aggressive style and AlphaGo’s refusal to capitulate. Black fought for his heavy and inefficient stones but white, played by the bot, acquired a huge territory that black simply couldn’t match. In desperation, black invaded and a scuffle lead to a complicated situation with multiple Ko fights. Black resigned when it became clear that his stones were lost and, elsewhere on the board, the cost of the scrap became too great to bear.\n\nOne incontrovertible fact was proven during the match: AlphaGo does not struggle with Ko fights in the slightest. AlphaGo showed that it can handle extremely tricky Ko situations that play havoc with the game-tree and would have completely flummoxed its ancestors, the MCTS engines of yester-year.\n\nLee Se-dol admitted that AlphaGo defeated him, taking ownership of his defeat and lamenting that he did not show us a better game, today. He said that today’s defeat was his defeat, not a defeat of human beings.\n\nMichael Redmond, the 9 dan professional westerner who provided the official English commentary during the match, brazenly declared that AlphaGo “beat Lee Se-dol at his own game!” In front of a veritable army of reporters, in the ballroom of a hotel in down-town Seoul, he went on to suggest that AlphaGo would herald a “third revolution” in Go opening theory, mentioning AlphaGo in the same sentence as Honinbo Dosaku and Go Seigen, two legendary human players who sparked extensive, novel innovation in the fuseki in the past.\n\nWhen a member of the audience questioned Redmond’s prophecy, Lee Se-dol answered that he thought AlphaGo is not at the level of the so called ‘Divine Gods’ and described the bot’s play as ‘different’ and ‘superior at times.’\n\nMeanwhile, in the Go community, speculators questioned whether Lee Se-dol (9 dan professional) was, in fact, the best player to champion humanity in this duel against the machine. Some pointed to his aggressive and frequently precarious fighting style and hypothesised that AlphaGo’s cold and heartless play was ideally suited to winning in such situations - situations in which mere mortal, human professionals might become flustered or overwhelmed by the complexity. Some suggested that calmer, more placid players might fare better against the A.I.\n\nLee Se-dol reassured the audience at the post-match conference that AlphaGo is not yet perfect. I believe him. If he does not defeat AlphaGo, another will, but I do hope that he shows us the way over the course of the next two games.", 
        "title": "AlphaGo vs. Lee Se-dol: Game Three – Stephen Martindale –"
    }, 
    {
        "url": "https://medium.com/@vufindinc/why-every-brand-will-capitalize-on-deep-learning-to-optimize-revenue-margins-bca58012b0c0?source=tag_archive---------3----------------", 
        "text": "Every brand has become an online retailer, some managing their own e-stores, and some relying on hosted solutions such as DemandWare. Similarly, every brand has invested in social presence, social listening, and social campaigns. In mobile, we’re definitely lagging behind the emerging markets, as many still have 2-star apps where a web experience has been shoe-horned onto a mobile screen, while an e-tailer like Flipkart in India has gone mobile-only.\n\nBrands realize that they increasingly need to own the customer journey from intent to purchase, as they know the user experience (UX) is what inspires and retains users. A recent HBR article emphasizes how crucial it is for every brand to eliminate the guesswork in understanding customer’s emotional motivators. For online retailers, the study showed customers who are “Fully connected and satisfied and able to perceive brand differentiation” were 52% more valuable than the “highly satisfied” baseline users. The retailer study on the bottom line impact of the “Fashion Flourishers” category and its strategy impact on online-to-offline and store locations is well worth a careful look. However, most brands still face several key problems in understanding their customers’ motivators and optimizing their UX to get them to the fully connected stage.\n\nSource: “The new science of customer emotions” by Magids, Zorfas, Leeman, Nov 2015 Harvard Business Review\n\nFor the vast majority of brands there isn’t much intelligence aggregation across these channels and touch points, nor is there a feedback loop to leverage the relevant analytics to inform the decisions various stake-holders are making every day. It’s decisions like these that need every byte and every pixel of intelligence you can gather:\n\n- Is this the right collection for Thanksgiving week sales?\n\n- Why is this recommendation converting against this SKU for San Francisco users, but not for Boston users?\n\n- Is 20% lift in CTR good, or should we continue to refine to aim for 30% lift?\n\n- Should we discount the handbags by 21% or 29% to meet X revenue goal in Q4?\n\n- Does that Twitter or Tumblr photo featuring our product carry positive sentiment or negative?\n\nViewing excel sheets–or even business intelligence dashboards–that lack the continuous deep-learning behind the scenes on all these activities almost always puts you at a significant disadvantage. It gives you, the decision-maker, a partial, spotty view of your world. Also, because it’s already stale, you lack the most relevant real-time ammunition to make the smartest decision at any given moment. Compound this over time and across functions and you’re essentially flying almost blind, kind of like Wattny in The Martian during the scene where he punctures his astronaut suit and hopes to make it to the rope by free-flying through space. His endeavor was fun to watch, but it could have cost him his life and billions of dollars!\n\nWe call this deep-learning across all touch points to affect a smarter user experience, AI-merchandising. We’ll cover only 2 aspects of this in this article: product design and catalog design. Other elements will follow in subsequent articles.\n\nA deep-learning engine that aggregates all clicks, purchases, save-to-wish-list, cart-abandonment, and returns for every product in your catalog gains internal insights (in the neural network) into what’s appealing and what’s not about your products. The information isn’t captured in some metadata attributes in a row or column in a database, it’s embedded in its “mind” and can be recalled. This intelligence can then be queried for suggestions on what to design. The engine can act as an AI-assistant to your designers, suggesting cuts, styles, patterns, colors, and fabrics for next seasons’s collection, which can even be refined by geography and demographic to meet revenue and margin goals.\n\nCross-category recommendations, often called “Style it with”, or “Complete the look” recommendations, are a unique discovery mechanism used to inspire shoppers to create ensembles from your catalog. It is one way to encourage shoppers to maximize basket size, and to love your brand even more as they dress head-to-toe from your catalog. A deep-learning aiCommerce engine would garner the intelligence to advise you what’s working well with what for your shoppers (for ex: what handbags and shoes with what shirts, etc) so your catalog collections can indeed deliver that head-to-toe ensemble.\n\nNo brand can afford to ignore #aiCommerce and deep-learning powered user experience. We’re very excited to collaborate with brands of all sizes on deep-learning and AI-merchandising to inspire shoppers with a futuristic and joyful user experience, while maximizing revenue lift.", 
        "title": "Why every brand will capitalize on deep-learning to optimize revenue & margins"
    }
]