[
    {
        "url": "https://medium.com/apprendimento-automatico/la-genesi-di-una-rivoluzione-tecnologica-e2dc48a0e58b?source=tag_archive---------0----------------", 
        "text": "Un gruppo di scienziati provenienti da diverse discipline accademiche si incontrò in occasione di un workshop a Vancouver nel dicembre del 2003. Si trattava di un meeting di preparazione di quello che sarebbe poi diventato il Neural Computation and Adaptive Perception program (NCAP), che avrebbe segnato la fine dell’inverno (come viene spesso definito) delle reti neurali, e dato il via alla rivoluzione del deep learning.\n\nLa maggior parte dei colleghi informatici era convinta che il ristretto gruppo di accademici che lavoravano ancora sulle neural nets fosse composto da gente che gettava via il tempo con cose che non potevano (e non avrebbero mai potuto) funzionare, roba da strampalati. Il modo canonico per “insegnare” a un computer a risolvere un problema era programmarlo, non era metterlo nelle condizioni di imparare ad affrontarlo per poi addestrarlo. Silverman però era diverso da questi oppositori, e soprattutto non era un informatico.\n\nSilverman era un medico, e in quel momento aveva nelle sue mani la possibilità di decidere se finanziare questo drappello di “svitati” (loro stessi ironicamente si definivano così) per conto del CIFAR. Davanti a lui aveva un gruppo affiatato e tra di essi c’era Geoff Hinton, un ricercatore originario dell’Inghilterra portato in Canada proprio dal CIFAR anni prima. Geoff Hinton era rispettato, quasi venerato, dagli altri del gruppo e tra essi c’erano anche diversi suoi allievi. Silverman fu molto colpito dalla vastità dei problemi difficili che potevano essere affrontati attraverso questo nuovo approccio, e il gruppo fu molto sincero riguardo alle difficoltà che negli anni successivi avrebbero incontrato e alla natura avventurosa dell’impresa.\n\nTrovate il resto della storia (in inglese) in questo articolo del Financial Post", 
        "title": "La genesi di una rivoluzione tecnologica – Apprendimento Automatico –"
    }
]