[
    {
        "url": "https://medium.com/@vinnuvinay008/the-search-for-machine-intelligence-notes-of-an-inquirer-a16cb73dbf3a?source=user_profile---------1----------------",
        "title": "THE SEARCH FOR MACHINE INTELLIGENCE — Notes of an inquirer.",
        "text": "We have learned very little about our brains.May be like all complex systems we will one day figure out it’s working —from how we form opinions to our ability to be self-aware.I agree that it is genuinely puzzling how interactions within a 3 pound matter can produce theories of cosmos,be self aware and even speculate on it’s origins.But so are the vast number of phenomenon in the universe — we have managed to understand and harness them to our benefit.Then question pertains — does the brain too operate on same physical laws.If that is the case then i would argue — we are very close in making our very own brain(maybe without some of it’s glitches) — that would do all our inventions for us.If that needs us to extend physical laws — that’s okay we would as long as those don’t tells us of a master with a magic wand.\n\nHere i wouldn’t try to predict the future after the advent of A.G.I — for i’am convinced that it is very difficult if not impossible to think aftermath.I am not worried of A.G.I that would become self aware and crush it’s creator — that would make a good hollywood drama.More benign way of dying would be — a human making a simple request like ensure my happiness at all times and the A.I eventually enlightened by a buddhist phrase — Life is suffering.Thus annihilated all life….I know my imaginations are poor but for a better appreciation of the existential threat we are facing read Superintelligence: Paths, Dangers, Strategies-Nick Bostron.\n\nI initially set out to write a brief account explaining why acheiving general artifical intellingence is not far off — and may be in process convince the reader regarding the sensibility of the aspiration.I also planned to provide what i think of as the most direct way of achieving it.In the process i would evoke ideas from biology,physics,history,psychology and whatever else is needed …..\n\nScience is a breathing book.We have been changing our notions of reality.All through our history our intuition about the workings of nature have been failing us.We are not the centre of the universe.We are not a separate creation from all the other animals.We are not here by any purpose.We are a phantom of chance.\n\nProbably the most striking lesson we have learned through science is that all the complex phenomenon we see can be accounted by surprisingly simple facts.Apparent complexity is the manifestation of long chains of simplicity.This shouldn’t come by as surprise for in a perfectly godless world how can something complex exist without reducing into nothing.By nothing,i do not wish to avoke any enigma.We will try to peel down the layers of complexity,atleast to the point we can approach without mathematics.\n\nMost compelling explanations of the nature arises out of abstract concepts.Concepts like energy ,spacetime exist only in the realm of mathematics.It is better to try not to attribute too much meaning to them through our senses.Our intuition is the result of the mental models we carry about the world.Our limited capacities have rose to cater the needs of survival,not for deciphering the laws of nature.Our intuition of the world is based on our experience under small spectrum of the magnitudes.\n\nTake for example Mass.what’s the minimum mass range that we could tell the difference?May be we could tell the difference between a gram and some fraction of it not of lower orders and similarly the upper limit may be between 100 and 1000 kilograms(don’t ask me to device an experiment for that..).similarly we can establish limits to our perception of time(.1 to ¹⁰⁷) and length(.0004 to ¹⁰⁴).But universe operates on far grander scale.The mass of an electron is of the order of 10-³⁰ while the upper limit is of mass of universe itself — is of the order ¹⁰⁵²(we have clever ways of estimating,but i suppose the details are not important here).Similarly the shortest length which we can estimate from three fundamental constants(planks constant,gravitational constant and the speed of light)turns out to be of the order 10-³⁵ while upper limit ¹⁰²⁶ — radius of the universe.Now look at the difference in the orders of magnitude,in daily lives we only have interaction with 7 to 8 orders of magnitude while the nature operates on the orders of 60 to 80 times greater — these are only the minimum estimates.\n\nOver the years we have developed machinery to expand our reach but the most astounding of them all is mathematics.This is the language we evolved to grasp the operations of the universe.There is no reason for the intuition we developed for such short range of operation to continue for the microscopic world.Electrons behave as electrons not as particles or waves.What we call understanding should have nothing to do with intuition.Newtonian Mechanics which most of us find easier to comprehend is not at all intuitive.It took many years to figure out that when we push an object at rest we change it’s velocity not it’s position — which only changes as a consequence.\n\nSo it’s important for us not to confuse facilitation with the actual understanding and the ability to make predictions.It’s a wonder how facilitation under such short range of operation allowed us to develop mathematics and probe rest of the universe.\n\nFrom now on i will take you on a journey of exploration.Here and there we would derail from the main theme to explain certain scientific ideas that would help appreciate the material more deeply.\n\nWhat Evolution has to do with A.I.You are not in the wrong place.It’s important to understand the underlying forces that led to us.\n\nHere i would try to impress upon you how complexity(we will try to define it in later sections,hold on to your intuition till then..) can emerge out of simplicity under suitable initial conditions when alloted sufficient time.We will understand evolution in all it’s grandeur.\n\nWe will start by seeing how complex phenomenon can be explained by successively simpler rules.We carry our intuition of humans designing machines and wonder what except an omnipotent creator could design all this.\n\nIf anything in science that most shocks me than it is that we are mere survival machines geared towards successful transfer of genes.The Evolution by natural selection is not the most bizzare of ideas in science but it is the one that has attracted most contempt.Evolution of complexity of sorts not just biological doesn’t require any intervention — no fine tuning of the laws,no vigilence of any intelligence.All complexity is manifestation of chains of simplicty.All processes are the play of atoms aimlessly roaming.The fate of these atoms which seem to be dependent on the precise attractive force between the neucleus and the electrons (this force being very gentle is the cause of all the complexity of the universe , unlike forces within nucleus which are much stronger but shorter in range these forces are perfect for the occurance of reactions or the transformations that eventually lead to us)are infact modulated by a tendency towards chaos.\n\nThe forces inside the atom are of two kinds — those between the nucleus and the electrons and those that hold the nucleus together.The former force is governed by a constant(approximately equal to 1/137) that determines the size of an atom.This has far reaching consequences.If that constant had been twice as big we would be half our size and have taken ¹⁰⁶⁴ years to evolve.(Age of our universe is ¹⁰¹⁰ years).Forces within the nucleus must be very strong as it is very densely packed — If a human were a nucleus electrons would be roaming 100kms away.These forces are again only operational within the nucleus — If they could also influence electrons then there wouldn’t be any reactions and thus all change halts.\n\nIn all the processes all that we see is chemical reactions — mysterious blobs of matter coming together under the settings of the right environment .These blobs are made up of atoms whose nature allows them to form close groups — molecules.When these molecules are set in warm liquids and allowed sufficient time — they tend to form bigger and more complex molecules.Under the pressure of dispersal,molecules stumbled upon reproduction.Some of them were able to produce their replicas under the conditions of the environment.Now change addition to neighbouring molecules added to the diversity of the produced children.Those that are more fit at replicating gave rise to apes and thinking machines.\n\nBut ,what drives these changes ? All changes are observed to increase the entropy of the universe.This refers to all forms of change from planetary motion to the formation of perception.There seems to be a physical quantity that always increases with time.A slightly different phrasing might gives us a different expectation — all processes are directed towards increase of entropy.The second statement seems to indicate some cause that is increasing this physical quantity otherwise how can something increase out of nothing.This has raised entropy to an enigmatic stature — seemingly educated people making weird statements.\n\nInfact it turns out that law of increasing entropy is not even a law — in that it imposes no constraints.\n\nConsider 10 coins arranged in a row.Now you are tasked to randomly select one of the coin and toss it.You are trying to keep track of the number of heads in the experiment.Now let’s assume initial configuration started with all tails.Now as you proceed through the experiment on average system will evolve towards increasing number of heads.As all the events are purely random,let’s assume on trail 1 you got heads.Now we have 9 tails and one heads.In the next trail you are more likely to choose to toss one of the tails than the only head.Irrespective of the outcome of this trail — head or tail ,total number of heads in the system would either increase or remain same.\n\nNow consider the situation when you have 5 heads and 5 tails.Any further trail ,on average cannot change the count.When the number of coins increases — to the proportion of number of gas molecules in a room this nature will become increasingly evident.Irrespective of the initial configuration,system will evolve to ultimate chaos when not restricted.\n\nEnergy — an abstract concept that we associate with the capacity to do work varies in quality.Energy can be in various forms — from gravitational to thermal.When you take a room full of gas to describe it’s state(i.e the position and velocity of each molecule) we need vast amount of information.So we contend ourselves with average values like temperature.When we measure temperature of an object we have very little information of their actual state.Whereas consider a body raised above ground.The gravitational energy associated with it is same for all molecules.This is said to be of high quality.This tendency of energy to move from high quality to low quality — is captured in the Second Law of Thermodynamics or the law of increasing entropy.\n\nBut we can see how non-intervention and letting the system behave randomly can give rise to a fundamental law of the universe.The nature of the universe is inherently purposeless and needs no explanation.\n\nBut,our experience with other physical laws tells us that they are after all some constraints in behaviour — from newton’s laws of motion to Maxwell’s equations of electromagnetism.As our understanding is deepening we began to find much simpler explanations to these phenomenon.With the formulation of Einstein’s General theory of Relativity and formation of Quantum mechanics we began to see extraordinary simplicity in the workings of nature.It seems universe operates under no constraints at all.We learned that particles are waves and gravity is nothing but warped space-time.(2)Our notions of space and time reduced to one,so are of particle and wave.\n\nLet’s return back to entropy.Universe is drowning in chaos.Emergence of local order must inevitably creates chaos somewhere.Then what is stopping the collapse of energy — keeping it from flowing too fast.When we look around us there seems to be no where else in the universe that a life form controls the direction of flow of energy except on our planet.Rest everywhere universe seems to be mindlessly burning energy but it is all backed by a motiveless disintegration into chaos.Life and the apparent orderliness is afterall a brief trap before energy falls down the chain into more chaos.Gravitational energy has the highest quality.It protects us from the collapse.Freeman dyson — mathematician and physicist in Energy in the universe talks about other hangups that slows down this flow of energy.Other wise we should have been incinerated by now.It’s likely that ours is the only universe that survived to ponder about it’s existence.\n\nEven if we reduce all the complexity to a few basic phenomenon even them we seem to be left out with the task of precisely defining some forces and some fundamental particles whatever they turn out to be.\n\nThings behave and rules are our commentary on their behaviour.\n\nNow we have established all change as motiveless degradation of quality of energy.Now we will displace all the laws of universe.Things have their innate nature and their behaviour is in accord with their nature.We will see how laws are mere emergent illusion when the fundamental particles are let loose without any restrictions.Our perception and ultimately all our investigation is enabled by the fact that we can sense the world — see and feel.It all starts with light.We would Observe it’s behaviour and try to infer it’s nature.Than we can discard all rules.\n\nWe are taught light travels in straight lines and that they only bend at the interface of the separating media.This seems to be the rule that light follows,which is different from how other waves like sound travel.It’s also observed that speed of light is controlled by the medium of travel .Now, as it turned out this makes light bend at the interface of the media.Why does it do so ?\n\nA simple idea explains it elegantly — of all possible routes ,light travels in a path that takes least time.Similar rule — law of least action can be attributed to the motion of particles under force.\n\nLet me consider two arbitrary points(a ,b)on the either sides of two media A and B stacked on top of each other.If a light ray from a has to reach b it can choose to cover some distance in media A and some distance in media B.We can imagine some optimum values for these distances that ensures the minimum time requirement of our rule.Snell’s law captures this requirement by specifying the bend of the ray at the interface based on the refractive index of the media.\n\nBut,why does light hurry so much ?And how does it know in advance the briefest path ? In a perfect world,there should be no rules, just matter and it’s corresponding nature should be sufficient(at least until we dispel that too).Our imposition of rules are the manifestation of the nature of matter.Light is a wave so it behaves so.That’s all we need to account for all it’s observed behaviour.\n\nImagine if we were to let light travel in all possible ways.A wave is a periodic undulation of peaks and troughs.Imagine a light wave travelling from A to B.This will take any path unless forbidden.So it will reach B,through all possible paths.At B the resultant is the addition of all light arriving from all possible paths.So some will be crests,some troughs and a vast majority in between.But for every path there is a counter path that has opposite phase thus annihilating the effect.This means light can’t travel at all.But ,consider straight line from A to B.This seems to be the only path surviving interference effects.Other waves that can bend like sound and radio waves have more wavelength to survive slightly bent waves interfering.\n\nThe fact that these are waves is enough to explain it’s phenomenon.\n\nUnpredictability — The very definition of life:\n\nLife’s complexity can be traced down to genome.In previous parts i have tried to give a general flavour of how almost no rules or at the very least from utter simplicity — exceedingly complex phenomenon can emerge.In biology the abstraction of the genome offers perfect vantage point of study.To create the right architecture — as we have convinced ourselves that our brains are the inspiration.Consider your are an alien species visiting earth found a watch on the rock and trying to understand the working of it.Now,they hammered it to find out — they will see nothing but springs and wheels.Now we need to understand how each of them come together towards the working whole.The difficulty of the problem arises out of this complexity of interactions that we have to understand to come up with our version of the watch.\n\nOur instruction set is written in DNA.It’s long chain of four neucleotide bases — A,C,G,T.When you spell all these letters they constitute 3 billion letters for humans.These letters constitute ‘the plan’ of a human.Now suppose you have a plan for a building.It includes all the information about everything in the building — the bricks,mortar,electrical system,plumbing system etc.Now suppose you need to fix plumbing system for one particular room in the building.The plumber would take a copy of the plan — but only those pages that describe plumbing of that room.Now biology does very similar — here RNA polymerase reads the DNA ,finds the code for a particular protein and transcripts.This transcript is called — mRNA.Proteins are what we are made up of.But how does these processes represent life ?If we do not confuse life with consciousness then it’s pretty simple.Life metabolizes(uses up energy) and replicates.But how can we define life as it emerges from inert matter — as i warned take away consciousness(we will get to it later)and think what constitutes life ? The fundamental character is that it’s structures can edit themselves — the letters of the genome can mutate and change sometimes in response to the environment.Unlike machines that are engineered and behave in predictable fashion the very definition of life is evolution and unpredictability.Now we want to understand why does the phenomenon of life even exist ?\n\nNow let’s briefly look at computers — our greatest creation.Back in 1930’s Alan Turing realized that there is a way of building a machine that can in principle perform any logic — he called Turing Machine.He deviced a minimal mathematical description of such a machine. After few decades John Von Neumann decided to build one such machine.At that time they used vacuum tubes and valves for the construction.They typically have to solve the problem of making a machine that always gives right answers based on fundamentally unreliable circuitary.We still use the same architecture that they deviced in 1950’s but only instantiated on different hardware.The mathematical building blocks remained the same.Now our problem is the inverse — we are given life and asked to reverse engineer it.Our objective in deciphering the brain atleast for A.G.I is in understanding it’s computational principles — that might require us to understand all the biological detail.\n\nEvolution as darwin saw it :\n\nTo create a better carburator for your car we don’t need to know that matter is made up of atoms and less about the intricate forces between them.We don’t yet have a general consensus on the mathematical details of Bernouli’s principle(except that there is slightly less pressure over a moving curved surface than a flat one),that doesn’t stop us from making better flying machines.The point of this article is to convince reader that the best stratagy would be to incorporate the growing work in neuroscience and trying to build the computational model of the brain.If i am successful you would perfectly realize the role of our only model of intelligence(brain).We only have to figure out the architectural requirement of intelligence.\n\nThe living cell is the most complex system of it’s size known to mankind.How can such coordinated and complex system emerge ?Evolution is simple process but the details are a fascinating read.¹In the previous section we saw how evolution needs almost no explanation.Here we would look at some of the glitches we carry due to the inherent purposelessness of the process.\n\nWhy our brains are not optimal designs ?2\n\nBefore we embark on this process it’s important to understand few details of evolution.Evolution for that matter any change is a purposeless process — our brains are not optimal designs.As the Nobel Laureate Francois Jacob (1977) put it, evolution is a tinkerer, who ‘‘often without knowing what he is going to produce … uses what ever he finds around him, old cardboards, pieces of strings, fragments of wood or metal, to make some kind of workable object … [The result is] a patchwork of odd sets pieced together when and where the opportunity arose’’.In the same token our brains gullibility(Kahneman, 2003; Tversky & Kahneman, 1974 or refer Thinking Fast and Slow) clearly indicates our brains are merely a workable object , a compromise forced by the limitation of resources(an infinitely rational or a machine that could make optimal inferences in all situations would consume infinite resources.) and the constraints of evolution(Evolutionary inertia (Marcus, 2008) — the idea that evolution is constrained by previous history).\n\nWhen evolution figures out better solution older ones are not discarded.This is the reason we still possess our old reptilian instincts — they take over us in times of pressure.We struggle between reflexive and deliberative(Marcus, 2008) modes even after realizing the merit of one over the other.\n\nThe unification of the physical laws:\n\nIt’s important to not make unnecessary assumptions in our search for AGI.That would seriously impede our development.Early sybolists thought mere juggling with symbolic representations would solve A.I — largely driven by a very wrong assumption which later Connectionists came with neural networks that allow for forming much richer representations.Tiny developments in the right direction are far better than hastening into dead ends.\n\nFrom this section of the text i would take a bit formal stance,for those of you who have come here for some artificial intelligence stuff — here it begins…\n\nIn a way — field of Artificial intelligence has become much easier.Neural networks have become lingua-franca in all possible domains — from computer vision to complex control problems.A more representative word would be universal function approximators. Their limitation is evident — they would be great for narrow intelligence.Only reason of their recent success is beceause of the abundance of data and computing power.So,unfortunately both of them are going to improve in coming years which not only fuels their performance but also corresponding research and funding.It is important to realize why we started all of this in the first place.\n\nTraditional pattern recognition problem deals with finding optimum or valuable features of the problem.For a long time people have tried to use logic based and purely mathematical methods in hope of one day coming up with human-level A.I.This has halted the true development of A.I for decades.\n\nAlan Turing has proved mathematically that all computing devices are essentially equivalent and in proving that he imagined a 1. processing box,2.a paper tape,3.a method to read and write off it.He called it — Universal Turing Machine.In later decades this has set off computer era.Though he couldn’t figure out how to create human level intelligence,proposed a test for finding if we have reached the goal ,the famous Turing test— when an A.I converses with a human and tricks him into thinking that it’s a human.This focus on behaviour rather than the underlying process has made people to think that brain is a symbol manipulating device.Language is manipulation on words and vision is manipulation of objects and their locations.So,it doesn’t matter how you implement it — as turing proved.If brain uses network of neurons ,we will use transistors.\n\nIn 1943 neurophysiologist Warren McCulloch and the mathematician Walter Pitts published an influential paper where they argued how neurons can act as logic gates.This has essentially proved that brains contain the fundamental building block of the computers.So without further biological proof they assumed that brains are nothing but computers.In later decades A.I pundits even predicted that they are close to human level A.I (it’s funny how similar thing has happened with physics before the discovery of quantum mechanics and relativity).\n\nIt’s important to realize how associating intelligence to outer behaviour is not the right method to access our development.It makes no sense to say that Deep Blue — the famous chess program that beat Gary kasparov has any understanding of chess.Turing Test only makes sense when we have reached the destination.Meanwhile we should try to emulate human brain as almost all the state of art developments in A.I have come from some form of inspiration from neuroscience.(Neuroscience-Inspired Artificial Intelligence-Demis Hassabis, Dharshan Kumaran,Christopher Summerfield).\n\nCreating human level A.I is hard.Really hard.The search space of possible solutions are vast and we can easily be tricked.Our only source of inspiration is our brains.I do not say there can’t be other ways to intelligence but only that searching for them wouldn’t account for a good stratagy.Even neuroscientists seems to not have much idea of how intelligent processes happen within brain.Much of our knowledge about brains came from Functional imaging.However they cannot capture rapid changes.So,not until recently we couldn’t even look at the processes happening in realtime.For long time the field of A.I has fancied with creating intresting things — hand writing recognition,anomoly detection and other pattern recognition problems.These are of great practical value but this has got little to do with our understanding of intelligence.\n\nIt’s also important to distinguish superfluous details from truly important ones.Our brains are filled with lot of garbage — evolutionary junk.I suppose our solution to intelligence would be more elegant than our brains as they have evolved to cater very different needs.\n\nAround 3.5 billion years ago multicullular organisms evolved.They offered better rate of survival.With them the complexity of their processes have also increased.The nervous system allows for fast responses via electrochemical signaling and for slow responses by acting on the endocrine system.⁴Nervous system accounts for the (1)evolvution optimal sensors and effectors that allow it to maximize its control given finite resources and (2) evolution of a behavioral repertoire that maximizes the information gained from the environment and generates optimal actions based on available sensory information⁴.\n\nSo our brains primary motive was internal coordination — allostasis(refers to the predictive regulation of biological parameters in order to prevent deviations rather than correcting them post hoc⁵).Our sense of joy on the achievement of goals,feelings of love and sorrow that direct our actions — intrinsic rewards — are evolutionary hack to improve our survival rate.Our capabilites to go through short term difficulties(inherently unpleasurable actions) are our learned association with them.So our behaviour arises out of this continual competition between drives and incentives that have adaptive value(Davies et al., 2012)⁶.\n\nWe have spent most of our evolutionary time as hunter-gatherers which have influenced our behaviour patterns.Our goal is to understand the brain at algorithmic level not implementation level.All the complexity attributed to the variety of cells and the wiring of neurons in the brain when seen in the light of understanding the basic algorithm would seem a lot less daunting.More importantly we should focus on the neocortex(the seat of intelligence where much of language and reasoning happens) and it’s remarkable homogenity of structure.In 1978 Mountcastle published a paper titled “An Organizing Principle for Cerebral Function.” In this paper,he points out that the neocortex is remarkably uniform in appearance and structure. The regions of cortex that handle auditory input look like the regions that handle touch, which look like the regions that control muscles, which look like Broca’s language area, which look like practically every other region of the cortex.⁹\n\nConsider what according to me is the coolest achievement of the present state of art(march,2018) in A.I — we have made algorithms(AlphaGo) that beat human expert in the game of Go(considered more subtle and hard game than chess for machines).AlphaGo is initially trained on 28.4 million positions and moves from 160,000 unique games(by using a combination of deep convolutional neural networks (convnets) and Monte Carlo Tree search (Silver et al., 2016))⁸ played by human experts; it then improves through reinforcement learning, playing 30 million more games against itself. Between the publication of Silver et al. (2016) and before facing world champion Lee Sedol, AlphaGo was iteratively retrained several times in this way; the basic system always learned from 30 million games, but it played against successively stronger versions of itself, effectively learning from 100 million or more games altogether (Silver, 2016)⁸. In contrast, Lee has probably played around 50,000 games in his entire life.\n\nMaybe that’s not an accurate way to compare given the pretraining humans receive in terms of the transferable skills they bring to the table even before they start learning anything unlike neural network based models that are trained from scratch.But there is a fundamental differences in the flexibility of our learned representations— Consider various possible variants of the game Go.The wikipedia page “Go variants” describes versions such as playing on bigger or smaller board sizes (ranging from 9×9 to 38×38, not just the usual 19×19 board), or playing on boards of different shapes and connectivity structures (rectangles, triangles, hexagons, even a map of the English city Milton Keynes). The board can be a torus, a mobius strip, a cube or a diamond lattice in three dimensions. Holes can be cut in the board, in regular or irregular ways. The rules can be adapted to what is known as First Capture Go (the first player to capture a stone wins), NoGo (the player who avoids capturing any enemy stones longer wins) or Time Is Money Go (players begin with a fixed amount of time and at the end of the game, the number of seconds remaining on each player’s clock is added to their score).Human players can understand these variants and adapt to them because they explicitly represent Go as a game, with a goal to beat an adversary who is playing to achieve the same goal they are, governed by rules about how stones can be placed on a board and how board positions are scored. Humans represent their strategies as a response to these constraints, such that if the game changes, they can begin to adjust their strategies accordingly.⁷\n\nConsider grid of cells coloured red or black based on simple rules.The concept is better illustrated through the following example."
    },
    {
        "url": "https://medium.com/@vinnuvinay008/understanding-deep-learning-generative-adversarial-networks-b10cbd22d85e?source=user_profile---------2----------------",
        "title": "Understanding Deep learning — Generative Adversarial networks.",
        "text": "This series is aimed at readers who have already heard the ideas discussed here but looking for deeper understanding.Machine learning is fastly changing.Now,i can’t imagine the practical need to use svm’s .Neural network models could almost always replace svm’s.But,they were clear state of art until recently.My point is understanding the logical evolution of ideas is more important than the algorithms or fancier architectures..\n\nSo let’s get going.GAN’S are generative models that will learn the distribution of data to generate new points.Imagine a random image(sampled from gaussian distribution) sent through a neural network.The output of the network is also of same size(image).Now if we could tell the network to tweak it’s parameters until the output image is close to our reference image but different,we got a generative model.It could generate images from random noise.The only requirement is that it should be differentiable to let us nudge the weights with backprop(for introduction to backprop refer part-2).\n\nSo ,we could use a classifier to tell us if the generated image is fake or real.That is if we feed the output of the generator to the classifier ,it should spit out the probability of it being real.If we could devise a cost function that can make generator produce more realistic images and the classifier to more accurately identify fakes …… we got a GAN.\n\nImportant thing to notice here is the classifier is not pretrained.It is trained along with the generator.\n\nstage 1: Take some samples of random noise to get fake data and some actual data points(real data) to train the classifier.\n\nstage 2:Keep the weights of the classifier locked and use the output of classifier to train generator.\n\nThis process keeps on alternating until it converges…\n\nNow,let’s look at the actual loss function we are looking to minimize.\n\nNow in stage 1 we start with generator and tune classifier.\n\nNow we seek to find the argument G that minimizes the loss with given D*(x).\n\nThus,we see how we could eventually land up with our generator distribution closer to the data distribution….Now,if you have managed to come this far you are good to read some of the orginal papers..understandig gan’s,goodfellow’s generative adversarial nets."
    },
    {
        "url": "https://medium.com/@vinnuvinay008/an-exploratory-guide-to-deep-learning-backpropagation-bd59bdcb1937?source=user_profile---------3----------------",
        "title": "An exploratory guide to deep learning — Backpropagation",
        "text": "This is part 2 of the series,for the introduction — part 1.In machine learning we often start with an inductive bias i.e before we let the data determine the right set of weights or parameters , we constrict the function space.For example, in case of linear models(svm’s,linear regression,random forests etc) we expect the underlying distribution to fall into our hypothesis space before actually looking at the data.Deep learning though offering infinite flexibility in terms of functions it can approximate,it’s been hard to train big networks(with lot’s of weights).\n\nConsider the above figure from part 1,we initially start with random weights that throws out a random output.Now if we could find a sensible way of measuring the departure of this output and tweak the weights(preferably all of them at once) we could expect the network to eventually have the right set of weights.But,we could as well change them one by one (in a network with millions of weights).That would save us this post(no,backprop…).Is that a reasonable policy…let’s figure out.We will start with a linear model and see if we could find the right weights by constructively trying out different values.\n\nLook at the above code carefully ,we started out with random ‘w’ and changed it by 0.5(arbitrary choice) in the direction of decreasing l_sum.Here loss is defined as (y_pred- y).\n\nBut,in case of neural networks we got no way of knowing the direction of change in ‘w’ to decrease the loss as the relationship between loss and parameters is no longer linear..(i.e we can’t expect to reduce ‘w’ to reduce loss).Also if we got multiple weights say w1,w2 in our model we have to perturb them together (4 combinations of w1 and w2 i.e increase w1 and w2 slightly,increase w1 and decrease w2 etc.) to find the right combination.I think we can quickly see now how a network with millions of weights becomes infeasible to tweak for right weights.\n\nThis wouldn’t be complete introduction to calculus but a refresher if you have already tackled it once.Particularly,we would try to figure out how to tweak each variable of a multivariable function to move it in the right direction.\n\nConsider the above function,in case of one variable functions derivative refers to the ratio of the change in ‘y’ when there is a slight nudge in ‘x’.But,if ‘f’ depends on more variables than we could define partial derivative i.e change in f on changing only one variable keeping the rest constant.In the above function if we let y = 1 as constant ,than P.D w.r.t ‘x’ refers to the solpe of the function on the plane.Similarly we could have P.D w.r.t ‘y’.(i.e ‘x’ as constant )\n\nSo but at a given point on a function we could pass a plane in any direction.Thus,our nudge in independent variables is a vector.\n\nSo,this brings about the concept of directional derivative.Our task now is to find out the right direction to decrease our loss function,this would let us tweak all the variables at once and eventually reach global minimum.We would later prove gradient is the direction of steepest increase of a function.Thus we have to move in the opposite direction to rapidly decrease a function locally.\n\nI think it is obvious to see directional derivative as the change in function when we move along a direction.It could be represented as a dot product between gradient and the unit vector in that direction….\n\nTo prove gradient as the direction of steepest ascent,it’s helpful to see directional derivative as the dot product between gradient and the unit vector w.\n\nSo ,to maximize the change in function for a given change along w,it’s sensible to make both gradient and w point along the same direction.\n\nThus , a function changes most rapidly along the direction of gradient.Now ,how to compute the gradient of a function with millions of weights faster…..\n\nThe idea of backprop is pretty simple,once if we could see how the chain rule makes sense i.e change in f due to slight nudge in x is equal to the product of chage in q(intermediate variable) and change in f due to this change.The reason for defining these intermediate variables might seem quite arbitrary at first,but if i say at each node if i keep track of the partial derivative of the output w.r.t inputs that would let me update all the weights at once..(look at the figure carefully to verify)\n\nThus a complex loss function can be represented as a computational graph(the one shown below) with each node keeping track of forward computation and gradients of the output w.r.t inputs.."
    },
    {
        "url": "https://medium.com/@vinnuvinay008/an-exploratory-guide-to-deep-learning-part-1-3d116e552d4d?source=user_profile---------4----------------",
        "title": "An exploratory guide to deep learning — Introduction",
        "text": "Deep learning techniques in computer vision has surpassed human level accuracy i.e now a computer can more accurately tell if a given picture is a cat or dog.In this post we will get a feel for the mechanics of the process that makes it possible.\n\nLet’s represent an image by a point ‘x’ (a bunch of pixel values) and try to figure out set of rules for any image classification task — here recognizing faces.Our visual system is incredibly complex and each scene goes through complex chain of image processing tasks.Let’s assume(for the sake of simplicity) that we could weigh set of binary decisions like is there an eye in the top left of the image or is there a mouth at the bottom etc to decide a face.Though seemingly grossly incorrect we would see how this approach would finally outperform (with some tricks and hacks) humans.\n\nAlmost any sort of intelligent task can be seen as passing a set of inputs through a function or a mapping (it can be dynamic) that spits out the actions or the results.For image classification we got to find a mapping from ‘x’ to ‘y’ to indicate whether it’s an image of face.\n\nWhat if we would come up with a series of transformations(mappings) from input space to neatly split all the images into two classes face and non-face.For instance i might come up with an arbitrary rule like if the sum of all the pixel values of my image are greater than 1000 (consider all images are of equal size) than they are faces.Ok,that’s too naive to be useful but what if we would let our algorithm figure out the right set of rules by only providing the error on each prediction.This is the fundamental idea behind deep learning.To make our function space rich enough we include non-linearities like relu,sigmoid,tanh etc.\n\nNote:Multiple arrows from each neuron indicates a single activation duplicated to form inputs for next layer.\n\nConsider simple mapping y = mx + c that takes an input x and maps to y with m and c as parameters.\n\nIn case of our image data we will have x as a vector of image size as input with m and c as corresponding vectors of variables whose values we got to tweak.Our aim would be to reduce error.Our mention of non-linearities simply means passing output y through a non-linear function like sigmoid.\n\nTheoretically the form of non-linearity doesn’t matter(we will discuss them in the future posts),so for now take sigmoid as a convenient substitute.So each circle in the above figure performs a liner operation followed by a squashing function like sigmoid.Virtually all the neurons are same except each one taking the output’s of previous layers as inputs.Output will be 1 or 0 indicating face or non-face(here as the last neuron also has sigmoid activation we will get values between 0 and 1 indicating the probability of face).But,how will we figure out the right weights.That’s the question of next post(Backpropagation).\n\nNOTE : It takes some time and practise to actually appreciate how nothing but the above structure can perform arbitrary complex tasks from image recognition to language models.We would be building some along the way.."
    },
    {
        "url": "https://medium.com/@vinnuvinay008/machine-learning-tricks-avoiding-the-information-leakage-trap-ce1e2ca7fcc0?source=user_profile---------5----------------",
        "title": "Machine learning tricks — avoiding the information leakage trap",
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out."
    },
    {
        "url": "https://medium.com/@vinnuvinay008/your-first-machine-learning-program-92c2a6ca2a16?source=user_profile---------6----------------",
        "title": "Your First Machine Learning Program – vinnu vinay –",
        "text": "There are two strategies for learning a new skill.You can either start from scratch and take a linear approach or jump right in and learn along the way.This series are for those of us who embrace this non-linear approach to learning.Here we will test our predictive powers with various classification algorithms.If you are a complete beginner this would be a perfect start,go on just read the code and google everything that seems out of place.I would start more structured posts from next session, so till them explore ML…\n\nBonus : If you are a beginner and has some experience programming then start with Python:Deeper insights into Machine Learning.I have scouted for month’s before finding this gem.Trust me i have tried dozens of titles before sticking to this one.Author has divided the book into modules making it easier for us to learn at our own pace."
    },
    {
        "url": "https://medium.com/@vinnuvinay008/evolving-the-second-brain-part-1-6933a541c505?source=user_profile---------7----------------",
        "title": "Evolving The Second Brain(part 1) – vinnu vinay –",
        "text": "In this post i will try to lay the framework of my inquiry of finding out ways to live better life.We are prone to far too many biases and invalid mental structures that determine what we experience every day.My aim is to find out simple principles that make a good life effortless.Here’s what i copied,tweaked and learned from various people,disciplines and life.\n\nWhat do we want out of life ? More important is the question- Are we designed to lead a happy and satisfying life ?Our anatomy sets limitations to our activities.We need eyes to see,legs to walk and brains to think.But our brains seem to play the whole game.\n\nThen, what determines our brain,our thinking,our deepest instincts and needs ?Why are we they way we do? All attempts to answer these questions were futile until 1859.His name was Charles Darwin.His observations brought a fundamental shift in how we view life.\n\nThe Theory of Natural Selection and Why We Make Poor Choices ?\n\nNatural selection is not a game nature has devised to make way for the more fitter and saner species.It’s a motiveless pursuit where the most ruthless and selfish gene of the lot survives.Consider some group of animals of which a mutant is born — for example this guy is slightly more aggressive than his peers.Even if this new quality gives slightly more advantage in terms of it’s basic survival needs like gathering food or procuring female,in the long run it’s gene stands more chance of remaining in the lot.But this process takes time.It is not guaranteed that at any time the majority members of the species are the ones most suited to the environment.The mutant members might not have yet disrupted the population or it might be the case that the conditions have changed unfavorably to wipe out this new trait.\n\nBut,what is a gene?What does it do?\n\nGenes are what makes up our body.These are the code that determine everything from the way our bodies are built to the secretion of right enzymes.We inherit 46 chromosomes from our parents that go into each cell our bodies.Each chromosome is made up a chemical DNA.Genes are the segments of our DNA — a sequence of four chemical molecules:adenine ,guanine ,thymine and cytosine.\n\nThe job of genes is to make proteins — the building blocks of life.Neurotransmitters are the special proteins that trigger electric impulses in our brain.It’s the Neurotransmitter serotonin that is associated with stress and depression.It’s the chemistry in our brains that determine how we feel and act.\n\nThere is more to the story, it’s not some mean genes that determine our lives.Sometimes a gene is ‘’switched off’’ and can’t make proteins.Scientists discovered a mechanism called RNA interference that could switch off a genes.\n\nThe question of Nature vs Nurture\n\nLife is highly interdependent,there are no specific gene for happy life nor does our parental inheritance determine our fate.Our genetic expression(The on and off of particular gene) depends on it’s environment.Neural connections we make are shaped by our life experiences.Our experiences in turn depend on our state of mind.\n\nHere is where our approach differs .We will first tame the beast.We do not try to fight our biochemistry.We are pre-built with the neural connections that determine our interpretation of certain events.Our brains have evolved in completely different circumstances than us .We have spent much our time on earth as wild foragers.From our unnatural fears of public speaking to our appetite for excessive spending we owe a lot to our ancestral foragers.Evolution has left us with deep traits that are geared toward the optimal sustenance of a hunter-gatherer rather than a modern city dweller.To thrive and live to our fullest our present conditions we need a far differently equipped brain.\n\nHow can we seduce ourselves to take the path less traveled.It turns out that one’s who did offers us many insights.Here we will explore ways to raise above our limitations,make uncomfortable choices and lead more joyful lives.Now that we laid some foundation and gained some understanding of what drives us — in subsequent posts we will focus on the specific tools and strategies evolved by some of the most successful people .We will figure out how they manage to short-circuit their ancestral motives to overcome their fears and weaknesses."
    },
    {
        "url": "https://medium.com/@vinnuvinay008/make-your-mind-your-bitch-b60d9b671d35?source=user_profile---------8----------------",
        "title": "Make Your Mind Your Bitch.. – vinnu vinay –",
        "text": "Iron will and indomitable spirit sounds good in theory.In practice this attitude blinds us to the simple and often effortless solutions.We have limited Will power at our disposal everyday.It’s okay to miss on schedule,to leave a blank in our to-do-list.Instead i urge you to try a more subtle approach — create conditions that make doing things easy.Will Power is mostly wasted when we want to incorporate new habits.We either start with unreasonable expectations or don’t start at all — high expectations puts us in a vicious cycle of losing self-esteem which further shackles the deck.\n\nSo next time when you take on one of your failed resolutions,do this — make it ridiculously simple,put subnormal expectation.Don’t worry,this has inverse effect.You got to tame the beast before the show.\n\nPlanning to do a 20 minute meditation every day — make it 5,even better a single conscious breath every day.Aim for consistency and feel good about it,rest will follow.\n\nSo the hack for bringing huge consequential changes in our life is to start with simple too-easy to fail commitments.Consider any over-performance as bonus and make sure to celebrate it.This has the added benefit of freeing up our energies which are otherwise wasted on will power."
    },
    {
        "url": "https://medium.com/@vinnuvinay008/the-fallacy-of-the-immediate-7cc9fc376576?source=user_profile---------10----------------",
        "title": "The Fallacy Of The Immediate – vinnu vinay –",
        "text": "When i was kid i read somewhere that said children can be classified into two groups — those who could delay gratification and those who succumb to immediate pleasure at the cost of future discomfort.This natural tendency developed in early childhood seems to provide unfair advantage to the child in later stages — the former are found to be more happy and satisfied.I remember hiding my chocolates in weird places.\n\nIn THINKING FAST AND SLOW author Daniel Kahneman illustrates how our brains are trying to put us on autopilot -our propensity to seek the easy and avoid mental strain (that’s why most of us don’t like mathematics).It’s partly why we learn and adapt faster but our fear of change ,resistance to innovation,faith in culture and religion are misfire of this mechanism.\n\nEven nations make bad economic policies and swayed by false logic often by not considering secondary consequences.\n\nIt’s funny how economists invent reasons to see war as economic growth.They say germans or the japanese had a post war advantage as their old plants are destroyed which could be replaced with modern and more efficient ones.If that’s the case,others could easily offset it burning their plants down.Some of the countries in which there was greatest destruction, such as Germany, have advanced more rapidly than others, such as France, in which there was much less.Hazlitt says it’s because they confuse need with demand.Germany showed faster growth partly due to better economic policies and desperate need to get back to normal conditions.No doubt people worked harder,but to no man it’s advantageous to burn down his house to stimulate his energies.Hazlitt further says\n\nOn individual level many have observed the gullibility of human mind,the need to train and safeguard from false logic.The most notable example that comes to my mind is legendary investor charlie munger .If you have never heard about his mental models — his secret sauce to make right decisions amidst the chaos of the financial world read this -"
    },
    {
        "url": "https://medium.com/@vinnuvinay008/beyond-culture-c72f3d350cec?source=user_profile---------11----------------",
        "title": "BEYOND CULTURE – vinnu vinay –",
        "text": "Each one of us are scattered into various groups of religion,dogma,beliefs and customs by birth.We derive our sense of moral righteousness and reasons for guilt through the threads of our tribe.Belongingness is closely akin to love,we have primitive instinct to confirm,to meet the standards of our tribe — this have enabled us to build increasingly sophisticated societies.It is a peculiarity\n\n of modern communities that they are divided into sets which differ\n\n profoundly in their morals and in their beliefs.Catalysed by Renaissance thence came Protestants and Catholics, who differed not only in theology but on many\n\n more practical matters. There were aristocrats who permitted various kinds\n\n of action that were not tolerated among the bourgeoisie.\n\nVirtually on every imaginable aspect people have divided into sets.Muslims are allowed to eat meat after performing elaborate rite involving cutting the front of the throat, the carotid artery, trachea, and jugular veins of animal and the performer instructed to look into the eyes of the animal until all the blood is drained,then the Islamic prayer ‘Bismillah’ purifies the animal.The whole process seems to be designed for optimal pain for the animal and awoke reasonable remorse after some slaughters in any human being.It may as well been a best slaughter-control protocol if not left to free intrepretation.\n\nThis whole process of indoctrination by culture severely limits our capacity for joy,innovation and change.Just because something is not widely practiced,shouldn’t discourage us doing it.To find anything new we need courage to abandon the known.But we have premordial instinct that takes over every time we act,it’s been optimally designed to survive in wild — we form habits that eventually passes over the guard of reason and flow through us unnoticed.\n\nMy own belief is that a conscious thought can be planted into the unconscious if sufficient amount of vigour and intensity is put into it.Most of the unconscious consists of what were once highly emotional conscious thoughts,which have now become buried.It is possible to do this process of burying deliberately,and in this way the unconscious can be led to do a lot of useful work.\n\nWe can take control of our life to go beyond the expectations of our tribe,to truly fathom the possibilities of life.Only with a tinge of madness and disregard for status-quo can we leave our dear past ,fight-back the comforts of conformity."
    }
]