[
    {
        "url": "https://medium.com/@bilalak90/artificial-intelligence-and-deep-learning-ed409189829d?source=tag_archive---------0----------------", 
        "text": "Hard to believe, there are people who still think that we will never be able to replicate human intelligence; let alone surpass it. We live in an era where computers are already better than humans at performing a number of tasks. We are producing quintillion bytes of data on a daily basis, with huge data being processed automatically for classification and extraction of useful information. Our reliance on machine intelligence is only going to become greater with time, and there is a growing need for artificial intelligent systems in every field.\n\nThe notion of Artificial Intelligence (AI) has always been the main subject of certain mainstream movies (my all time favorite The Matrix) and novels around the world; where, often, the writers depict the world being taken over by artificial self-replicating intelligent robots, and humankind being forced into slavery. Such an AI is still a very far fetched idea, and computers are currently very far from human intelligence and learning from their ‘404s’. Deep learning or deep machine learning is what powers present AI; it is loosely based on information processing and communication patterns in a nervous system (see artificial neural networks) — yes, your brain actually works by generating a neuronal response based on a certain stimuli (I think this makes us advance machines as everything about us is scientifically explainable — nothing magical there!).\n\nThere are two types of deep learning methods, namely supervised and unsupervised. In simple terms, in supervised learning the system is ‘taught’ who is what significant number of times (like what traits should be expected for a given classification), and then is expected to predict this on its own for new inputs (for example, identifying if an article belongs to sports or politics). In unsupervised learning it is left on the learning algorithm to figure out patterns in the data provided which are unknown beforehand. This kind of learning can be powerful because it assumes no pre-discovered classification of examples (for example, given a set of articles, cluster related ones together). You’d be surprised to know such unsupervised deep learning has been applied on different games like chess, and, with time, a computer was eventually able to beat some of the best chess players in the world! (Read more about it here)\n\nImagine a future where unsupervised nano-robots can apply deep learning algorithms to distinguish between cancer and normal cells, and are able to destroy these ‘rogue’ cells immediately on formation. An AI taking care of network security whereby using deep machine learning these networks can be secured by an unpredictable intelligent decision making. An implanted AI chip that can allow humans to have ‘superpowers’ like analyzing and decision making based on enormous data; imagine if in a complex situation you are able to process multiple outcomes based on different scenarios in mere nanoseconds and an implanted AI system sifting through it to come up with the best or safest solution (yes, sign me up!). While the implications of AI can be catastrophic as well, but that is beyond the scope of this article.\n\nI believe, there is still a very long road ahead for developing a true AI system. While the term Artificial Intelligence has been used very broadly like a software able to classify random pictures, such systems still follow exact algorithms. A true AI system would be when a computer can deviate from its own programming or set of instructions. With Quantum Computers on the brink of development, we could see massive progress in AI sooner than we think!", 
        "title": "Artificial Intelligence and Deep Learning – Holberton School –"
    }
]