[
    {
        "url": "https://medium.com/@olivercameron/the-future-is-amazing-9bb90c4742a9?source=tag_archive---------0----------------", 
        "text": "This week has delivered in a major way.\n\nFace2Face is real-time facial reenactment using commodity web cams. The use cases (both nefarious and otherwise) for this technology boggle the mind.\n\nIf you were to pair this astounding text-to-speech engine with Face2Face, you potentially have the ability to clone an individual (with or without his/her permission) in a virtual environment. For added creepiness, read How Virtual Reality Will Let You Talk to the Dead.\n\nEveryone will be carrying one of these in their pocket!\n\nImagine if the entire ocean was monitored 24/7, akin to what Planet is trying to do with satellite photography. That’s Saildrone.", 
        "title": "The Future is Amazing – Oliver Cameron –"
    }, 
    {
        "url": "https://deephunt.in/deep-hunt-issue-6-ed39c5acde95?source=tag_archive---------1----------------", 
        "text": "Intel is buying Movidius, a startup that makes vision chips for drones and virtual reality\n\nIt’s the latest in a string of acquisitions for the chip giant. Intel hopes to pair Movidius’ technology with its own RealSense depth-sensing camera technology.\n\nGoogle Partners With Chip Startup To Take Machine Learning Out Of The Cloud And Into Your Pocket\n\nGoogle’s machine learning group is licensing new chip technology to make the devices in our pockets more intelligent and autonomous. Read Pedro Domingos’s opinion on how ML and hardware will change each other\n\nThe Université de Montréal, McGill University, Polytechnique Montréal, and HEC Montréal will receive $213 million split between three projects related to research in artificial intelligence, brain health, and medical technologies.\n\nA recent study found computer software was able to intuitively translate patient charts into diagnostic information with 99 percent accuracy at 30 times the speed of doctors.\n\nIBM and Nvidia team up to launch a new server purpose-built for machine learning\n\nIBM today announced the launch of the aptly-named IBM Power Systems S822LC for High Performance Computing.", 
        "title": "— Issue #6 –"
    }
]