[
    {
        "url": "https://medium.com/interaction-design-service-design-principles/deep-learning-build-from-raw-data-4828a565aa40?source=tag_archive---------0----------------", 
        "text": "With the resurrection of researches conducted in AI, there is a proliferation in the field of machine learning, and especially Deep Learning. Its idea is to autonomously learn things from putting together raw data.1 This technology is most popularly used in speech recognition, where raw waveforms are algorithmically put together to form words. Then there’s the sophisticated facial recognition system that companies like facebook or Google have developed, with their cat-face readers and human face recognition systems like FaceNet that records 260 million faces at a 97% accuracy.2 The reach of facial recognition system is more prevalent than you might think. London and NY have been implementing complex webs of surveillance system throughout their cities where every nook and cranny are monitored, and the networks of surveillance cameras is ubiquitous and omnipresent.\n\nThe technology behind today’s surveillance camera system is becoming more advanced everyday, where the computer deep learns patterns in pedestrian detection and face recognition as well as crowd behaviors and segmentation.3 But there’s the issue of privacy invasion. It’s frightening to think that all that you do and everywhere you go is not only being tracked and recorded, but is also being shared via the cloud, mobile device, the TV, the database — the Internet of Things — to which practically any hacker with network connection can gain access.\n\nAnd what about the possibility for inaccuracy in pedestrian/passerby detection, say, in crime scenes? Cameras are being programmed to automatically sift through the massive database to look for specific faces, but what if it detects and presents to the law enforcement a person with similar facial features and gait but someone who wasn’t involved with the crime? At its extreme, it is a harassment of basic human rights and dignity and regardless of how sophisticated the machine learning system could be, extreme measures shouldn’t be taken solely upon relying on the machine’s analysis.\n\nCameras and facial recognition by themselves may not have that much power over us — it’s the context in which they’re used that is disconcerting (e.g. it’s largely dependent on how the government would use it). Weighed against other security measures we get subjected to at airports, museums and concerts, deep learning surveillance cameras just might make for a more effective and an even pleasant experience. In the right hands, Deep Learning surveillance with the IoT can help with trivial and everyday things like automobile speed limit regulation, to decrease in crime rates.\n\nIf computers provide practical tools for our physical bodies, the Internet gives us a chance to express our mental selves. Deep Learning surveillance may make jobs easier, but with the Internet of Things being an extension of our society, it should be noted that it’s capable of generating both positive and negative outputs from whatever we feed them.", 
        "title": "Deep Learning Cameras, Faces, and the Internet of Things"
    }
]