[
    {
        "url": "https://medium.com/@lancelegel/thanks-for-the-critical-review-with-a-constructive-tone-which-helps-to-highlight-a-lot-of-current-53d92d819c25?source=tag_archive---------0----------------", 
        "text": "Thanks for the critical review, which helps to highlight a lot of current shortcomings facing the “deep learning” community.\n\nTo focus on an “ugly” property that may be more beautiful than you think — robustness to “fooling”. The results you point to are indeed “intriguing properties of neural networks” (http://arxiv.org/pdf/1312.6199v4.pdf). It’s important to recognize, however, that the image alterations that “fool” the network were not randomly generated — it was not “just a little bit of noise”. Actually the alterations were based on an optimization that solved for the minimum alteration possible that would “fool” a network, and these alterations always exist in “low probability (high dimensional) ‘pockets’ in the manifold”. It’s indeed all about the data set, and by identifying your “known points of highest potential confusion”, you can actually better seek out clarity in your future training. For relevant additional reading on why deep neural networks tend to generally succeed very well in non-convex optimization, here is a great read: http://arxiv.org/pdf/1406.2572v1.pdf\n\nJust to comment on Brad Pitt’s frustration with black boxes: I totally agree, and there’s a huge amount of opportunity for solving problems here, both for supporting general scientific research and development, but also for driving new breakthroughs in how learning is understood and implemented. At the same time, I often wonder about the concept of “trust” in intelligence: why do so many of us simply trust Google Search, which is one massive black box? In any case, I’d say that being able to communicate complexity in “universal” terms is indeed an extraordinarily valuable ability in developing collective intelligence, but it’s an ability that many amazingly talented humans lack, too. :)", 
        "title": "Thanks for the critical review, which helps to highlight a lot of current shortcomings facing the…"
    }
]