[
    {
        "url": "https://medium.com/@lauradonnelly632/teaching-learning-changing-growing-11116cb7a434?source=tag_archive---------0----------------", 
        "text": "I was raised by generations of perfectionists. I was also raised to believe that what I did was more important than how I looked, that my ideas have as much value as anyone else’s, and that if I committed myself to something, worked hard, and did my best I would succeed. The fact that this isn’t always the case is a hard pill for me to swallow.\n\nUsing the Alexander Technique I’ve been able to look at my most unhappy times with an awareness that I have a choice about how to move through the situation. I can push against it, be angry, try harder and harder to do everything exactly right — these choices would be my first responses. Observing myself, allows me to see how my thinking is helping me become easier in my body, my movements, and my thoughts, or making me less easy. Since I cannot control what comes at me from outside, I must choose to respond to events in ways that allow me to become easier or not. Through each experience and each choice I’m learning things that will change how I think, which in turn will change how I act, and move in the world. As Eleanor Roosevelt said:\n\nMy first Alexander Technique lesson was in the mid 1980s, and since then I have relied on the concepts and principles of the Technique in my teaching, my personal interactions, and my life. Encouraged by Mio Morales my long time Alexander Technique teacher I began teaching the Technique.\n\nIt’s changed my life. The only way for me to teach the Alexander Technique is to practice it myself. As a result I’m always learning — about my body and the human body in general, about how others learn and how I learn, how to communicate more effectively, and new ways to encourage myself and others to let go of habits so we can discover new ways of being. Understanding how profoundly our thinking habits influence the ways our bodies move and how we process information provides endless opportunities to learn, grow, and change.\n\nDeveloped by F.M. Alexander at the end of the 19th Century, the Technique is named after him. Alexander delineated five key concepts and two major principles. The Principle of Prevention on a General Basis or Inhibition, allows us to stop our habitual actions whether physical, emotional, or mental. Stopping an habitual action (also described as a reaction) gives us time to assess a situation triggered by a specific stimulus, consider a new action, and allows us the option of choosing to do the habitual action or trying a new one.\n\nSimply observing this process provides us with new information about ourselves, the situation, our desires, and how our choices influence what happens next.\n\nI noticed how the pressure to respond to Lisa Leone’s Ad Girl, Interrupted and Jean Hsu’s Drama essays interfered with easiness of thought and breath in my body. I observed that when I started worrying that I “should” join the conversation, I pulled down my neck and shoulders. When I tried to decide “how” to respond I got more confused in my thinking.\n\nInstead of analyzing why I wanted to respond, or spinning ideas around in my head about how to respond, I chose to stop thinking directly about these posts for a bit. I applied Alexander’s Principle of Prevention on a General Basis.\n\nNow, looking at Ad Girl, Interrupted, and framing it within the context of the Alexander Technique, I see Lisa’s essay as a form of Inhibition. She describes her situation: she’s been leaning in, producing, creating, and winning awards but her career has continued to be derailed due to sexism and misogyny in the advertising workplace. She’s noticed a pattern, she’s identified how that pattern has been hurting her, and she’s made a choice to stop working harder and harder to fit into that old system. Lisa has decided to quit engaging her habitual pattern and explore doing things differently.\n\nChoices often come with pain, frustration, and a sense of loss. For those of us taught to never give up, it takes some time (and bruising, maybe some battering) to realize that fighting against something can keep us stuck in the same system just inhabiting a different place or role in that system.\n\nStopping my impulses to rush in and fix allows me to give my students the space to learn/change/grow at their own pace. As a teacher (and we all teach by example whether we mean to or not) I applaud Lisa for making the difficult decision to quit trying to fit into a defective system and to stop pretending that she’s not a talented and accomplished woman. She is teaching by example, refusing to uphold or participate in a broken system.\n\nChoice in how to think is what I teach no matter the subject — dance, writing, cooking, anatomy, art. This brings me to Jean Hsu’s article Drama. I wrote a post in which I suggested that we remember to have compassion for our younger selves and realize that we are where we are today because of the paths we took. Jean responded that: “My main concern is that by writing something like that that I now deem to be completely untrue, I may have biased others into believing it.” This situation exists for us all — we make choices that produce results. We assess the results and, as we grow and change, we gather new information that allows us to make different, hopefully, more informed choices that lead to better results.\n\nBecause I stopped and read, then re-read both articles, I realized that in my first “reaction” I missed this beautiful statement:\n\nThis is also true when I teach — I bring everything I know up to that point with me into the studio. Then, when I learn something new that changes what I believed and taught in the past, I share with my students the old idea, the new information, and I explain how this knowledge will change the way I teach in the future. Sharing my process allows the students to begin to develop their own processes. Inviting them to participate in several experiments to analyze the differences in the old and new methods allows us to dialogue and assess the value of the new information. Modeling letting go of old ideas when presented with new, valid information demonstrates change and growth. My goal is for my students to take both the new knowledge and the process for sharing their learning and growth into their future teaching. With any luck, they’ll leave the less complete information I taught previously behind.\n\nAnd that is the beauty of learning/growing/changing/living — the process never ends.", 
        "title": "teaching/learning/changing/growing – laura donnelly –"
    }, 
    {
        "url": "https://medium.com/@jacswork/the-deeplearning-process-and-market-explained-in-10-steps-to-my-7-year-old-playing-mindcraft-65b3df0947ba?source=tag_archive---------1----------------", 
        "text": "1. You decide what you want to happen and write it down\n\n2. Decide how to do it, and write it down\n\n3. Remember the different ways of doing it, and write them down\n\n4. Think about where you need to be and how speedily you need move for each way, and write them down\n\n6. Give each way, where and speed a symbol to make it easier to remember them.\n\n7. Remember your ways of building in the past, and write them down\n\n8. Think of ways of building what you want differently based on how you did it before, and write them down\n\n9. Learn new ways that work and do not work quickly using your different senses (eyes open & closed etc),and write down the best way to get what you want to happen more quickly.\n\n10. Or. You can get computers to do it for you. They do what you did and call it ‘Machine learning’ or ‘Deep Learning’. But remember computers are not clever like you. You need to explain everything you do really simply to them. The people who help computers to do this are mathematicians and coders. They are paid really well for what they do, but they rely on your skill at explaining important things simply — as a designer.\n\nDesigners who make things everyone needs, or wants, are also paid lots for their skills and experience.\n\nBut you do not need to think of a job now, have fun….\n\nBut when you do I would recommend what Daddy does. Get good mathematicians, coders and designers to work with you to make the world a better place.", 
        "title": "The #deeplearning process and market explained in 10 steps to my 7 year old playing #mindcraft"
    }
]