[
    {
        "url": "https://medium.com/@bilb02/artificial-neural-network-model-of-people-or-ai-got-us-ae55efc307f5?source=tag_archive---------0----------------", 
        "text": "Artificial neural network model of people, or AI got us.\n\nThere are 7 billion of us on Earth, and we are all different. Each human is unique and a universe in himself. No two humans are alike. Or are they? What if one tries to reduce this uncountable diversity to a fewer variables that would predict all people preferences, tastes, religious beliefs, political views, — everything — how many variables would that be? Billions? Millions? Tens of thousands? Well, how about 69? Yes, with the help of artificial neural networks, every unique human on Earth can be represented by a vector of just 69 variables. This, the sources tell us, is the conclusion a team of deep learning researchers at Facebook has recently reached.\n\nReportedly, the researchers applied the same technique to people as Tomas Mikolov of Google earlier applied to words, when he created his famous word2vec model. Mikolov trained a neural network on billions of documents in Google’s web cache. Likewise, Facebook data scientists trained a similar model on hundreds of billions of posts, likes and shares of 2 billion Facebook users. They called it, internally, js2vec (where js stands for Joe Schmoe, not JavaScript).\n\nAssuming the humanity’s diversity, the Facebook researchers started with a 1000-dimensional vector space. It worked. People whose vectors were close in this space liked the same posts, jokes, fashion, music and movies, and apparently shared political views. All Sanders supporters would neatly cluster together, away from the Trump crowd. Jazz and classical music fans would be close by, but far away from heavy metal and rap lovers. All hipsters formed a neat cluster. It worked!\n\nThen the researchers reduced the dimensionality of the vector space, and trained the model again. It still worked well. Then they reduced it again, and again, all the way down to about 70. It still worked! So, they settled on 69.\n\nAs always with artificial neural networks, each variable is meaningless. It’s not like one variable is sex, the other is the education level, the third is income level, etc. — everything is mixed and entangled. It’s just an abstract 69D space. Nobody knows what each dimension means. And nobody cares. Because the model can accurately predict everything about every human on Earth: what music he would like, what movies, cloths, books, stories, — everything. It’s an ultimate personalization tool, the dream of e-commerce and online advertising. It could bring billions and billions of Dollars to Facebook coffers through better ad targeting, and thus higher rates. So, it is not a big surprise that unlike other vector embedding models this one has not been published, and unlikely would ever be.\n\nBeyond commerce, the more important reason to keep it secret is politics. By logging users’ apparently innocuous and irrelevant likes, with this model, Facebook can deduce everything about every man on Earth: is he religious or not, pro-life or pro-choice, would he vote Bernie, Hillary or Trump, his views on guns, global warming, gay marriage, drugs, etc. Does he drink a lot? Does he like big boobs or big butts? Smokes weed? Does drugs? Cheats on taxes? Could steal? Could kill? The model knows everything… If governments learned about its existence they would inundate Facebook with the demands for information, both aggregated — who will win the election? — and personal — is citizen Joe Schmoe a drug dealer? First, Facebook would try to resist, but will eventually be co-opted or … nationalized. Enter The Big Brother …\n\nBut perhaps the most powerful force that made Zuck seal the work is not the governments, but us, the peopled, admits one of the study’s principal authors, Petr Kislodrischenko. What if we realize that, after all, we are not unique, and quite predictable? That a simple 69-dimensional model describes all our egos? And what if learned that there is a small group of people who created AI that understands us better than we understand ourselves? And that it could potentially manipulate us and control the societies? Won’t we take up pitchforks and torches and descent on Menlo Park?", 
        "title": "Artificial neural network model of people, or AI got us."
    }, 
    {
        "url": "https://medium.com/pankajmathur/logistic-regression-with-tensorflow-a02c2bd2bd1e?source=tag_archive---------1----------------", 
        "text": "Here is a simple logistic regression model built with TensorFlow. We are using MNIST Image example data set which is provided by default with Tensorflow package.\n\nHere are the hyperparameters we choose to run initial model:\n\nWe achieved impressive 90.8% accuracy in 20 epochs with a learning rate of 0.01 by running simple logistic regression model build with Tensorflow on MNIST dataset.\n\nI am using Conda to install TensorFlow. You might already have a TensorFlow environment, but please check below to make sure you have all the necessary packages. If you have never used Conda environments before, please go through my other tutorial What is Anaconda and Why should I bother about it?\n\nAssuming you have conda install on your machine, please run the following commands to have tensorflow-playground ready for you to play.\n\nRun the following commands to setup your environment:\n\nAnd installing on Windows. In your console or Anaconda shell:\n\nAfter creating conda environment, clone this repository on your local machine via Git or GitHub Desktop\n\nunder tensorflow-playground environment on your terminal or shell window, cd to the cloned directory and then run following command:\n\nThat’s it, now you can play around with various hyperparameters which you feel are good enough to improve accuracy on MNIST dataset.\n\nIf you a bit more adventurous, you can try replacing MNIST dataset with another sample dataset, such as CIFAR10. However, you have to download this data separately on your hard drive, extract it and access it via another python functions, something like below for your jupyter notebook.\n\nPlease do let me know your thoughts, questions under the comments section. I would really appreciate getting some feedback on this article & ideas to improve it.\n\nIn the meanwhile, Happy Thinking…", 
        "title": "Logistic Regression with TensorFlow – Pankaj Mathur –"
    }, 
    {
        "url": "https://medium.com/@knowlengr/agreed-17019aa6bd9d?source=tag_archive---------2----------------", 
        "text": "Instead of smart alerts, we have Watson (which seems to be only weakly extensible, or at the least opaquely marketed), the @TayandYou fiasco, and Google’s under-impressive obscure Go-playing explanation-less deep learning app. Even Google Search still seems rough around the edges — a clumsy mix of smart search and often distantly relevant commercials. (Try using schema.org for anything sophisticated.)\n\nOne cause: know-it-all engineers who are afraid to ask users what they want and need and let user tune AI to suit their needs.\n\nYes, feeling negative today. For upbeat prospects, see ontologysummit.org.", 
        "title": "Agreed. – knowlengr –"
    }, 
    {
        "url": "https://medium.com/@ooohiroyukiooo/now-state-of-the-art-artifical-intelligence-developers-what-are-you-thinking-c1de40edfb25?source=tag_archive---------3----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "Now State-of-the-art Artifical Intelligence Developers, What Are you Thinking"
    }, 
    {
        "url": "https://medium.com/@ooohiroyukiooo/the-world-and-the-movement-of-japan-surrounding-the-ai-development-b293aa56d22d?source=tag_archive---------4----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "The World And The Movement Of Japan Surrounding The AI Development"
    }
]