[
    {
        "url": "https://medium.com/@rpplane.bg/%D0%B4%D1%8A%D0%BB%D0%B1%D0%BE%D0%BA%D0%BE%D1%82%D0%BE-%D1%83%D1%87%D0%B5%D0%BD%D0%B5-%D1%89%D0%B5-%D0%BD%D0%B8-%D0%B4%D0%B0%D0%B4%D0%B5-%D0%BD%D0%B0%D0%B9-%D0%B2%D0%B0%D0%B6%D0%BD%D0%B8%D1%8F-%D1%83%D1%80%D0%BE%D0%BA-%D0%B2-%D0%B6%D0%B8%D0%B2%D0%BE%D1%82%D0%B0-%D0%BD%D0%B8-%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%B0%D1%82%D0%B0-%D0%B5-%D0%B7%D0%B0-%D0%BC%D0%B0%D1%88%D0%B8%D0%BD%D0%B8%D1%82%D0%B5-6e88180e3bbc?source=tag_archive---------0----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "„Дълбокото учене“ ще ни даде най-важния урок в живота ни: работата е за машините"
    }, 
    {
        "url": "https://medium.com/@kaulout/could-an-ai-run-government-someday-dfa2c7a3af6a?source=tag_archive---------1----------------", 
        "text": "Artificial intelligence (AI) has recently shown its prowess in defeating humans at a 3,000-year-old strategy board game called Go, one of the most complex board games that requires not just intellect, but intuition. DeepMind’s AlphaGo program, which prevailed over the Go world champion Lee Sedol, used a two pronged strategy — calculating the next move in the game while simultaneously trying to predict the winner. The AI constantly calculated its mathematical odds of winning, which led to some interesting outcomes. Experts thought some of the moves made by the AI program looked silly to begin with, but only later did it all make sense. Essentially, the AI fooled its opponent into thinking that it was making stupid mistakes, while it was actually increasing its odds of winning. AlphaGo was thinking like a human, even if it was based on mathematical models. At one stage, it was even suggested that AlphaGo went beyond human capability. At its most basic level, AlphaGo is a decision making machine, taking into account a finite number of outcomes but keeping the end goal in sight, which was winning the game.\n\nSo, does it make sense for an AI to start making decisions for countries, governments, and humanity as a whole? Keep in mind that political decisions involve complex interlinking factors and secondary and tertiary outcomes, some of which could be beyond what the human brain can comprehend or analyze. Government decision making is a complex task, something that is getting harder all the time with the rapidly shifting geopolitical dynamics, terrorism, climate change, rising inequality, the pace of automation and its impact on jobs and society, and the possibility that we are entering an era of post-capitalism. With so much uncertainty and risk of destabilization, and almost no parallels in history to deal with the current set of global issues, governments are likely to be reactive and short-sighted, making rash decisions and not thinking through the countless intertwined future outcomes, and what it all means for the planet as a whole.\n\nAI is already making strides in commercial markets such as finance, automotive, retail, media, and many others as highlighted in Tractica’s report on Artificial Intelligence for Enterprise Applications. However, as AI gets embedded into the wider private sector economy, I don’t see why AI along with massive scale simulation systems could not be deployed to help governments make decisions. Decisions could be within public sector departments like healthcare and education agencies, either focused on making internal operations more efficient, or within the government itself where officials would have an “AI advisor” in addition to their retinue of human advisors. The first opportunity, using AI to bring greater efficiency to government operations, is already happening, but the second option of aiding high-level government decision making is where the future becomes more interesting.\n\nIf seen through the eyes of a game theorist, the world can be considered a strategy game, where each player (or country) is trying to maximize their chances of winning, and increasing their odds of survival. At some level, this could be run like a SimCity simulation, but on a massive scale, where you go through a number of scenarios and analyze the individual outcomes. A London-based startup called Improbable is building technology that will enable such large scale simulations, using distributed computing. Improbable’s technology is being used today in gaming that can adapt to gameplay, making it possible to enable multiple different gameplays for each player in the same game. Improbable is also building systems that could simulate a city, taking into account all the factors including the residents, transport, water, infrastructure, public safety, and education and running the simulation at scale. Improbable’s founder, Herman Narula, has said that the company wants to make The Matrix possible.\n\nSo what if Improbable started using AI-based decision making techniques like AlphaGo to simulate not just a city but a country or the world, and continuously calculate the odds of a country or the world surviving, but at the same time making sure that certain thresholds were met with regard to social equality, poverty, hunger, disease, climate, and so forth. It does sound like the stuff of science fiction, but it is highly likely that within the next decade, AI and simulation systems will become powerful enough to make decisions for cities, or at least some aspects of municipal operations. Improbable would be a great acquisition for companies like Google, IBM, or Microsoft to develop AI solutions that are simulation based, targeting everything from finance to healthcare to governments. I personally see a lot of potential for massive-scale simulations and AI systems to work together.\n\nIn my view, AI has a role to play as a decision-making partner or AI advisor, not as the decision maker itself. The risks involved in letting AI take over governments are far too great, and nobody wants a SkyNet future, where the AI ends up posing a threat to humans. However, AI being used in a controlled environment to help the government make decisions isn’t too farfetched.\n\nThe question comes down to trust — how much humans can trust the AI to make decisions, keeping in mind that the AI could be fooling humans, with the end outcome of AI taking over the government. How do you define the controlled environment? What are the safeguards that you can put into place to ensure that the AI doesn’t take over? How do you account for rogue governments in the future that could be fully AI driven? In my view, instead of dismissing the likelihood of superintelligent AI, these are the kinds of questions and debates that we need to be having, where we start thinking of safeguards and measures that can be put in place for running AI in a controlled way, which will eventually help humanity, not threaten it. Work is already being done by the Future of Life Institute, supported by Elon Musk, and Nick Bostrom’s Future of Humanity Institute at Oxford to lead efforts related to ethical AI and think through the various implications of superintelligent AI and possible safeguards.\n\nIn the wrong hands, AI can definitely do a lot of harm, but there is also a lot of good that can come from the technology. If AI can help governments make smart decisions that benefit humanity in an increasingly complex and fragile world, I don’t see why not, assuming that there are safeguards in place to prevent malicious intent.", 
        "title": "Could an AI Run Government Someday? – Aditya Kaul –"
    }, 
    {
        "url": "https://medium.com/@Willpowered/the-huge-learning-mistake-we-all-make-dd166d6085e7?source=tag_archive---------2----------------", 
        "text": "He had been sent deep into the heart of the Amazon jungle to teach Christianity to a tribe known as the Piraha. [1]\n\nThe Piraha language has been called THE hardest to understand on the planet. It seems to have no grammar structure to it, no alphabet, and no way of expressing either the past or the future!\n\nThat’s why Everett was brought in. The previous missionaries had spent years trying to understand the language. But they were nearly driven insane trying to communicate with the tribe.\n\nEverett, however, was confident. He believed that with his advanced degree in linguistics and enough perseverance; he would be able to meet the challenge and be the first to crack the code.\n\nWhen he arrived, he instantly started making great progress. He spent a full year in the village with the tribe learning more every day. He took copious notes on every word and learned much of the vocabulary.\n\nBut one day he stopped making progress.\n\nSome things just didn’t make sense. They didn’t have a word for left or right. They had multiple meanings for certain words that didn’t seem to connect. With each step forward, he felt as if he was taking two steps back.\n\nThis must have been when the previous missionaries went insane.\n\nClearly, learning this language was not impossible. Children in the tribe seemed to pick it up with ease! So why couldn’t he?\n\nAfter months of feeling like he was getting nowhere, Everett finally ventured outside of the village. He joined the Piraha men on one of their hunts. There, he discovered something remarkable.\n\nThe language they were using while hunting was completely different than the language used in the village! They communicated with different pitches of whistling that allowed them to be stealthier when stalking their prey.\n\nThis was a completely foreign idea to Everett. Nothing that he learned in school prepared him for a completely different language used in different scenarios.\n\nIt was then that it hit him — he had been looking at the Piraha language completely the wrong way!\n\nHe had been trying to learn how the Piraha language fit into his idea of how language is structured. With vocabulary, grammar, an alphabet, etc.\n\nThe reason that children were able to learn the language easily is because they had no idea how a language should be structured! They weren’t trying to fit a square peg in a round hole, they simply observed and learned with a completely open mind.\n\nWe all start out life with this same open mind. Everything we see is new and exciting to us. We seek to learn about things without placing judgment on them. We don’t see our culture or way of life as better or worse than others.\n\nWe simply learn and observe; accepting our role as the student. As we grow older, though, we start closing our minds.\n\nWe start realizing what is “realistic”.\n\nWe start placing judgments on people and things as “good” or “bad”.\n\nAnd we start feeling superiority in our way of thinking.\n\nIt was this feeling of superiority that doomed Daniel Everett with the Piraha.\n\nHe saw himself as the intelligent scientist coming to study the Piraha language the same way he might study the behavior of ants. So he didn’t fully embrace their culture and couldn’t see its powerful connection to their language.\n\nOnce he let go of this feeling of superiority, he learned the language with ease and changed the way linguists across the world think.\n\nThis shift allowed Everett to change his mental perspective to what is called the “Dimensional Mind”.\n\nThe dimensional mind is open. There is no prejudice, no superiority, and no judgment on what is and isn’t possible. Like a child, it simply observes and learns — accepting the role of the student.\n\nCultivating a dimensional mind helps you overcome one of the biggest flaws in learning anything new — the feeling that you already know what’s best.\n\nThis smug feeling prevents you from being truly curious. It causes you to begin subconsciouslyplacing judgments on things before you even start to explore the details. [2]\n\nThe truly dangerous part of this phenomenon is that you will not realize that you are doing it! Like Daniel Everett, you will believe that you are indeed approaching the learning process with an open mind.\n\nAfter all, who would admits that they have a bias or prejudice toward anything?\n\nUnless you are willing to admit that you — and everyone else for that matter — have this natural tendency, you will never overcome it. Self-awareness is the first step toward self-improvement.\n\nOnce you have come to terms with the fact that you have a natural tendency for judgment, we can talk about ways to overcome it.\n\nUnfortunately, you cannot revert back to your child-like openness entirely, but that is not necessarily a bad thing. As you accumulate more knowledge about the world or your domain, your brain wants to become more active. [1]\n\nThe key is to never be satisfied with what you have learned.\n\nThis is not natural. Your brain wants to genuinely believe that it knows everything that it needs to know about the world around you. This way it doesn’t need to explore every detail and it can conserve its energy. [3]\n\nTo avoid this, you need to understand that no matter what you know today, there is always more to learn. With this perspective, you can begin to implement the techniques below that will begin to open up your mind and help you learn:\n\nYou probably take so many things in your world for granted. You see a kitchen table as just a kitchen table, you see a computer as just a computer and a car as just a car. But where did they all come from? How do they all work?\n\nWhen you were child, you asked questions like that. You saw a car driving by like it was a rocket ship and wondered how it all works. You were curious about everything around you and that trained your brain to be more open.\n\nThen, as you grew older, you began to accept everything in the world around you simply as it is. Your curiosity about things ended and you began to train your mind to be closed.\n\nThe brain works like a muscle. If you exercise your curiosity about one thing, it will begin to become more curious about everything else. Just like lifting weights in the gym will also help you lift anything else. [4]\n\nSo take 10–15 minutes every day to simply be more curious about the world around you. Look at people, objects and technology and simply wonder, “why?” You don’t even need to find the answer. You just need to open your mind to the question.\n\nThere are few better ways to train your mind than through meditation. And one of the main benefits of meditation is the rewiring of the brain to have less judgment and more empathy.\n\nThis will influence your subconscious mind to avoid placing judgment on everything you see, which will allow you to be more open and curious. It only requires 10 minutes of daily meditation to make a significant impact on your subconscious. [5]\n\nTo get started, check out this article which will list all of the benefits of meditation and give you some helpful exercises to get started.\n\nRegular writing has been proven to have many mental health benefits, one of which is opening your mind.\n\nMost of your “thinking time” is undisciplined. Time spent thinking is really just allowing your brain to wander; which can quickly lead to placing judgment on all of the things in the world around you.\n\nBy keeping a journal, you help your mind develop focused creativity. [6]\n\nWhether you’re writing about events in your life, a problem you’ve been dealing with, or a new idea, as you write you begin to see the problem from different angles. You start to open your mind as you put your ideas to paper and see things from a different perspective.\n\nYou have a natural bias toward your own culture, your own religious/political beliefs and your own ideas. The huge learning mistake that we all make is allowing these biases to close our minds off to what others can teach us.\n\nWhen you were a child, you didn’t have these biases. You simply observed and learned — accepting your role as the student. This helped you learn and develop far faster than many adults can today.\n\nBy practicing curiosity, meditation, and journal writing, you can begin to train your mind to go back to that child-like openness. This will help you immensely in becoming a better learner, leader, and citizen of our global and diversified world.\n\nAfter all, even the great Ralph Waldo Emmerson said, “Every man is my superior. In that, I learn of him.”", 
        "title": "The Huge Learning Mistake We All Make – Colin Robertson –"
    }
]