[
    {
        "url": "https://medium.com/@kc9ldo/arrl-dx-bulletin-no-0047-f57ae1328746?source=tag_archive---------0----------------", 
        "text": "This week’s bulletin was made possible with information provided by\n\nCO8TW, F8DVD, W3UR, QRZ DX, the OPDX Bulletin, 425 DX News, The\n\nDaily DX, DXNL, Contest Corral from QST and the ARRL Contest\n\nCalendar and WA7BNM web sites. Thanks to all.\n\nTUNISIA, 3V. Ash, KF5EYY will be QRV as 3V8SS in the CQ World Wide\n\nDX CW contest on all bands. QSL via LX1NO.\n\nAZERBAIJAN, 4K. Alim, 4K6FO will be QRV in the CQ World Wide DX CW\n\ncontest on all bands. QSL via DC9RI.\n\nMALAWI, 7Q. Karl, DK2WV is QRV as 7Q7VW from the Radio Dinosaur FM\n\nstation in Karonga until December 2. Activity is on 160 to 6 meters\n\nusing CW, SSB and RTTY. QSL to home call.\n\nCHINA, BY. A large group of operators will be QRV as BY5CD in the\n\nCQ World Wide DX CW contest as a Multi/Multi entry. QSL direct to\n\nBD4HF.\n\nEASTER ISLAND, CE0Y. Yan, RZ3FW and Sergey, R4WAA are QRV as\n\nCE0Y/RZ3FW and CE0Y/R4WAA, respectively, from Cabanos Honu Nui, IOTA\n\nSA-001, until December 2. Activity is on 160 to 10 meters using\n\nmostly CW with some SSB and digital modes. This includes being\n\nactive as a Multi/Single entry in the CQ World Wide DX CW contest.\n\nQSL via operators’ instructions.\n\nCUBA, CO. Juna, CO8TW will be QRV in the CQ World Wide DX CW\n\ncontest as a Single Op/Single Band/Low Power entry on 20 meters.\n\nQSL to home call.\n\nFRANCE, F. Francois, F8DVD will be QRV with special event call\n\nTM21COP from November 29 to December 13 during the 21st session of\n\nthe UN Framework Convention on Climate Change. Activity will be on\n\n40 to 10 meters using SSB. QSL via operator’s instructions.\n\nGUINEA-BISSAU, J5. Livio, IZ3BUR is QRV as J52HF from the Cumura\n\nHospital until December 10. Activity is in his spare time mainly on\n\n20, 15, 10 and 6 meters using SSB and PSK31. QSL via I3LDP.\n\nOGASAWARA, JD1. Take, JA1UII is QRV as JD1BON from Chichi-Jima\n\nIsland, IOTA AS-031, until December 5. Activity is on 80 to 6\n\nmeters using CW, SSB and RTTY. This includes being active in the CQ\n\nWorld Wide DX CW contest. QSL to home call.\n\nMARIANA ISLANDS, KH0. A group of operators will be QRV as AH0K from\n\nTinian Island, IOTA OC-086, in the CQ World Wide DX CW contest. QSL\n\nvia OH6GDX.\n\nARUBA, P4. John, W2GD is QRV as P40W from Santa Cruz until December\n\n1. Activity is on the HF bands using CW and SSB. This includes\n\nbeing active in the CQ World Wide DX CW contest as a Single Op/All\n\nBand/Low Power entry. QSL direct to N2MM. In addition, look for\n\nTom, K1KI, Stephen, K6AW, Robert, N5KO and John, W6LD to be QRV in\n\nthe contest as P40L. QSL via WA3FRP.\n\nPALAU, T8. Kiichi, JF1LUT will be QRV as T88IK from the VIP Guest\n\nHotel on Koror Island, IOTA OC-009, from November 30 to December 6.\n\nActivity will be on 40 to 10 meters using SSB. QSL to home call.\n\nKALININGRAD, UA2. Members of the UA2 Contest Club will be QRV as\n\nUA2F in the CQ World Wide DX CW contest. QSL via operator’s\n\ninstructions.\n\nANTIGUA, V2. Bud, AA3B is QRV as V26K until November 30. Activity\n\nis on the HF bands using CW. This includes being active in the CQ\n\nWorld Wide DX CW contest as a Single Op/All Band/Low Power entry.\n\nQSL to home call.\n\nMICRONESIA, V6. Sho, JA7HMZ plans to be QRV as V63DX from Pohnpei\n\nIsland, IOTA OC-010, from November 27 to December 5. Activity will\n\nbe on the HF bands with a focus on 160 meters. This includes being\n\nactive as V6A in the CQ World Wide DX CW contest. QSL direct to\n\nhome call.\n\nINDIA, VU. Pai, VU2PAI will be QRV in the CQ World Wide DX CW\n\nContest as a Single Op/All Band/High Power entry. QSL direct to\n\nhome call.\n\nINDONESIA, YB. Dennis, K7BV will be QRV with members of the YE2A\n\nTeam during the CQ World Wide DX CW contest as a Multi Single/High\n\nPower entry. QSL via operators’ instructions.\n\nEL SALVADOR, YS. Members of the Club de Radioficionados del El\n\nSalvador are QRV as YS90IARU until December 31 in celebration of the\n\n90th anniversary of the IARU. Activity is on all HF bands. QSL via\n\nW3HNK.\n\nALBANIA, ZA. Operators Barichek, YU7CM, Keki, YT7DQ and Tibor, YT5Z\n\nare QRV as ZA/home calls on 160, 40, and 10 meters, respectively,\n\nuntil December 1. This includes being active in the CQ World Wide\n\nDX CW contest as Single Band entries. QSL ZA/YT5Z via YU1FW and all\n\nothers to home calls.\n\nOPERATIONS APPROVED FOR DXCC CREDIT. The following operations are\n\napproved for DXCC Credit: Togo, 5V7BJ and 5V7MP, 2014 operations;\n\nBhutan, A52CVX, 2015 operation; Ogasawara, JD1BOX, 2014 operation;\n\nBenin, TY4AB, 2015 operation; Benin, TY2AC, operation running from\n\n2015 to 2018; and Marshall Islands, V73D, 2015 operation.\n\nTHIS WEEKEND ON THE RADIO. The ARRL EME Contest, CQ World Wide DX\n\nCW Contest and NCCC Sprint are all on tap for this weekend. Please\n\nsee November 2015 QST, page 91 and the ARRL and WA7BNM contest web\n\nsites for details.\n\nNNNN\n\n/EX", 
        "title": "arrl dx bulletin no. 0047 – DXER –"
    }
]