[
    {
        "url": "https://blog.hyperverge.co/how-we-raised-a-million-dollars-in-seed-funding-94666dea2feb?source=tag_archive---------0----------------", 
        "text": "This is the first part in a three-part series on our experience with fundraising. Part 2 can be found here.\n\nStartup fundraising is a heavily discussed topic in the startup ecosystem. While you’ve probably read many articles about startups successfully raising multiple rounds of funding, it is not often you get to hear the stories behind them. This post is an attempt to provide an insight into startup fundraising, from the point of view of HyperVerge by taking you through our thought processes, decisions, and learnings.\n\nThe two most crucial rounds that a startup will raise are Seed-Funding and Series A. Most startups fall through the big crevice between starting a company and securing seed-funding. A big chunk also falls through the crevice between seed-funding and Series A. Those who survive these 2 phases, would have tasted customer engagement, retention and distribution in some manner or the other for their product. Most importantly, they would have figured out what the one thing (or a very small set of things) they need to keep working on to grow the business is.\n\nFrom 2012, Vignesh, Kishore and I along with other members of Computer Vision Group were working on consulting assignments. We were approaching different companies in India hoping to solve a real problem using the technology that we had learnt over the past 4 years. HyperVerge 1.0 was started in Dec 2013 as a private limited company in India. We started the company primarily because we had to have an official entity to which we could bill various clients (such as Indian Railways, ITC, and MRF) with whom we were working on industrial automation projects. We hoped that one of our prototypes or pilot systems would solve a painful problem for these large organizations and we would get a bulk order. We figured that one of these bulk orders would be the spark we needed to ignite the fire and make HyperVerge a real company.\n\nUnfortunately, that did not happen. While we could solve the technology problem in 6–12 weeks, the problem we seemed to have absolutely no logical solution to was that of securing a real purchase order for enterprises. Time and again, we would feel hopeful, only to be disappointed a few weeks later. Yet, we persevered. In the meanwhile, a bigger problem for us was that while we waited for these projects to move forward, our technology team had no direction. When smart people come together to work on a problem, it is because they are facing a challenge that overwhelms them and pushes the team to the edge of its abilities. That was not happening. Something had to be changed.\n\nHyperVerge 2.0 started in Mar 2014. We had learnt a lot of lessons from HyperVerge 1.0, and we were determined to follow them. They were\n\nWe played around with many ideas and decided to narrow down on a few. We brainstormed with and took advise from our advisors, and Vignesh’s guide Prof. Anurag Mittal. The first idea we had was to build a smartphone application for photo organization using deep-learning. The second idea we had was video processing on the cloud. Idea 1 interested us more. However, we deployed 2 tech teams, one for each idea. We started working with high intensity. Lema Labs office became our workplace. We set a target that we are going to launch whatever product comes out in Summer. The work started becoming more serious with every coming day.\n\nSoon, most of the resources in the team were aligned towards the photo organization app. We wanted to create an app in which users would be able to search through all the photos on their phone. Simply searching with phrases such as “Photos of Kedar, Vignesh, Kishore at a beach” would bring up the right photographs.\n\nThe app was named Picsaur (Dinosaur of all Pictures ). The choice of name was largely driven by the domain name that was available. Many people pointed out to us that it sounded a lot like ‘Pixar’, but we always fought back. It seemed to work well in our minds, until someone pointed out that Dinosaurs don’t exist anymore — so what does that say about our app. That aside, we worked like crazy. We were not wasting any working day. We pushed forward every day. There was a lot of work to be done. We had figure out deep-learning, server architecture, building an android app, workflows, design, launch, so many things.\n\nWe required money to build the app. I am not talking about launching here, just building. Our major expenses would be stipends for interns, logo design, promo video and travel expenses that would be incurred in raising money for next round. We approached the IIT Madras Incubation Cell for this money. Some of our advisors were disappointed that we were building an app, knowing that we were leaving behind a lot of good work in industrial automation. We did not budge. We were very clear about what we wanted and and they gave us the USD 8000 (INR 500,000) that we needed. We decided to take rest of the money as a loan from my first company, Lema Labs. Important thing being, We did not spend more that than 24 hours raising this money.\n\nKickstarter campaign and visit to the US\n\nBefore we knew it, we had some app screens ready and the technology was coming through pretty well. We started working on estimates of the amount of money we would require to launch this, considering all possible user scenarios (5k,10k, 25k, 50k,100k, etc) We calculated the Amazon server costs that would be required to support these user scenarios. We arrived at 50–80k USD as the amount of funding we would need to raise in the next round. Most people we spoke to were skeptical of the idea. At this point, we figured that the best way to raise the money would be through a Kick-starter campaign. . We started pushing ourselves hard to get all the app collaterals in place — intro video, app screens, etc.\n\nIt was already decided that we would travel to the US, across different universities, to spread awareness for the kick-starter campaign. In case we failed to get a viral campaign, a strategic plan was also made to keep few expensive slabs ($250, $500) that we will make a lot of IITM alums sign up for. Alex, who had done a crazy exploration trip earlier, advised us that it would better if we travelled as two people instead of one (one person can break-down very fast in an unknown environment trying to raise funds). We started taking assistance from Prof. Nagarajan, Senthil Nathan Sir, Rajan Srikanth and Ajit Narayanan to set up meetings with alumni across New York, Boston, Pittsburg, the Bay Area, Houston, etc. In parallel, we started reaching out to friends we had across these cities . We had Ayush and Ajinkya in NY, Arun and Shivram in Pittsburg, Advait in Boston, Manish Dada in the Bay Area. Needless to say, we had no money to manage any kind of accommodation in the US.\n\nThere were many times, when I felt like our plan was too random, and to be honest, too optimistic. We were spending a big chunk of the money we had left for this US trip, and there had been no previous example of such a trip being successful. For the first time, I was going be away from Lema Labs at a very crucial time (onset of fresh semester — beginning of sales season). However, while we never thought of it in that way, deep within we knew this trip would be the make or break event for HyperVerge. Kishore had an $80k job from Schlumberger waiting and there was no way he would have been able to convince his parents that HyperVerge was the right way to go. We knew we could not return from the US empty handed. At Lema Labs, both my co-founders had to part with the company after graduation. There was no way we were letting that happen to HyperVerge.\n\nKishore and Praveen took over all the responsibilities in India. Vignesh and I, for once, reached the airport on time and took the cheapest flight that we had found to New York.", 
        "title": "How we raised a million dollars in seed funding –"
    }, 
    {
        "url": "https://medium.com/@Someo1ne/inhale-exhale-aaaab35c119a?source=tag_archive---------1----------------", 
        "text": "We would never understand how tiny to the atomic level we are. Weak too yes we are, its by default and it comes with the territory and we can not turn our backs on it no matter how much we tried.\n\nWhen it comes to overcome a massive breakdown kind of situation that is so much huskier than ourselves, we tend to seek some sort of a power that is greater than ours. Useless, helpless and dysfunctional are exactly how anyone would feel being trapped in a canvas so thin that the outside world seem so close yet untouchable, and wont be able to stretch out and reach the immortal sunshine.\n\nWe hide behind a very tender barrier known as “the veil of ignorance” . Our loved ones, favorite places, our goals and ambitions even our happiness are fragile all the way down to one’s inner core, making us weak at certain points of interests that we recognize them as perspectives. Perspectives which can either be self-biased or taken down by stereotypes. One’s opinion is not self motivated since they are usually formed by analyzing and observing several past opinions with bits of facts.\n\nWhen I walk into a bar, i personally search for what I long for, stuff that I feel i need to fill my gaps with. A lonely person will always be empty and unsatisfied going through the black corners of their minds. Us humans, we are engineered in a way that explains sightings and observations that we can not express with words like; how the earth needs the gravitational effects of the moon, how only a female and a male can give birth to a soul, how there is no fire without a smoke.\n\nWe all live in a team without knowing that each and every single point is needed. Studying the biodiversity of this universe reveals the fact that even the pebble beside the river can and is making a difference in a way just by being there. Existence is the key word to all of our obstacles. If we just lay back and take minute to appreciate our existence and the existence of others around us we would be taking this life to a whole new experience. Wake up there are stuff way greater than our self centered lives.\n\nWhile reading there is one person crossed your mind, i would say appreciate their existence before its too late.", 
        "title": "Inhale-Exhale – Eddy Nehme –"
    }, 
    {
        "url": "https://medium.com/@celarno/from-sharing-economy-to-sharing-society-6eecaee6a156?source=tag_archive---------2----------------", 
        "text": "If we imagine that the pace of technological developments increases exponentially, in each field of science and human life, that we will not only capable of programming biology, to build self-organized factories, smart cities, that A.I. becomes “natural“, that every human being will be connected by “digital thoughts“, then we also should consider the consequences for our governments, our social structures and facilities.\n\nIt’s necessary to create participation platforms, to break borders between countries and to create a social support system which takes advantage of the technological dividend which robots, machines will achieve. The companies have to pay back in kind of a “machine tax“ to ensure a livable life for everybody who can’t afford the advantages of modern technology. A lot of people call this “basic income“. Each government will use algorithms to re-invest their incomes by taxes to make benefits. Huge companies like Apple, Google, Facebook, Amazon etc. will make more profit by using deep learning/machine intelligence technologies. Everything that can be automatized will be automatized.\n\nTo prevent that most of us won’t take advantage of the near-future technologies in a social perspective, we have to start right now with political initiatives to mount a digital social network. It’s not enough to post some mobile videos of police violence or to organize some demonstrations via Facebook or Twitter.\n\nI am going to examine my ideas for a modern sharing-orientated society in the following months.\n\nP.S.: Sorry for my English language skills. I am trying to improve it via writing.", 
        "title": "From Sharing Economy to Sharing Society – Marcel Arnold –"
    }
]