[
    {
        "url": "https://blog.chattermill.io/what-the-hell-is-customer-experience-a3a25670f92c?source=tag_archive---------0----------------", 
        "text": "Customer Experience (CX) has become a business cliché. Everybody seems to agree that it is important to have good CX. However very few people can actually articulate exactly what CX is let alone how to measure and improve it over time. Furthermore, return on investment has historically been an awkward topic for CX (and market research in general, to be honest) to the extent that the incentives for improving CX are far from clear.\n\nYet we see companies such as Airbnb, Slack and TransferWise effectively use CX to achieve phenomenal growth.They are not just great companies, that use CX, each of them has specifically mentioned CX time and time again as one of their key growth drivers.\n\nHaving seen the potential of CX and at the same time the staggering lack of understanding of it during my time in the market research industry, I was keen to fix this and thus Chattermill was born. We have developed Deep Learning based technology to help companies measure and improve their CX.\n\nThis post will show you what CX is actually made up of, how to measure it and how to benefit from it.\n\nCX is not a simple number. It is a chaotic mix of numerous interactions the customer has with your company, both offline and online, before during and after the purchase of the product or service. It can include anything from how well your product or service solves the customer’s problem to how your brand image fits in with their aspirations and social status.\n\nThe exact set of values will be unique to each company. It is also important to note that the values can be experienced as positive or negative — they have sentiment. For example, a typical customer care experience could consist of a pleasant time speaking to the friendly representative but frustration while waiting in the phone queue.\n\nYou may be asking how does CX compare to Net Promoter Score (NPS) or Customer Satisfaction (CSAT)? These metrics were designed to be a proxy to CX are a good place to start but have the following limitations:\n\nThe above three points about the limitations of NPS and CSAT can be overcome. For example, by collecting and reading customer comments you can understand the context, using short, well designed surveys will yield higher response rates (we typically get at least 25% on our surveys) and automated survey sendout right after a touchpoint will help spot problems in real time.\n\nIn reality, however, setting up and maintaining a good survey campaign as well as analysing the data (remember this includes reading all of the comments to understand context) is very hard. Out of over 100 companies we talked to only a handful collected NPS in a way that was helping them understand their CX to a level where they could make informed decisions based on it.\n\nTalking about CX is one thing but actually measuring it is a whole different challenge. Because CX is something experienced by the customer — you can only measure it by asking the customer. We have found that a simple survey that gets the customer to talk about their experience in their own words is the best way to measure CX at scale. You can read more about the survey here but for reference here is what a typical response may look like:\n\nOnce you have the data — there are two ways of looking at data like the comment above: at an individual level and at aggregate level.\n\nAsking a customer for feedback should not be a one way conversation. The leaders in customer experience respond to most of their customer feedback, particularly if it is negative. Responding to feedback has the following advantages:\n\nIf you have a customer base size of over 5,000 people — you will get enough data to start analysing trends from the individual comments. To do so — start assigning tags (or what we call Themes) for topics that come up again and again. This way you can effectively see the core elements of your CX that the customer is recalling.\n\nBelow is an example of the Themes for the Holiday Booking sector that we gathered through our survey:\n\nYou can see the relative frequency with which different components are mentioned when the customer recalls their experience. If you can assign positive as well as negative versions of the same label you can get the sentiment for the different topics that are being talked about. Note that this is not the number of times a particular word or group of words is mentioned. This so called ‘keyword approach’ is misrepresentative for a number of reasons, not least the difficulty in distinguishing negative and positive sentiment but also due to more fundamental biases and limitations of the analysis. For this reason it often leads to an organisation focusing on or prioritising the wrong things or simply making decisions that are contrary to what the data actually supports. This is about understanding what a customer is talking about and their feelings about it regardless of the words / phrasing they use. The solution that worked for us involved Deep Learning — a branch of Artificial Intelligence that teaches machines to understand incredibly complex patterns, which in our case is reading the meaning and sentiment of what is being communicated in free form text, similar to the way that a human would.\n\nTaking the topics analysis further it is possible to dive deeper and see what the above CX components are made of. For example:\n\nWith this level of detail our partners get a better understanding how different parts of the business are contributing to the overall CX.\n\nFor example one of our e-commerce flower delivery clients has a feature where they send a photo to the customer when the flowers have been delivered to the intended recipient. The original function was simply to provide a visual confirmation of the order however by tracking this theme closely they were able to identify that this feature was one of the most talked about aspects of their service and and a key differentiator from their competitors in terms of why customers would recommend them to their friends.\n\nCX has a significant impact on customer acquisition cost, share of wallet and customer retention. Consequently improving CX will enhance the performance of your business. While this may seem obvious, the problem a lot of businesses face is identifying which element of the customer experience to invest time and money in for maximum return on investment.\n\nIt was never clear what exactly you get out of improving the customer experience and therefore which elements of the CX should be improved first. To solve this problem we provide tools to understand which area you should invest in to give the maximum return.\n\nTo achieve this, we map out how various elements of CX impact the Net Promoter Score which we know to correlate with Customer Lifetime Value.\n\nIn this example the vertical axis is the magnitude of impact on NPS i.e. how important that element is to shaping the overall experience. The horizontal axis is the sentiment — that is the elements that get mentioned in a negative context float to the left, and positive elements shift to the right.\n\nItems in the top right corner are important to the customer and as a company you are are performing well and you should look to amplify these. Conversely they are also the areas where you are most vulnerable to a competitor if they were to effectively match you on these elements.\n\nIn contrast items in the top-left corner are important to the customer but the feedback has been mostly negative. These are the areas to prioritise for improvement as it is likely they are hurting your bottom line. Looking at the CX data in this way helps organisations we work with prioritise investment.\n\nCustomer experience is rapidly becoming the primary battleground for companies looking to outperform the competition. Companies with a good customer experience benefit from reduced customer churn and lower acquisition costs for new customers. Perhaps less obviously they also often have happier employees simply because people enjoy working for likeable companies that bring positive value, whether Utility or Emotional, to its customers.\n\nTo improve customer experience it needs to be measured first. Established survey techniques such as Net Promoter Score and Customer Satisfaction can be used to measure and understand customer experience if done in the right way. This does however come with labour intensive challenges such as analysing the free form comments by topic and sentiment on an ongoing basis.\n\nAt Chattermill we help you collect high quality feedback from your customers and we then help you make sense of it all by applying Artificial Intelligence. Feel free to drop me a line at [email protected] for a chat about how great customer experience can help your business.", 
        "title": "What the hell is Customer Experience? –"
    }, 
    {
        "url": "https://medium.com/craft-ai/does-ai-need-to-be-magical-8deaacbd3e7b?source=tag_archive---------2----------------", 
        "text": "When AlphaGo defeated Go player Lee Sedol, many commentators were quick to argue that it was not “AI”. Yet regardless of considerations on whether programs can be made truly intelligent, the field of software engineering known as AI is thriving, with very practical applications like web ads, chatbots and self-driving cars. So you could think that among its practitioners, philosophical considerations on what is or is not AI would take a back seat to results and algorithms. Well, not exactly.\n\nThe distinction between weak and strong artificial intelligence is generally accepted, and in the academic and industrial field called AI most would willingly agree that they’re not making a strong AI. But even among users of weak AI techniques, we keep hearing conversations about which methods and algorithms truly deserve to be called AI. Even among developers, there is a sense that an algorithm has to be inscrutable or based on complex math for it to deserve the moniker. And by extension, to be “good”. But do you need to look nerdy to be smart?\n\nWe don’t understand intelligence. The details of how our own minds work still elude us. And at the same time, we find it hard to believe that something as mysterious and versatile as intelligence could be as straightforward as an automated process. So whenever the realm of what computers can do expands to include something that was previously done only by humans, technical-minded observers scramble to discount the advance as not truly AI. This is the AI effect.\n\nIn this way AI is very similar to magic. Magic is another word for something inexplicable, a phenomenon that we cannot understand or break down into reproducible bits. If someone makes a house levitate without using any visible physical device it’s magic, but if we see cables attached to it that’s just boring physics… even if the result is the same. If a chatbot accurately detects a user’s mood it’s advanced AI that understands human emotions, but if we realize It did that from simple rules based on clever markers in the user’s speech it’s just plain old basic programming.\n\nThe interesting contraposition to this effect is the conception that for something to be intelligent, it cannot be “just” a computer program. And this idea seems to be widespread even among developers and tech companies: if you want to add some top notch intelligence to your program, you need to use a “true” AI technique, like deep learning.\n\nThe undeniable success of deep learning in making some cool applications work has given it the aura of a magic bullet, a key to intelligence. And the inscrutability of the algorithm has much to do with this aura: as some other methods are now commonplace and less mysterious, deep learning is at the frontier of AI. Not only is it the main category of AI algorithms that people talk about, but also the one that they have in mind when they want to analyze complex data but are not sure how. This seems to be true even among users of other machine learning techniques, who see their everyday analysis methods as mundane and imperfect number crunchers, compared to the inexplicable prowess of a real AI technique.\n\nThe boom of big data has spread the idea that whenever you have data, you should throw it all at a magical learning algorithm to see what comes out. Deep learning architectures are the latest manifestation of this mythical creature, which is supposed to uncover the secrets of data, whatever the data. But if you already know what you want your system to learn, why wait until it finds out on its own?\n\nHere at craft ai, part of the team used to work on game AI. While arguably very different from the AI you would want in a non-gaming application, this gave us a culture of using the tricks that do the job.\n\nIf you want a virtual opponent to find a position from where to shoot at the player, you don’t need it to have a full-fledged understanding of ballistics: by considering only probable shooting positions that were annotated in advance and using simple criteria to choose among them, you can get a much better result than if you implement a more generic solution that starts with less assumptions and considers the whole environment. Not only would it be immensely more difficult to make the generic method work, but even then it would most likely just re-discover the same candidate positions and yield results similar to the simpler method, while being harder to tweak.\n\nFor a virtual character to act autonomously in a given environment, you want it to use as many assumptions about the environment as possible to reduce the complexity of what it will process, first of all because that’s a way to just make it work. The same principle can apply to applications where you would use machine learning: if you already know which parts of your data are important for your application, you can use methods targeted on those parts directly, instead of a generic solution that you will then attempt to steer in the direction you already know you want it to take.\n\nWe talk to a lot of people who are interested in using their data in a smarter way, especially to personalize their application to each of their users. And sometimes they really do need a full-fledged machine learning solution to sift through the whole thing and discover the relevant features and their complex correlations within. But more often than not, for their needs and the relatively straightforward data they have, they can get a satisfactory and much more reliable result by analyzing the parts of their data and the features that they already know to be the ones that matter for their business, with a more intelligible algorithm.\n\nIn those cases they could use something like deep learning, but the main drawback of this approach is how much of an opaque black box it is, which is precisely the reason why it is seen as real AI.\n\nAt least for now, AI is made with software. The problem of making AI work is related to the problem of making software work. So just like any piece of software, you want to be able to efficiently develop, debug and maintain your AI. This can be made much easier if your program is simple, and comprehensible.\n\nWorking with a more targeted algorithm reduces the complexity of what the program has to handle correctly, and therefore reduces the space of what can cause bugs or unsatisfactory results by as much. This can also make execution much faster. But the main argument against solutions that have an air of mystery like deep learning is how hard they can be to tweak and debug. If you get predictions that are not completely satisfactory in a subtle way, it can be very difficult to figure out how to improve them. Conversely, the better you understand how an algorithm works and the more information you have about how it produces its results, the easier it is to improve your program.\n\nThe culture of using a solution that will be easier to maintain is common in software development in general, yet for AI it seems that the cover is sometimes as important as the book. The tendency to discount an algorithm as simplistic if it becomes understood can lead to looking for a solution that seems magical and full of promises, but the very reason why it looks smart can make it work against you.\n\nAs long as it does the trick, the fact that you understand how your data analysis solution works is not such a bad thing. And if we’re calling deep learning AI, then we might as well call that AI too.", 
        "title": "Does AI need to be magical? – craft ai –"
    }, 
    {
        "url": "https://medium.com/@toth/thanks-for-sharing-brad-i-found-these-two-pieces-rather-entertaining-too-931f51b8874?source=tag_archive---------3----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "Thanks for sharing Brad. I found these two pieces rather entertaining too:"
    }
]