[
    {
        "url": "https://medium.com/@joshkingmadrid/4-free-simple-ways-to-start-converting-your-online-sales-in-less-than-24-hrs-making-money-online-ed1f0a1a4422?source=user_profile---------1----------------",
        "title": "4 FREE Simple Ways To Start Converting Higher Sales Before The Holidays 🎄 💸 (100% GUARANTEED YOU…",
        "text": "We all want more traffic.\n\n We all want more leads.\n\n We all want more sales.\n\n“Businesses with 1–5 employees get on average between 12–20 visitors per day to their website.”\n\nMost businesses don’t get a ton of traffic to their sites. Which means they don’t make much sales. There’s a ton of competition out there for your user’s attention. And everyone thinks that the secret to growing their business is to mindlessly churn blog posts, guest posts, and social media posts hoping that it leads to more sales.\n\nIt’s tough — if this was easy we’d all be living the Jet Set Life. Right?\n\nWhether you’re a free lancer, dropshipper, offer a service, sell digital products, offer consulting, or you’re promoting an affiliate offer, there are MASSIVE opportunities to cash in on your existing visitors.\n\nThere’s actually a much, much easier way to grow and increase your income.\n\nIt’s not spending tens of thousands on new traffic and advetisements.\n\nI’m not saying you shouldn’t focus on trying to grow your traffic. I’m saying that people don’t focus enough on optimizing what they already have. It drives me crazy seeing how many people don’t earn the type of money they can be making.\n\nWith all this in mind, here are the four easy to implement, but highly effective stratgies you can use every single time you promote something online that will help you CASH OUT.\n\nThis is a strategy called CURE vs PREVENTION.\n\nWhat do I mean?\n\nThis is a concept I saw from Joseph Sugarman’s AdWeek Handbook.\n\nPrevention headline = “Oh, at some stage in the future this may help me avoid a problem.”\n\nCure headline= “I am in so much pain right now I would literally do anything to fix this.”\n\nThere is a HUGE difference between the 2 options.\n\nA prevention sell is very very difficult — you’re trying to get someone to worry about the future. A cure sell is easy — you show them how much they need your solution — right now, at this moment!\n\nThink about health and fitness as a real-world example:\n\nWe all wish it were different, but the harsh reality is there’s not much money to be made telling people to eat in moderation.\n\nWhen you are selling anything, you should aim to sell it from the perspective of a “cure.”\n\nHave you heard of the psychological bias called Anchoring?\n\nCheck this out from Harvard Law School:\n\n“Anchoring is a cognitive bias that describes the common human tendency to rely too heavily on the first piece of information offered (the ‘anchor’) when making decisions.”\n\nThis is why your parents used to tell you how important it is to leave a good first impression.\n\nHow does this affect us as entrepreneurs, business owners, affiliates, & freelancers?\n\nIt tells us that first impressions are pretty much the only impression that matter. The very first thing you feel about a website will stick with you.\n\nCluttered and hard to navigate? Or minimal and easy to use?\n\nThe easiest way to fix this so you can leave a lasting impression on people?\n\nIf you’re an affiliate, what’s the biggest competitor in your niche doing?\n\nIf you’re a designer, what are your competitor’s sites like?\n\nAnd don’t just look at your direct competition — look at the people at the top of their game.\n\nGreat design shows that you go the extra mile and customers love that.\n\nGoogle the top keywords in your industry and see how the professionals are doing it — the people at the top of their game.\n\nSee what elements you can include from their sites that would work well for you and help you achieve your goals\n\nWhat’s the first thing you do when you need to find something in your city?\n\nThen your first question that comes to mind is:\n\n“How do I know this business/contractor/opportunity is as good as they say?”\n\nYou want to know someone is good at their trade, and the best way to know this is to hear other people say they are good.\n\nBut the BIGGEST problem with most testimonials is that they are from “nobodies.”\n\nPeople or businesses with no social proof.\n\nIf you rely on those testimonials, you are forcing your customers to rely on the opinion of strangers who have zero credentials.\n\nWhat does this mean?\n\nLet’s look at two different testimonials:\n\n“Excommerce is the best ecommerce solution I’ve used. It’s simple to use, makes me more money, and I’ve never seen anything else like this on the market.”\n\n“Excommerce is the best ecommerce solution I’ve used. It’s simple to use, makes me more money, and I’ve never seen anything else like this on the market.”\n\nExact same testimonial, but they are from different people (perspective wise).\n\nOne of them is from a random guy from Irvine called Josh m.\n\nNobody cares what a random guy called Josh M thinks of Excommerce.\n\nIt could easily be made up — there’s no “proof” that it’s real.\n\nBut the second testimonial?\n\nIt shows that a guy called Josh King Madrid(who has made seven figures from internet businesses, is a public speaker, and top influencer) is recommending Excommerce.\n\nYou know exactly where to find this guy Josh King Madrid because there is a link you can click to see his website.\n\nIf you clicked through to his website, you’d see that he has been featured by every major publicaiton, has a huge social precense and a legitimate track record of multiple online businesses. Now that’s a good testimonial.\n\nYou can see he’s a real person with a real website. You can see his face, his videos, and read his story.\n\nNot everyone has the luxury of having big clients (like myself in this case 👻) to list as testimonials.\n\nHere are a couple of workarounds if you’re just getting started or you don’t have any noteworthy clients.\n\nOne strategy I love to use is to talk about who else uses the product, and then borrow their authority.\n\nWhen I promote something on my website, I can mention that another top person uses the same platform or something similar to establish credibility even though it doesnt exactly correlate.\n\nExample: Many companies like SHOPIFY use tools like Excommerce & Double Tap to boost their sales. Orbelo is just one example.\n\nEveryone is familiar with Shopify & Orbelo in the e-commerce industry, so it establishes instant credibility.\n\nTry and find out where the products you are using are being used, then leverage the authority of others.\n\nWhether it’s personal services or selling products via ecommerce, testimonials help to build trust. So does good design.\n\nBut there is still more you can do.\n\nEvery time you land on a website, you have one burning question in your head.\n\n“Who runs this website, and why should I trust them?”\n\nUnless you’re a huge authority site like Google or Facebook, people want to know who the person is behind the site.\n\nThey want to see that you’re trustworthy — chances are they’ve been burned before. Hey, it’s the internet, we’ve all been burned before :-)\n\nYou only need to have one minor small element wrong or missing from your site for someone to hit the back button and leave everything with no conversion.\n\nMake sure to always have:\n\nPeople want to know who you are as a person. They don’t want to deal with a mystery person. Most people who buy from you will end up visiting your About page. People who are serious about buying will want as much info and reassurance as possible before they commit.\n\nEveryone wants to know about prices, refunds, guarantees, delivery times, etc. Build up this page and add to it over time.\n\nTo increase your trust factor, you should have an email address, physical address and a phone number. If you’re active on social media, include those links as well so people can see that you stay current. There are so many dormant websites out there, and social media is a good way to show people that your business is still active.\n\nWhy should people listen to your brand?\n\nHave you generated a certain amount of revenue?\n\nHave you or your brand been featured by major publications?Have you spoken at, or attended industry specific events?\n\nThis should be part of your About page or home page .\n\nCheck out my About page for an example. I tell people my “mini story” via copy, video, and podcast (how I got started in internet marketing), then I show some social proof (all my major publications in news outlets, public speaking in front of thousands & my real lifestyle).\n\nWe’ve gone over the four principles:\n\nThese principles are “quick wins” because most of them are free and don’t take too much time.\n\nIt’s extra content, some copywriting, reaching out to old customers, and maybe some design changes.\n\nComment below, I’m curious which of the four topics I mentioned can you implement the fastest and most easily?\n\nThis article was inspired by:"
    },
    {
        "url": "https://medium.com/@joshkingmadrid/personal-branding-social-media-social-proof-is-the-new-job-resume-%EF%B8%8F-ec639ee0fc39?source=user_profile---------2----------------",
        "title": "Personal Branding: Social Media & Social Proof is The New JOB Resume. ✔️🗂",
        "text": "Social media & social proof is the new resume. ✔️🗂\n\n⠀\n\nWhether or not you want to be an entrepreneur or a business owner, you will be left behind without a personal brand. .⠀\n\n⠀\n\nI hear a lot of people say “should I start a business or get results before I start my brand?” NO. You need your personal brand to build a business! .⠀\n\n⠀\n\nBosses and employers will start choosing employees based off of their personal brand and social proof more and more.⠀\n\n⠀\n\nEstablishing yourself without credentials is essentially impossible — no matter what you want to do, a degree in something is required. However, there’s one problem with this — everyone looking to establish themselves has that same degree to some extent. It’s unfortunate, but there’s nothing unique about a business degree when looking for, say, a cozy business job. That’s where personal branding comes in. ⠀\n\n⠀\n\n70% of companies and growing are using social media as part of their screening process , many more use it informally. So consider this: If a recruiter sees your resume and tries to find you on social media , you could get lost among the other users who share your name. ⠀\n\n⠀\n\nNot only that but if you post DUMB SHIT on your social media you won’t even stand a chance. It only takes 1 min, 1 post, 1 slip up to destroy an empire. Be smart with your decisions. When your parents told you things on the internet will be there forever, they weren’t lying. Everybody has a personal brand already, but if you’re posting no content, that means you have a shitty personal brand, so start building yours now⠀\n\n⠀\n\nDid you listen to my new podcast Episode 9 about how to build a profitable personal brand? If not head to joshkingmadrid.com/podcasts⠀"
    },
    {
        "url": "https://medium.com/@joshkingmadrid/these-are-the-only-2-things-you-can-do-with-money-1-of-them-will-make-you-rich-703d92aa2c17?source=user_profile---------3----------------",
        "title": "These Are The ONLY 2 Things You Can Do With Money (1 Of Them Will Make You Rich)",
        "text": "When it comes to using money, you’re either doing one of two things. ⠀\n\n1. Investing ⠀\n\n2. Spending ⠀\n\n⠀\n\nDo you know how to invest? ⠀\n\nDo you know how to leverage your credit? ⠀\n\nOne big mistake a lot of entrepreneurs make is not using their credit the right way, or building enough credit depth. ⠀\n\n⠀\n\nDebt is NEVER a problem. Income is. Debt is good. If you want to scale your business, you better be willing to go in debt. ⠀\n\n⠀\n\nIf you think DEBT is the issue, it means you don’t know how to make enough money. So fix that problem first.⠀\n\n⠀\n\nMost new entrepreneurs bypass credit and look only on how to make money and when it comes time for them to get a job, house, car, or they just need some extra money… THEY ARE FUCKED⠀\n\n I wonder why none of your teachers ever taught you this🤔⠀\n\n⠀\n\nIt’s the exact reason why 97% of the world has no financial literacy and is not fulfilled.⠀\n\n⠀\n\nThe government wants to make us slaves to credit companies. Don’t fall into these traps. Learn to hack the system. The most important thing I can think of, even ask any successful entrepreneur is leverage.Especially leveraging CREDIT.\n\nWant to learn how we hack the system and don’t become DEBT SLAVES?\n\nCheck out my favorite credit training system here.\n\nIt will be the last time you will ever have to worry about credit. ⠀\n\nJust so you know you even need credit to get a good job, a car, a house, apartment, and student loans.⠀\n\n⠀\n\nYou need it to scale a business to five, six even SEVEN figures a month.\n\nBut even if you’re not trying to make that kinda money and you just want an online side hustle, credit is still just as important on a micro scale.⠀ You need to understand, Jobs won’t accept you if your credit is bad, because it’s too much of a risk that you will default on payments. You will always have to pay 3x more on security deposits for purchases. ⠀\n\nIt will haunt you, your whole life if you don’t know how to build and leverage it.⠀\n\n⠀\n\nStop spending money on dumb shit and learn to start INVESTING. ⠀\n\n⠀\n\nWhen you get a credit card. Use it the right way!!!💥\n\nWatch This Video To Learn More About Credit Leverage:"
    },
    {
        "url": "https://medium.com/@joshkingmadrid/the-1st-rule-of-marketing-start-making-more-sales-now-d8fd77689da8?source=user_profile---------4----------------",
        "title": "The 1st Rule Of MARKETING — Start Making More Sales Now",
        "text": "EVERYONE needs to understand the first key to marketing.\n\n\n\nIt’s a simple one, but it’s one if you don’t practice, you’ll find yourself getting beat every time.\n\n\n\nThat key?\n\n\n\n“Nobody Cares What YOU Think or What YOU Like…”\n\n\n\nAll that maters, in business and marketing, is what your customer wants and likes.\n\n\n\nSounds a bit harsh maybe, but that seems to be the first and biggest mistake people make when they start an online or offline business.\n\n\n\nThey’re so concerned with what THEY like that they don’t ever stop and think deeply about what their audience ACTUALLY wants.\n\n\n\nHumans are naturally selfish. It can either blind us to what our audience wants, or we can use that powerful bit of knowledge to market better.\n\nIf you want to learn more rules of Marketing, watch this video:"
    },
    {
        "url": "https://medium.com/@joshkingmadrid/josh-king-madrid-how-to-make-history-by-being-uncomfortable-37c04ac29c9?source=user_profile---------5----------------",
        "title": "Josh King Madrid — How To Make History By Being Uncomfortable",
        "text": "No one ever gets big results by playing small. ⠀\n\n⠀\n\nIf your method is to “stick your toe in the water” or “just see if it works” or to “try it out”… then I predict that you’ve never really gotten the results you want in anything you’ve “tried”. ⠀\n\n⠀\n\nOn the other hand, people who choose to play big in life, give 100%, get out of their comfort zone, those who make leaps without safety nets…they get all the rewards!⠀\n\n⠀\n\nI get scared shitless when I start to feel comfortable. That means things are not going the way I need them to go. It means I’m not growing. It means I’m not leveling up. It means that I’m destined to fuck up soon.⠀\n\n⠀\n\nGet comfortable being uncomfortable. Fall in love with that process, fall in love with going all in. Fall in love with being different even though everyone around you thinks your fucking nuts.⠀\n\n⠀\n\nThat’s the zone you need to be in, if you want to make it BIG. That’s how you will change the world. That’s how you’ll make HISTORY. ⠀"
    },
    {
        "url": "https://medium.com/@joshkingmadrid/most-people-forget-to-do-these-5-things-when-trying-to-start-a-multi-million-dollar-company-josh-d14fcecb3030?source=user_profile---------6----------------",
        "title": "Most People Forget To Do These 5 Things When Trying To Start A Multi-Million Dollar Company — Josh…",
        "text": "After tons of successful and even failed start-ups, these are the 5 things I wish someone told me before I launched any of my start-up business. Implement these today and the success you see will come a lot easier, sooner, and be a lot BIGGER.\n\nLook at the true motives and intentions of other individuals when working with potential business partners. Often times people want to chose a business partner based off of their credentials or their work ethic. As important as those traits are, I believe it’s 10x more important to learn how to read people and know their true motives and what their end goal in mind is. I’ve worked with people before who are selfish or egotistical and when looking to team up they really only care what’s in it for them instead of what they can do to make the consumers happy. This is playing the micro scale, you may be able to make some quick money short term but it will always come back to hurt you in the long run if you don’t respect the people who put money in your pockets. Find business partners with humility, people who care about leaving a legacy and impact rather than monetary currency and boasting their self image.\n\nCreate a clear business plan using logic to pitch investors. When creating a business plan to pitch investors on raising money for your start-up, it needs to catch their attention and make perfect sense logically for them to be interested in funding your business idea with their hard earned money. Break down all the numbers of where the money is coming in and out and explain why your product makes sense for them to invest in by using logical reasons. The best way to do this is by knowing the entire target market wants, needs, and dislikes and using the cognitive biases to back why your target customers would be willing to buy your products and services. Too many people fault to using emotional pitches instead of logical justification. I like to say, when it makes “sense”, it makes dollars. So show your investors that you are confident in your abilities to produce revenue in your business and you will have no problem finding the capital you need rather quickly.\n\nDon’t over complicate your project. Too many people get way to fancy on their start-up by wanting to have everything and do everything and end-up spreading themselves to thin and actually not being able to execute on anything. I’ve done this before. However, thanks to the help of mentors, I realized it’s better to start with one simple concept, master it, and then diverse in to new concepts and products inside your company after you start to see success. Nobody will buy your companies’ products if they can’t comprehend what you actually can provide them expert value with. One of the fundamentals laws of branding is to grab attention and notoriety for one niche and until you dominate that industry, don’t try to run both. This also gives you the luxury of creating novelty, which creates more awareness, relevancy and desire for your companies’ products.\n\nLaunch your product as soon as possible. Get prototypes or beta versions out and running to a select amount of individuals. If you wait and procrastinate till the right time to curate and distribute the perfect product, your subconscious mind will tell yourself it’s not that important and you will start to prioritize the wrong things which will slow down the time of your launch. It doesn’t matter if you product is not completely perfect and the best of the best when you push it out to the market. By getting it out there fast, it gives you more time to adjust to what exactly the market wants. Most of my businesses are a completely different business model then when I originally planned it because I had to adjust to the market and adjust to my target customers values, wants and needs allowing me to quickly tweak my projects time after time until they reached ideal perfection, that’s when I’m able to go all in and push my product out to the market on a mass scale.\n\nTest everything. If you want to drive the maximum amount of traffic and conversion to your business you need to “always be testing”. Don’t get complacent with your current methods of operations when it comes to advertising, customer acquisition , customer satisfaction, or customer retention. Always test and track results to see what works best & what doesn’t work as well. This will give your start-up a higher likelihood of longevity and increased revenue. It allows you to cut out the processes that do not work and double down on the ones that do. With a fast paced growing economy and trendy market like we have today it’s important to stay on top of your game so you can catch and ride the next trend to revolutionize your business."
    },
    {
        "url": "https://medium.com/@joshkingmadrid/huffpost-interview-5-things-i-wish-someone-told-me-before-i-launched-my-start-up-josh-king-madrid-948d57bbcafc?source=user_profile---------7----------------",
        "title": "HuffPost Interview: 5 Things I Wish Someone Told Me Before I Launched My Start-Up: Josh King…",
        "text": "Yitzi: Thank you so much for doing this with us! What is your “backstory”?\n\nI appreciate you giving me time to provide value to your readers. My story is really not that unique. I started off just like any other normal kid who had insanely huge dreams and ambitions. In middle school I used to always get in trouble for talking a lot and I remember my teachers hearing my conversations and telling me that I lived in an “imaginary world”. I always used my imagination and created these crazy scenarios in my head of how my life would play out one day. Today I realize, I’m just one of the few who actually executed on these imaginative stories instead of just fantasizing about how “cool it would be if it was possible” like many of my classmates. My initial goal was to make all of these dreams happen by taking the guaranteed route to wealth and becoming a physician like my father but fast forward to my freshmen year of college at UC Irvine, I had a 1.1 GPA and realized I had no passion for medicine at all. After dropping in to a psychology class I realized my true passion was the psychology of influence and understanding the way the human brain works and marketing was my vehicle to pursue that passion and provide real value to others. I dropped out of UC Irvine after 4 months, after I netted my first $30K month to pursue full-time entrepreneurship online, which is now almost one year ago.\n\nYitzi: So what does your company do?\n\nI’m involved in multiple businesses but my most recent project is Excommerce, my third and biggest tech start up with over 6000 users using the platform. Excommerce has e-commerce SAAS (software as a service) products and an educational platform on how to utilize our products to help e-commerce and internet marketing entrepreneurs increase traffic and conversions to their online stores and businesses.\n\nYitzi: What do you think makes your company stand out? Can you share a story?\n\nMost people when asked this question tend to say something cliche, like “there is nothing else like this on the market”, only to have an exact duplicate start up as the guy next door. With Excommerce, I’ve done over a year of market research finding all the strengths and faults inside of both the e-commerce and internet marketing industry. I looked at all the customer feedback from all the other softwares and platforms and looked purely at what my target audience disliked from competitors and what they craved to be curated so their lives would become easier. Instead of creating a platform I thought would be a good fit for the market, I created a platform with the consumers best interest in mind. This way I wouldn’t have to sell any products, the products would sell themselves. I call this process trend hacking, I took two popular industries, eliminated all faults and doubled down on what people liked and wanted in both, to now create the perfect ideal business model for my target audience.\n\nYitzi: None of us are able to achieve success without some help along the way. Is there a particular person who you are grateful towards who helped get you to where you are?\n\nLong story short, my parents were very cheap and made me buy everything, that was not a basic necessity to survive, with my own money. They told me in second grade, if I ever wanted anything in life, I would have to work hard and earn it, so I’m this case it meant buying the coolest toys and clothes with my own money. Forcing me to sell to survive, I started buying wholesale products online and retailing them to my classmates to make a quick buck in the second grade. As I got older, I started to capitalize on trends and scale this process, eventually earning thousands a month in profit by selling hats and jewelry in middle school through Facebook, and then even more in high school by flipping automobiles on Craigslist. My parents used to brag about my marketing and selling skills to all their co-workers and family members. I remember I used to absolutely hate this recognition but I now believe this instilled a high dose of self confidence and belief in myself which allowed me to continue to execute my goals at the highest level in all my ventures. Right before I turned 18 I discovered e-commerce & internet marketing and I went all in when it came to learning the in’s & outs of the industry. I missed out on a lot of “normal teenage memories” and I lost a lot of friends because they didn’t understand what I was doing and decided to criticize my efforts. Regardless, I didn’t let any of that affect my personal work habits and business and even though not making much money at first, through perseverance and laser focus that path eventually led me to a road of endless opportunities. My parents didn’t agree with me spending more time on my business than my education at the time but as I started to get real results they fully supported my decision and encouraged me to work hard for what I truly believed in. It’s hard for me to believe how much I used to despise my parents for being so cheap and not spoiling me, but now I am forever grateful for these principles they engraved in me. I have enough humility to express my gratitude to them because I truthfully can say I would not be where I am today without them.\n\nWake up to the day’s most important news.\n\nYitzi: How have you used your success to bring goodness to the world?\n\nI used my success in business to co-found and build Team Jet Set, a personal & business development media company who’s goal is to inspire an international movement of millennials to follow their ambitions and break out the bad habits they may have been trained their entire life. Team Jet Set consist of some of the most influential young entrepreneurs and we put out free content, like blog articles, video content and share business tips and inspiration on our social medias. After close to two years of doing this we now have a collective audience online of over half a million individuals and growing that are interested in entrepreneurship. This led us to doing multiple speaking tours where we go state to state and host mastermind events and sell out rooms of 200+ people of all ages who come to learn about marketing, e-commerce and personal branding in this new era of technology. It has definitely been one of the most fulfilling things for me because I know that If I wasn’t inspired by other individuals that put out content along my journey I would not be anywhere close to where I’m at today. This mission to change this generation and the world has nothing to do about me and everything to do about other people. This is why we created a team. I think many times people forget that when selling online there is a real person on the other side of the screen purchasing your products.Most people often believe it’s a “numbers game” when in reality it’s a “peoples game”. If you don’t understand and give people the value they need and want, you will never reach success.\n\nYitzi: What are your “5 things I wish someone told me before I launched my Start-Up” and why.\n\nLook at the true motives and intentions of other individuals when working with potential business partners. Often times people want to chose a business partner based off of their credentials or their work ethic. As important as those traits are, I believe it’s 10x more important to learn how to read people and know their true motives and what their end goal in mind is. I’ve worked with people before who are selfish or egotistical and when looking to team up they really only care what’s in it for them instead of what they can do to make the consumers happy. This is playing the micro scale, you may be able to make some quick money short term but it will always come back to hurt you in the long run if you don’t respect the people who put money in your pockets. Find business partners with humility, people who care about leaving a legacy and impact rather than monetary currency and boasting their self image.\n\nCreate a clear business plan using logic to pitch investors. When creating a business plan to pitch investors on raising money for your start-up, it needs to catch their attention and make perfect sense logically for them to be interested in funding your business idea with their hard earned money. Break down all the numbers of where the money is coming in and out and explain why your product makes sense for them to invest in by using logical reasons. The best way to do this is by knowing the entire target market wants, needs, and dislikes and using the cognitive biases to back why your target customers would be willing to buy your products and services. Too many people fault to using emotional pitches instead of logical justification. I like to say, when it makes “sense”, it makes dollars. So show your investors that you are confident in your abilities to produce revenue in your business and you will have no problem finding the capital you need rather quickly.\n\nDon’t over complicate your project. Too many people get way to fancy on their start-up by wanting to have everything and do everything and end-up spreading themselves to thin and actually not being able to execute on anything. I’ve done this before. However, thanks to the help of mentors, I realized it’s better to start with one simple concept, master it, and then diverse in to new concepts and products inside your company after you start to see success. Nobody will buy your companies’ products if they can’t comprehend what you actually can provide them expert value with. One of the fundamentals laws of branding is to grab attention and notoriety for one niche and until you dominate that industry, don’t try to run both. This also gives you the luxury of creating novelty, which creates more awareness, relevancy and desire for your companies’ products.\n\nLaunch your product as soon as possible. Get prototypes or beta versions out and running to a select amount of individuals. If you wait and procrastinate till the right time to curate and distribute the perfect product, your subconscious mind will tell yourself it’s not that important and you will start to prioritize the wrong things which will slow down the time of your launch. It doesn’t matter if you product is not completely perfect and the best of the best when you push it out to the market. By getting it out there fast, it gives you more time to adjust to what exactly the market wants. Most of my businesses are a completely different business model then when I originally planned it because I had to adjust to the market and adjust to my target customers values, wants and needs allowing me to quickly tweak my projects time after time until they reached ideal perfection, that’s when I’m able to go all in and push my product out to the market on a mass scale.\n\nTest everything. If you want to drive the maximum amount of traffic and conversion to your business you need to “always be testing”. Don’t get complacent with your current methods of operations when it comes to advertising, customer acquisition , customer satisfaction, or customer retention. Always test and track results to see what works best & what doesn’t work as well. This will give your start-up a higher likelihood of longevity and increased revenue. It allows you to cut out the processes that do not work and double down on the ones that do. With a fast paced growing economy and trendy market like we have today it’s important to stay on top of your game so you can catch and ride the next trend to revolutionize your business.\n\nYitzi: I have been blessed with the opportunity to interview and be in touch with some of the biggest names in Business, VC funding, Sports, and Entertainment. Is there a person in the world, or in the US whom you would love to have a private breakfast or lunch with, and why? He or she might see this, or I might be able to introduce you.\n\nI would like to interview some of the other top marketing influencers, who are a bit older than me and been in the game a lot longer, on my podcast so my audience can learn about their perspective and compare our similarities and differences between each other to give the ultimate value and comparison between the older generations versus the millennial generation. Names like Gary Vaynerchuk, Tai Lopez, Andy Frisella, Grant Cardone, Lewis Howes, Tony Robbins and anybody else who would be willing to provide value to the younger generations listening. That would be cool.\n\nThis was very inspiring. Thank you so much for joining us!"
    },
    {
        "url": "https://medium.com/@joshkingmadrid/why-dropshipping-is-the-best-platform-for-you-to-start-an-online-business-6585b7bec5b4?source=user_profile---------8----------------",
        "title": "Why Dropshipping Is the Best Platform for You to Start an Online Business As A Newbie",
        "text": "E-commerce is growing. Did you know that according to the New York Times, 8.4 percent of retail sales take place on our computers?\n\nIt is convenient for customers, and it is cost-effective for companies.\n\nAn online retailer can sell more products that their physical retail counterparts with fewer workers. In fact, almost 75 percent of e-commerce companies employ four or fewer workers — and people are losing their jobs because of it.\n\nWhile e-commerce is currently responsible for some 178,000 jobs, department stores have lost almost 450,000 positions — and that trend is only going to continue.\n\nIt requires even fewer employees than traditional e-commerce and less of an investment.\n\nDropshipping is a type of retail fulfillment in which you, the merchant, never touches the product. When a customer buys from you, the order is sent directly to a third-party manufacturer or distributor. That company packages and sells the product for you and ships it to the customer directly.\n\nNot only do you not have to box anything up or ship it, you also do not have to maintain any inventory.\n\nAnd that is huge.\n\nWhen you are in e-commerce, you may not have to maintain a physical retail location, but you do need to purchase and store inventory as well as packing supplies. That can mean thousands of dollars in capital that you need to supply upfront — and it comes with a big risk.\n\nIf people stop buying your products, you could be left with thousands of dollars of unused inventory, taking up space and tying up your investment capital.\n\nWhen you become involved in dropshipping, you remove this risk completely.\n\nIn dropshipping, you don’t have to pay for a single piece of inventory unless you make a sale. In most cases, the money will automatically be transferred to your account so you are out nothing.\n\nAs a result, you can start a dropshipping company without much money upfront and you don’t have to use earned dollars to fund your inventory.\n\nThe overhead with drop shipping is very low because you never have to touch a physical product. That means no paying for a warehouse or managing storage. You don’t have any inventory to track or account for. You won’t have to order products or manage stock level.\n\nWhen overhead is low, it can give dropshippers more free time to do the things they want to do in life, because they have no physical commitment. Dropshipping companies also don’t have to pack or ship orders. They don’t even have to handle returns and the inbound shipments that accompany them — and that means FLEXIBILITY.\n\nWhen you choose dropshipping as a business, you can run your company from anywhere in the world that has an internet connection — but dropshipping comes with another important advantage.\n\nYou can sell whatever you want.\n\nDropshipping lets you offer your customers a wide array of products and to change that product offering whenever you like. If you have a patterned sock store and something like fidget spinners become the next big thing, you can start selling them.\n\nMost manufacturers and distributors will let you list ANY item they sell. You never have to worry about shifts in consumer preferences or up-and-coming trends. Your supplier has you covered — AND you can scale your operations as big as your manufacturer or distributor can handle.\n\nIn other words, sell wool sweaters one day, laptop bags this week and party dresses next month. It doesn’t matter. You can sell anything and change your mind as often as you like.\n\nDropshipping is a simple and lucrative way to start making money online."
    },
    {
        "url": "https://medium.com/@joshkingmadrid/josh-king-madrid-i-launched-a-new-podcast-series-the-dropout-degree-ranked-top-100-business-be091beafdec?source=user_profile---------9----------------",
        "title": "Josh King Madrid — I launched a NEW Podcast Series: The Dropout Degree (Ranked Top 100 Business…",
        "text": "I am so excited! I just released my new podcast series, The Dropout Degree. Now on iTunes and Soundcloud!\n\nWithin the first few days it hit Top 100 Business Podcast rankings on iTunes.\n\nThe goal of The Dropout Degree is to share my experiences as a young up-and-coming entrepreneur, share inspiring stories from the most relentless business moguls and influencers, and educate you on anything and everything that you would never be able to learn in an academic classroom; to help you find out what it really to takes win BIG as an ENTREPRENEUR and exceed the normal expectations set by society regardless of your age, education or financial background.\n\nA tune in and a 5 star review would be greatly appreciated!\n\nThank you so much in advance!\n\nFor more information head here: www.TheDropoutDegree.com"
    },
    {
        "url": "https://medium.com/@joshkingmadrid/an-interview-with-josh-king-madrid-19-year-old-internet-marketing-professional-dcd0190e066e?source=user_profile---------10----------------",
        "title": "An Interview With Josh King Madrid — 19 year old Internet Marketing Professional",
        "text": "These are some inteview questions I answered some months back, sourced from https://futuresharks.com/josh-king-madrid/ . I thought I would share them with you guys.\n\nWell I been an entrepreneur my whole life, I started buying wholesale chinese products and reselling them to kids at my school since 2nd grade. As I got older, the items I sold got more and more expensive and the profit margins increased. I always sold whatever products were currently trending for kids my age. Sophomore year at 16 I worked my first job for $9/hr and I realized it just didn’t make any sense to me considering I have made up to $1,000 in a single week selling things in middle school and high school with only a few hours of work and reaching out to fellow students on Facebook to set up deals on my products, then I would ride my bike to meet them and sell them products like hats, shirts, and jewelry.\n\nI feel as I been able to develop the skill of creativity, which belongs no where near the corporate environment.\n\nMadrid firmly believes not everyone is bound to a 9 to 5 lifestyle. Madrid highly respects the corporate environment, his father is a hard working physician, however his rebellious spirit would much rather have his time dictated by his own schedule. This lead Madrid to then realize a job and traditional school wasn’t right for him. He wanted to be able to live 100% on his own terms; Thus he needed to find a niche that supported that lifestyle and that is exactly what he did.\n\nPeople not seeing the vision or able to take responsibility of tasks, so to make up for their slack, we had to figure out ways of doing things faster than the average person. The biggest thing I have been able to understand when building a team of employees or partners is to make sure to prequalify your them for creativity and work ethic before working with them, the rest can be taught. If you want to be successful, you’ve got to be able to become a leader. You can’t do it on your own. I feel like if you really want to become successful and become able to scale in your business, you’ve got to become a good leader and a good manager. Your team needs to be passionate about whatever they are doing. Treat your employees as business partners and everyone should revolve their skills around the vision of the team. Its deeper than just hiring a person. The reality is without my team, I would have nowhere near the success I been able to see, everyone has important roles that are valuable to the growth of my business. If you cannot create these leadership skills to run a successful team, the scalability of your business will become limited.\n\nYes Absolutely, failure is inevitable. I have learned that along the journey to success, failure is just a stepping stone. I have had over 15 different business ventures that I thought would be “the next big thing” and have failed. I’ve been able to build off of each failed business venture and use the skills and lessons learned to help build my next venture which ultimately led to all my successful ventures I’m involved with today. In my opinion, just because a business venture failed doesn’t mean it is an inefficient or bad business model, it just means the timing is wrong. Timing is very key when it comes to business, it’s all about catching the right trends at the right time and learning how to double down and scale your business to fit right into those trends. The failures I have encountered have taught me to adapt very quickly which has been one of my most valuable assets when it comes to being an entrepreneur. Timing your ventures to trends is crucial when it comes to reaching the businesses maximum potential. In 2017, the trend is the internet and digital platforms. These platforms are always changing, which is where adaptability has allowed me to always stay on top of trends to exponentially scale my business.\n\nI’m a big believer that everything happens for a reason and any negative situation can easily be flipped into a positive situation. Optimism is one of the top traits any and every entrepreneur must possess to reach success. My fan-base & following knows that I call this type of optimism “1000% belief level”. This means with anything one must face in life, they must have an insane amount of belief level that things will turn out in their favor. If you have 1000% belief level, success will become inevitable. This has allowed me to find creative and alternative ways of getting things done and handling negative problems because my mind reassures myself that it will be accomplished no matter what and that I just did need to find the most efficient way to do it. Just remember what John Lennon said : “Everything will be okay in the end. If it’s not okay, it’s not the end.”\n\nOne of the most prominent realizations I have had especially over the course of this year was the true power of Social media and social networking lead me to be able to connect with and find mentors making the income I desire. The amount of free value and affordable real training that you can come across on the internet is insane. I wish I had access and knowledge on these subjects years ago. As well as the amount of books that have helped me re-wire my mind and create skills that have helped me take any losing situations or problems into a winning situation.\n\nThe main focus of being an entrepreneur is simple. Supply & Demand, which is essentially problem solving with value. I believe a successful entrepreneur must go through experiences that will help them figure out which problems exist and then build off of that. Rarely do entrepreneurs just come up with an idea out of the blue, it usually revolves around some sort of experience. You must desire more than anything on how to impact the market and your customers instead of focusing on your income. Money is the reward (product) NOT the goal (purpose) of entrepreneurship! Being an entrepreneur is much more than making money. It is a moral calling and like every other calling, it’s people-centered not self-centered. It’s never really about you, it’s all about others. It’s not about what you can accumulate in income, it’s about what you can contribute to the market. The reason I say this is because in the beginning of my journey I was motivated more by the cars,toys,money and lifestyle,but once I started to have those things with ease I realized how much bigger it is than that. I started to feel a moral responsibility to help change the world and my generation. As an entrepreneur your income directly correlates with the value & scarcity you provide.\n\nI see myself building a multi-billion dollar brand and a movement that has changed the course of millions of lives. I want to have hundreds of thousands of members who are representing Team Jet Set in a positive way. I also want to have changed the course of their lives, creating multiple 6 and 7 figure income earners. Lastly, I want to show and inspire people to strive for greatness and be the greatest they can possibly be.\n\n🔑 Learned something new or inspiring? Share this interview with a friend!"
    },
    {
        "url": "https://medium.com/@joshkingmadrid/this-is-the-easiest-way-for-an-average-citizen-to-bank-1-000-000-f05f886d5e26?source=user_profile---------11----------------",
        "title": "This Is The Easiest Way For an Average Citizen To Bank $1,000,000",
        "text": "It’s really that simple 💰⠀\n\n⠀\n\nWant to make $1 Million dollars?⠀\n\n⠀\n\nHere are some quick tips I just thought of to help you get there faster.\n\n⠀\n\n1. Do the complete opposite of what everyone else has become accustomed to doing. ⠀\n\n⠀\n\nThis is how you will gain ATTENTION. Attention leads to conversion.\n\nIf everyone is wearing white, wear hot pink. If everyone is marketing on Facebook, market on Instagram. If everyone is selling with pictures, use video. If everyone is documenting with social media, document on long term distribution channels like blogs, YouTube, websites, podcast etc.\n\nSTILL do what everyone else is doing if IT WORKS but become highly specialized in the areas no one else is in yet.⠀\n\n⠀\n\n2. CREATE a supply/demand⠀\n\n⠀\n\nA lot of people think this is not possible.\n\nThey say you shouldn’t try to create a demand and that you should just put out what is already being demanded. Well let me explain. There is ALWAYS a demand, but not everyone is AWARE of this demand.\n\nIt’s your job to raise awareness backed with outstanding MARKETING to hit your customers pain and pressure spots to make them realize there is a demand, once you do that. All you have to do is SUPPLY.⠀\n\n⠀\n\n3. TRIPLE DOWN on your STRENGTH and turn it to a BUSINESS.⠀\n\n⠀\n\nThere is AT LEAST 1 thing, that you know how to do better than most of the world. Turn that to a business. ⠀\n\n⠀\n\n4. Now use Step 3 to start a business, use step 2 to create a market, and use step 1 to drive traffic. ⠀\n\n⠀\n\nShare this with someone who needs to see this!"
    },
    {
        "url": "https://medium.com/@joshkingmadrid/the-work-ethic-habits-of-all-millionaires-that-want-to-stay-millionaires-4f4da68084d0?source=user_profile---------12----------------",
        "title": "The Work Ethic Habits Of All Millionaires (that want to stay millionaires)",
        "text": "There is 2 principles I built my work ethic foundation on. It’s now have become a habit in the way I operate on the highest level daily.\n\n1. Do what you NEED to do first, then do what you WANT to do after.\n\n2. Always operate like you’re on your last freaking dollar.\n\nA lot of ya’ll are not anywhere close to where you want to be in life, matter in fact, you haven’t even started yet; yet you turn up everyday and you go out every weekend. What exactly are you celebrating.\n\nA lot of you need to figure out your life’s purpose. You need to figure out what you need to do, so you can live that ideal lifestyle and have something to celebrate. Maybe you don’t have any idea where to start and you’re so caught up in this normal lifestyle, that you don’t even know how to change to get to that point. Just like Warren Buffet said: “The chains of habit are too light to be felt until they are too heavy to be broken”.If you feel like that is you, you need to find people who have the freedom to do what they want, when they want and figure out if what their doing works for you. .\n\nThe reality is it’s 2017 and it’s not too late to make a change. It’s the perfect time to figure out where the hell you want to go in life. .\n\nA great place my opinion is e-commerce and online marketing. This is where our entire GENERATION is heading & fast. If you’re just following me because my lifestyle and you’re not actually using the useful information I put out to better & educate yourself, you might as well unfollow now. The only thing holding you back from success right now is other people’s opinions. Re-read that last sentence. That’s the only thing that is really holding you back. Why? Because it affects YOUR way of thinking. Take away that barrier and you can literally do anything and everything, there is ALWAYS ALWAYS ALWAYS a way. Don’t give me an excuses or sob stories. .\n\nSave that for after you become successful to make your story sound better, when your down in the trenches trying to make it happen, nobody cares. That’s real.\n\nYou can find more of my success hack blogs on www.teamjetset.com"
    },
    {
        "url": "https://medium.com/@joshkingmadrid/3-simple-tips-to-accelerate-massive-success-that-actually-work-c0055fc1d62b?source=user_profile---------13----------------",
        "title": "3 Simple Tips To Accelerate Massive Success That Actually Work",
        "text": "You ATTRACT what your BECOME. If you want great people around you, you must become great first.⠀\n\nIt took a lot of sacrifices. Here are 3 tips you need to understand to become great.⠀ ⠀\n\n2. Believe in yourself. Successful people don’t see or even know what limitations are, they see opportunities. Get over any negative self thinking and don’t look to anyone else for approval. When others say “You can’t” respond with “Watch me”. I promise you when you do what people say you can’t it is the BEST feeling in the freakin’ world. It all starts with small actions and it will translate to big actions! 1000% Belief!!⠀\n\n3. Never EVER EVER give up! The average millionaire goes bankrupt at least 3.5 times in their lifetime. Failure is an event, not a person. It will NOT KILL YOU! If you ever feel like giving up just think about all the people you need to prove wrong. Personally for me, I used to tell everyone I knew and announce publicly what my goals were. I know must people say “hustle in silence” or “don’t tell people what you are doing” but at the same time if you tell people you are 7x more likely to hold yourself accountable! Imagine telling everyone you ever knew you were going to lose weight but then you got fatter… You would feel like shit! Same thing with your business and other goals. Hold yourself accountable and do what you say you are going to do.⠀"
    },
    {
        "url": "https://medium.com/@joshkingmadrid/easiest-way-to-make-money-in-2017-2018-its-called-the-middle-man-43f714b009ea?source=user_profile---------14----------------",
        "title": "Easiest Way To Make Money in 2017 & 2018. It’s Called “The Middle Man”",
        "text": "If you’re one of those people who are complaining that you can’t pay for seminars, books, education, mentors or even your bills because your job doesn’t pay you enough, let me show you why that is the EXACT reason you should spend money to invest. ⠀\n\nFind something worth investing your time and effort in and go all out and crush it. Stop dipping your toes.⠀\n\nIn 2017 & 2018, the best & easiest way to make money IMO is by being “the middle man”.⠀\n\nUber, Lyft, Airbnb and a ton of other big time businesses all mastered being a middle man. Now obviously, not everyone can be the CEO of one of these companies. But you are the CEO of yourself and there is other alternatives to make good money by being a middle man.⠀\n\nDropshipping, Affiliate Marketing, Wholesale House Flipping, Social Media Managing are all businesses where you make money by connecting the dots aka being “the middle man”. ⠀\n\nYou don’t provide the products, you need little to no inventory and you are able to dictate your own income,hours, and lifestyle.⠀\n\nLearn how to become one good ass middle man and you’ll get paid a lot this year!⠀"
    },
    {
        "url": "https://medium.com/@joshkingmadrid/if-youre-not-exactly-where-you-want-to-be-yet-you-need-to-read-this-right-now-1f5a87a1f52e?source=user_profile---------15----------------",
        "title": "If You’re Not Exactly Where You Want To Be Yet, You Need To Read This Right Now.",
        "text": "Last night I had a 15 year old kid tell me they made $5K their first month diving in to entrepreneurship, just off watching my free content.\n\nThat’s only 1 out of thousands of people who tell me things just like that daily, people who are changing what they’re doing on a daily basis to get different results in their life. ⠀\n\nOne of the first people who inspired me, was on Social Media 5 years ago, I used to read all his post, check his lifestyle and get motivated as hell. I can 100% say with confidence, because of the content he put out, my life changed and my drive was 10x.⠀\n\nI want to do the same. I see my (even) younger self in everyone that follows me, regardless of your age. ⠀\n\nIf just one piece of content I put out, makes you make a decision that alters your life forever, my job is done. I put out content because I know without my role models I wouldn’t be the person I am today. ⠀\n\nIt doesn’t matter how much older or younger you are then me. You’re not too early and you’re not too late to start. ⠀\n\nThe resources are there for you to win. ⠀\n\nIt just comes down are you actually serious about making those resources work or are you just kinda serious. ⠀\n\nDo you have the mental strength to put off everything that you are used to having as a guilty pleasure for delayed gratification?⠀\n\nThat’s something you need to truthfully ask yourself.⠀\n\nIf you gotta think about it, if you’re going out tonight when you know you got shit you need to handle, then I’ll answer for you.⠀\n\nYou’re a bench player thinking you should be ranked with the GOATS like MJ, Kobe, & LeBron. ⠀\n\nBut, if you’re reading the right now, and you feel like I’m talking about you, it just means you’re not doing enough. Stop being “motivated” and actually get your hands dirty. Sit down for 10 freakin’ hours and just work. You might think you’re really working but your not, I promise you, you are not micromanaging your time. ⠀\n\nJust work. Just do more. ⠀"
    },
    {
        "url": "https://medium.com/@joshkingmadrid/why-nobody-truly-gives-a-fuck-about-your-dreams-sad-story-52abd4af71b2?source=user_profile---------16----------------",
        "title": "Why Nobody Truly Gives A Fuck About Your Dreams (sad story)",
        "text": "I’m sick & tired of hearing people say “Nobody believes in me”.⠀\n\nWhy should they? What the hell have you done so far to make people believe what you say you’re gunna do. ⠀⠀\n\nA lot of non believers and doubters.⠀\n\nBut at the end of the day if you’re really READY to be an entrepreneur, you wouldn’t trade it for anything.⠀\n\nI know you all have your own journey and circumstances.⠀\n\nAt the end of the day it doesn’t matter.⠀\n\nYou can make it wherever you want. You just have to be willing to put in the work.⠀\n\nI’m not here to make anybody believe in me, except for my damn self. ⠀\n\nNobody gives a f*ck what you’re gunna do! Nobody gives a f*ck what quotes you post and how inspiring you try to be!\n\nYou want people to believe in you? You better create some results. That’s it. Point blank.⠀\n\nYou been INFORMED & INSPIRED, now let’s get back to work."
    },
    {
        "url": "https://medium.com/@joshkingmadrid/keep-this-in-mind-next-time-you-look-at-any-thing-i-post-ever-again-d066a419250e?source=user_profile---------17----------------",
        "title": "Keep This In Mind Next Time You Look At Any Thing I Post Ever Again",
        "text": "When you consume my content, whether it be videos, post, blogs, podcast or whatever it is, I want you to know 3 important things.⠀\n\nI only speak on things I’m truly passionate about and have experienced, I try to avoid cliche shit.⠀\n\nI’m brutally honest and the things I say I know will work for you, I believe in the things I say 1 million percent, meaning, I never talk about things I know I can lose an argument on or can be challenged on. ⠀\n\nI see myself in anybody and everybody who has faced doubt, went against the odds, dreamt massively and made sacrifices for their goals. I know if that’s you, you’ll make it wherever you want to go as long as you stay true to yourself. So I’m putting out content that I know can help you get their faster. ⠀⠀\n\nBut, not only am I doing it for you, but I’m doing it for myself. I’m still young, only 19. I know for me to continue to level up (because I’m nowhere near where I want to be yet) that I have to continuously do the things that got me here and I cannot become too distracted. Which leads me back to number 2, I believe in the things I talk about, which means I do them myself because I only want to lead by example.\n\nThere’s too many people who say “Work Hard” , but only work a few hours a day. There’s too many people that say “You need to make sacrifices” but are going out every weekend consistently yet they are not where they need to be. There are too many people who say “Go All In” but are scared to really invest boat loads of money for the longer vision. ⠀\n\nI want to be someone who defies that. ⠀\n\nTo be dead freaking honest, I want this movement to go down as a turning point in history. ✈️⠀\n\nI know we have the power do it. People are going to freakin win and defy all the odds, the older generations are going to be confused.\n\nTake that into note next time you consume another piece of my content and really realize I want you to fucking win and take what I’m telling you very serious. ⠀\n\nLike actually do it. Don’t just get motivated and listen to it because it makes you feel good. Actually do it.\n\nThis post was originally taken from one of my Instagram captions."
    },
    {
        "url": "https://medium.com/@joshkingmadrid/the-real-reason-most-people-are-broke-not-some-motivational-useless-info-fb4046efb36a?source=user_profile---------18----------------",
        "title": "The Real Reason Most People Are Broke (Not Some Motivational Useless Info)",
        "text": "The #1 reason you don’t have time and money is very simple.\n\nIt’s because you don’t invest time and money.\n\nSo many people expect things and feel entitled even though they are NOWHERE near WORTHY of what they desperately want.\n\nEveryone wants to TAKE, TAKE, TAKE.\n\nNobody wants to GIVE.\n\nMore importantly, nobody wants to GIVE UP.\n\n“Wait…. What? I thought you said Never give up. Why would I give up???”\n\nNobody wants to GIVE UP: the parties, the nights out, the shitty friends, their “hard-earned” dollars and their “precious limited” time.\n\nThese people have a false sense of reality, a false sense of awareness, they do the bare minimum and don’t allocate their resources like time and money in the right places on a consistent daily basis. When the opportunity of a lifetime comes around they end up assuming that the world played them and that they have been unfortunate enough by chance to not be able to take advantage of the opportunity due to limited time and or funds.\n\nThese are the same negative people you see always blaming society and blaming others for their lack of success, yet they are never contributing. The same people who complain about their boss and not getting promotions but, yet are enthusiastically waiting to get off on Friday. The same people who speak negatively on people with nice cars for being “douche-bags” and showing off but own every pair of Jordans and drive an old Civic.\n\nYOU DO NOT WANT TO BE THIS PERSON.\n\nAsk yourself this question LOGICALLY.\n\nHow can you expect to make $1,000 a day, if you never even spent $1,000 in a day for your own business or even more importantly, yourself?\n\nHow can you expect to have 18 hours of free time everyday, if you never GRINDED 18 hours a day for yourself?\n\nYou’re either WORTHY of what you want or you’re NOT.\n\nThere’s no freakin’ getting lucky. There’s no freakin’ shortcuts to massive wealth. There’s no magic steps. There’s no secret potion you drink and get dumb rich off of.\n\nNOW! Let’s not get this confused.\n\nThere IS SHORTCUTS to developing into a better & smarter person ALLOWING you to create wealth faster.\n\nThere’s is RANDOM CHANCE that allows you to meet certain people and create new opportunities when you are WORTHY (not lucky) of attracting it into your life.\n\nThere is PROVEN METHODS with steps to reach financial success faster if you are mentally prepared to put in the work and mentally developed enough to go in with a strategic and creative mindset to find ways to capitalize on it.\n\nI 100% GUARANTEE YOU IT WILL NOT BE EASY OR FAST.\n\nIt CAN BE more SIMPLE & QUICK than before, because you now have more resources available; BUT if you’re not WORTHY, none of that even freakin’ matters.\n\nStart to DOUBLE DOWN & INVEST into who YOU are and shit will change.\n\nJust because someone can show you how to make money DOES NOT mean it will ALWAYS work for you; just like it did for them. If it’s working for them, that probably means they are USED TO WINNING, THEY UNDERSTAND WINNING, THEY ARE WORTHY OF WINNING.\n\nWhat they teach you: may help you and kickstart your success, but if you really want to do it big…\n\nYou MUST Be READY TO FREAKIN’ INVEST EVERYTHING YOU FREAKIN’ GOT.\n\nI’m not saying wipe your bank account to ZERO.\n\nYou need to go ALL IN with how you allocate your money, time and resources.\n\nYou need to invest your money with the end goal in mind.\n\nYou need to prioritize your time with the end goal in mind.\n\nYou need to utilize your resources with the end goal in mind.\n\nWhen you consistently put in the work and stay truthful to your commitments, day in and day out; then one day you’ll be worthy to have tremendous time freedom and financial success and you’ll wonder why “luck” works so well for you."
    },
    {
        "url": "https://medium.com/@joshkingmadrid/you-wont-believe-how-it-feels-to-get-your-dream-car-nissan-gt-r-at-19-d7fb63db596?source=user_profile---------19----------------",
        "title": "You Won’t Believe How It Feels To Get Your Dream Car — Nissan GT-R at 19",
        "text": "I’m not going to lie. I pretty much cried when I got my dream car 2 days ago at 19 years old. I just bought the car I’ve always wanted since I was 13, a Nissan GT-R Black Edition Track Pack (one of the quickest cars in the world).\n\nI didn’t cry because I got emotional over the car but I got emotional over everything it signifies. Anybody who knows me knows this has been the only thing I talked about since I was kid.\n\nSo much energy and manifestation has went into making this possible. Every time I ever drove a car I imagined it was a GT-R, I posted pictures 4–5 years ago saying “ I will have this car before 21” (scroll down my IG @jetsetfly, you will see the pics). I put a sign in my garage 2 years ago when I was broke, that said “GTR PARKING ONLY”, I bought a non activated GTR key fob when I first started college and I put it on my keychain and brought it everywhere with me. People thought I bought they keychain to act like I was showing off and acting like I had the car, but in reality I did it to visualize myself owning it and to remind myself of the milestone.\n\nWhenever someone asked if I had a GTR, I would say “Not yet, it will be delivered in 2017”. Even though I did not buy one until the other day, I always believed I owned one.\n\nThis car signifies all the 16–18 hour days put in, all the sleepless nights, all the doubters and haters who tried to bring me down, all the friends or business partners gained and lost throughout my journey. This is a lot more than a car to me. This is a MAJOR LIFE MILESTONE.\n\nMy buddy Jeff told me “Entrepreneurs don’t get trophies or certificates like students and athletes, you have to earn the right to afford your trophy”.\n\nThis is my trophy car.\n\nI’m extremely blessed beyond measures to be 19, financially free, living in a penthouse, owning 2 nice cars, the ability to travel and live life on my own terms, I have amazing friendships, I have a supportive family, I have a supportive following who represent my brand and most of all I been able to impact and change a lot of lives along the way.\n\nI want you guys to know.\n\nANYTHING IS FREAKING POSSIBLE.\n\nHow bad do you believe it?\n\n&\n\nHow bad are you willing to work for it?\n\nLook at my old Facebook header caption : www.facebook.com/joshkingmadrid\n\n4 out of 6 of those goals I set in December 2016 for 2017 have been smashed already.\n\nIt’s crazy to think only a year ago I was sitting in HIGHSCHOOL CLASSROOM.\n\nI’ll tell you what though. This came NO WHERE near easy.\n\nI worked hard, day in and day out.\n\nI have been consistent as hell. I’ve adapted to the market fast.\n\nI won’t lie, this win is not all me at all. I don’t take full credit. I’ve met 100s of people who developed ME into the person that can do this.\n\nBusiness partners, family, friends, and most importantly doubters.\n\nI’m on pace to hit a FEW MILLION GROSS NET by this time next year between all my businesses and I have not a single inch of doubt that I will.\n\nI’m inviting you to follow my journey because this is just the beginning, we just brought on a full time content team to document it.\n\nFollow me on Instagram @jetsetfly and snapchat @joshkingmadrid.\n\nLet me know what your dream car is in a comment below!"
    },
    {
        "url": "https://medium.com/@joshkingmadrid/million-dollar-advice-for-millennials-with-peter-voogd-ab2273775497?source=user_profile---------20----------------",
        "title": "Million Dollar Advice for Millennials — With Peter Voogd",
        "text": "I met up with my buddy Peter Voogd in Temecula, CA last week and talked about some of our top keys on circle of influence, law of association and on how to recognize and cut off toxic and negative people in your life.\n\nPeter is author of 6 months to 6 figures and the game changer academy.\n\nHere are some of the takeaways I got from Peter.\n\nIf you want to level up from wherever you are in life today, just remember, you MUST hang out with people who force you to level up.\n\nStay away from STILL people.\n\nStill broke.\n\nStill hating.\n\nStill kicking it with lame fools.\n\nStill partying every weekend and doing drugs.\n\nStill being skeptical of great opportunities.\n\nStill watching from the sidelines instead of taking action.\n\nStill saying “what if” instead of “I WILL”.\n\nIt might be hard to cut-off these “still” people off, considering they might be your best friend, partner, family, or co-worker.\n\nDo you value yourself, your dreams, your goals, your purpose and your life more than you value a toxic friendship that is hurting your success?\n\nUntil you make that decision, you will never be able to GROW as a person, you will stay still.\n\nTo make that decision, the first thing you need to do is be REAL with yourself.\n\nReally think long and hard.\n\nMake a list of your friends who are hurting you and a list of who is helping you.\n\nIf you’re having trouble doing this, write down all their pro’s and con’s.\n\nThen after you have this list.\n\nEXECUTE it and start surrounding yourself with the people who DESERVE your company.\n\nMotivational speaker Jim Rohn famously said that we are the average of the five people we spend the most time with.\n\nAfter doing research, I found out this relates to the law of averages, which is the theory that the result of any given situation will be the average of all outcomes.\n\nSalespeople, entrepreneurs, athletes and all successful people know that, in order to increase your wins, you’ve also got to increase your losses. It’s somewhat of a numbers game.\n\nWhen it comes to relationships, we are greatly influenced — whether we like it or not — by those closest to us. It affects our way of thinking, our self-esteem, and our decisions. Of course, everyone is their own person, but research has shown that we’re more affected by our environment than we think.\n\nWhile it’s ideal to be closely surrounded by positive, supportive people who want you to succeed, it’s also necessary to have your critics.\n\nMany entrepreneurs strive to be the smartest person in the room on every issue. But if you’re always the smartest person, you’re hurting yourself. You want to surround yourself with people who can run circles around you in as many areas as possible, people who are exponentially better in a variety of ways.\n\nGet around as many wealthy, positive, purpose-driven people you possibly can.\n\nJust Like Tony Robbins said “If you want to be successful, find someone who has achieved the results you want and copy what they do and you’ll achieve the same results.” Start not only surrounding yourself with good people making good money, but find people who directly have what you want.\n\nProvide MASSIVE value to these types of people in exchange for mentorship.\n\nWhether it’s a service, skill, currency, trade, referrals… JUST FIND SOMETHING to provide to someone who is willing to mentor you that is more valuable to them then mentorship is to you.\n\nThat’s how you gain the frame-control and real authentic help with your goals will be received.\n\nA question you should always be asking yourself is:\n\nYou’re not going to get the results you want ” in the shortest amount of time possible ” without a teacher.\n\nWe aren’t talking about the teachers from your middle-school classroom either. People can only teach you things they have done before, so if you’re comfortable being a teacher, then by all means, learn from them.\n\nIf you want to reach massive success, then you must be taught by people who have reached massive success. It only makes logical sense.\n\nThe best performers in the world used trainers, coaches, and mentors.\n\n… And the list goes on.\n\nNo matter what type of success you start, you will need a mentor because you’ll have questions about specific things.\n\nI hope you found this article useful, please comments your thoughts below!"
    },
    {
        "url": "https://medium.com/@joshkingmadrid/3-things-all-young-millionaires-do-josh-king-madrid-7727217395bc?source=user_profile---------21----------------",
        "title": "3 Things ALL Young Millionaires Do — Josh King Madrid",
        "text": "A lot of people always ask me “Josh, how did you do it?, What did you do? Can you give me tips on how to get where you are at? Can you put me on?”.\n\nSo I decided I was going to put together a guide of 3 of the most crucial things I’ve done over the past few years that I think has led me to where I’m at today and where I’ll continue to go.\n\nAt the top of my head without even second guessing I know these are the top 3 and will always be my top 3. I know myself and I know exactly what I can do, what I have done, and what I will do.\n\nThe 3 things I contribute my success to are:\n\nLet me explain a bit further how you can start implementing these things today.\n\n1.) TELL EVERYONE WHAT YOU PLAN ON DOING\n\nTell people what you intend to do. You’ll feel a sense of pressure to follow through if you are the type of person who stays true to your word. This is one of the biggest things I’ve done since I was young.\n\nTo be honest, everyone around me hated me for it.\n\nPeople used to laugh at me, make fun of me, or even think I was narcissistic because I would tell people my goals.\n\nSome of my teachers and even people in my family used to say “Josh, you live in an imaginary world”, because all my public announcements were OUTRAGEOUS.\n\nI was a little middle school kid telling people I wanted to travel, have expensive cars, become rich, and become famous. (I mean..Isn’t that everyone’s childhood dream? Everyone is to scared to tell people this stuff though because of how rare it is.)\n\nThe funny thing is all of that became TRUE!\n\nNow everyone around me knows that when I say I’m going to do something, it HAPPENS EVERY SINGLE TIME.\n\nWhy? Because I hold myself accountable, it makes 0 sense to LIE to anyone else, ESPECIALLY MYSELF.\n\nNever ever LIE to yourself. It builds bad habits. Start telling yourself and everyone else your goals!\n\nDo whatever it takes to make it happen, so you never prove yourself wrong!\n\nFinding a coach or mentor or even joining a group-coaching program/course has a similar effect to the first strategy but with a supportive element as well. A coach or support team will hold you accountable and provide you with support, but it’s important to know what you want to accomplish before you’re ready to work with a coach. Don’t even get started if you don’t plan on finishing and reaching massive success with the program.\n\nIf you want to work with a Team Jet Set coach btw, just book a free call at: www.tjscoaching.com\n\nTrends are always changing, if you want to succeed and take advantage of trends you need to be able to become fast paced adaptive. Start being consistent with all the traits while adapting. In example, if something you were doing was producing results before STOPS producing results, then quickly adapt to what works again and consistently work hard and double down on those strategies.\n\nTo always stay on top of the game I reccomend doing market research.\n\nFind out what the good businesses and the shitty businesses are doing and figure out exactly why they are producing the results they are producing. I do at least 30 hours a week still on market research and I did much more when I first got started.\n\nThis is where those sleepless nights came in.\n\nThis has helped me always stay on top of the market in each and every one of my businesses. You have to be willing to hold yourself accountable to do these simple but exhausting task if you want to be able to always adapt to the market and win.\n\nEspecially in 2017 and beyond with how fast things are changing, your business has 2 options..\n\nThis one by far probably has to be the HARDEST one for the average person.\n\nThe ability to tune out everything and ZONE IN on anything.\n\nIf you want to build a long-lasting successful business, you’re going to have to deal with the demons of distraction. The world’s most successful & powerful people in all industries are those who have streamlined their lives to a seamless flow of productivity and 100% LASER focus.\n\nAll these people have created massive success whether good or bad in whatever they were trying to accomplish.\n\nIt’s a matter of focus, and it’s critical to your success. An entrepreneur is only as successful as the person’s ability to focus on the most important objective in their solar system: their business.\n\nPersonally for me, I’m 100% fine with cutting out EVERYTHING.\n\nGym, Girls, Cars, Family, School, Parties, and much much more.\n\nNow I’m not saying any of those are bad distractions, some are good distractions…\n\nThey are still distractions!\n\nIf you want to make massive progression in your business, you must be willing to cut out all of those for at least 30–90 days.\n\nHere is 6 tips I found from an article by my buddy Niel Patel on how to become more focused:\n\n1.Do something you really enjoy.\n\n6.Practice focused duration — the process of work, not the state of flow.\n\n90 days later, LOOK BACK, and I promise you, you will be AMAZED!\n\nIf you want success, you better be willing to do things you never done before and you have to evolve into someone you never been before. I hope you found these tips helpful. It took me awhile to write this, so if you made it this far, feedback in a comment below would be much appreciated! Hold yourself accountable to taking that first step and comment below on what your next POWER MOVE will be!\n\nIf you’re ready to take action and start your online business today, instead of “waiting for the right time” start here because there is no better time than NOW!"
    },
    {
        "url": "https://medium.com/@joshkingmadrid/id-be-dead-broke-if-i-never-learned-these-5-things-josh-king-madrid-jetsetfly-df509845aef9?source=user_profile---------22----------------",
        "title": "I’d Be DEAD BROKE, If I Never Learned These 5 Things… — Josh King Madrid @jetsetfly",
        "text": "Which means that you must possess and practice the traits needed that will allow you to develop the winning mindset to achieve your goals. Here are the top 5 traits I believe are needed to become successful below:\n\nYour desire to succeed must be so strong that it dominates a majority of your thoughts and actions daily. Focus on yourself and your vision. Not everyone, actually rarely anyone will have the same vision as you, so you can’t expect others to support you or encourage you. Many many people might try to discourage you or bring you down.\n\nYou must have 1000% belief that you can and will do whatever you set your mindset to. 1000% belief level means that you have already created your reality visually. There is no way you can not achieve something physically when it has already been accomplished by you visually.\n\nAt the end of the day you just need to be the hardest worker in the room. It’s not enough to do the bare minimum. The bare minimum will get you minimum results. You need to go the extra mile. Wake up an extra hour earlier, push out that extra rep, do that extra phone call and take notes on that extra training. A lot of people think they can “work smart” for only a few hours a day and because of that they don’t have to work hard. That is being lazy, you haven’t earned that luxury yet. It doesn’t work like that. It’s about being working hard with maximum productivity levels. Imagine someone working hard at working smart for 10 hours a day and being productive while doing it. This cuts the learning curve massively.\n\nI seen people make 6 figures within a single month and then lose it all within a few months, to be dead broke and in debt. This is what happens when you become unaware and lose your consistency. If you want to produce long-lasting results you must be consistent with the other traits above. On top of being consistent, you must be adaptive. Trends are always changing, if you want to succeed and take advantage of trends you need to be able to become fast paced adaptive. Start being consistent with all the traits while adapting. In example, if something you were doing was producing results before stops producing results, then quickly adapt to what works again and consistently work hard and double down on those strategies.\n\nFind a mentor. A mentor can be a person or it can be various books, but the reality is there are people who are in the place you want to be right now, so it would make sense for you to follow their footsteps and learn from their mistakes which will allow you to cut the learning curve by 10x plus! After that, create a map. A map is a solidified game plan that you need to hold yourself accountable for. This can be self created or it can be a map from a mentor. If you want to do something, chances are someone has done it before. Find out what they have done and sample your map off of their journey but make sure your map is revised to fit your needs and the current trends."
    },
    {
        "url": "https://medium.com/@joshkingmadrid/drop-shipping-is-this-the-easiest-way-for-anybody-to-make-100-a-day-15cf33e3c20?source=user_profile---------23----------------",
        "title": "Drop shipping: Is This The Easiest Way For Anybody To Make $100 A Day?",
        "text": "What is the easiest way to make $100 a day?\n\nI’ll tell you right now.\n\nWhat do I mean by being a “Middle Man”?\n\nWell, we live in a society today where people are becoming “lazy” or “resourceful”… whatever you want to call it.\n\nPoint being is people are looking for the EASIEST way to do something. This means that making things EASY is a SERVICE that is in HIGH-DEMAND.\n\nTake a look at all the retail stores shutting down and switching over to online retail for example …\n\nOr even, Airbnb, Uber, Lyft, Postmates, Affiliate Marketing, Wholesale House Flipping and so many more business models that are just providing a service and saving time, instead of an actual physical product.\n\nIf you can provide that service and do a damn good job at it, you can make a lot of money!\n\nMy buddy Jeff is a great example.\n\nHe just turned 22 years old and picked up his all-time dream car, a Lamborghini Huracan LP610–4.\n\nWell he is pretty much a PROFESSIONAL MIDDLE MAN.Just in case you’re wondering btw, he makes A LOT more than $100 a day doing this.The crazy part is he only works a couple hours a day, but yet his income goes up every month and he is able to travel, buy exotic cars, and have time freedom.Recently, Jeff and I went to the Bahamas on a private jet to celebrate his birthday and he told me his entire story of how he got started with the “Middle-Man” business. Jeff didn’t want a business where he had to sell, convince, recruit, touch inventory, own inventory or even have to talk to a single customer.Now you may be saying “This sounds too good to be true!”Don’t worry about it, I would say the same thing if this was my first time hearing about this.It’s called…DROPSHIPPING.What is Dropshipping? Dropshipping is a retail fulfillment method where a store doesn’t keep the products it sells in stock. Instead, when a store sells a product, it purchases the item from a third party and has it shipped directly to the customer. As a result, the merchant never sees or handles the product.The biggest difference between dropshipping and the standard retail model is that the selling merchant doesn’t stock or own inventory. Instead, the merchant purchases inventory as needed from a third party — usually a wholesaler or manufacturer — to fulfill orders. Now, I’m not saying dropshipping is EASY and I’m not saying this is for everyone!\n\nThis is for people who are willing to sacrifice 2–8hrs a day, people who are willing to be resourceful, people who are willing to invest into their business.Jeff personally does Ebay Arbitrage but, there is a ton of different ways and platforms to dropship, and there is hundreds of different ways to become a MIDDLE MAN; But I’m not going to get into all the money making secrets here right now.T\n\nhis is what has worked for Jeff, myself, the team and many other people who we have coached.Some people we coached have made $100 a day at ages 14–18, some people have made $80K-$200k a month at 19–22, some people have made an extra $300 a day at ages like 35,47,72 and some people have not made a single dollar!I personally believe it comes down to people’s willingness to be resourceful, consistent, and work hard.\n\nIf you’re interested in working with Jeff and learning more about ebay amazon drop shipping, drop a comment here with your email and/or Facebook link."
    },
    {
        "url": "https://medium.com/@joshkingmadrid/with-help-from-josh-king-madrid-i-went-from-broke-highschool-dropout-to-6-figures-traveling-the-3f82ed836e86?source=user_profile---------24----------------",
        "title": "“With Help From Josh King Madrid, I went from Broke Highschool Dropout to 6 Figures & Traveling The…",
        "text": "I still remember January 24, 2016 like it was yesterday. I packed my stuff, said goodbye to my friends and left the classroom….\n\nand by “left the classroom”, I actually mean I never came back.\n\nBut what was the reason ? Why would I drop out a year before graduation even tho I was the second best student in my class?\n\nIt is because I made a decision.\n\nThe Decision to pursue my Dreams.\n\nThe Decision to not go the down Normal Route.\n\nThe Decision to live a Life of Freedom.\n\nSo here I am, A Broke High-School Dropout without a job or any plan for the future. The only goal I had was to pursue FREEDOM and what ever DECISION would get me closer to that goal I would make!\n\nBut the reality was I needed money to eventually do anything with my life. So I got a 9–5 Job, which I never wanted. But what I had learned thus far was that I should never confuse the vehicle with the destination and that my Job was only a money machine for me to save up for the next step!\n\n*Your current Situation is not your Destination!!*\n\nI worked for countless hours and saved literally all the money I made, I didn’t go out on Friday nights, I didn’t wear the newest clothes; I worked, saved and slept.\n\nWaking up on January 4, 2017 I realized I needed to do something else otherwise I would get stuck in this Job and not do anything else for the rest of my life.\n\nWhat do you do when you don’t know how to make money anymore and are desperately searching for ways to do so ?\n\nYes, exactly you turn to Google!\n\nI looked for ways to earn money on the Internet and not long after searching I stumbled across the man, myth and legend.. Josh King Madrid!\n\nHis success story and all the lives he changed made me take action right away!\n\nLiterally! I took my credit card and invested into an Affiliate Marketing Business Opportunity he was promoting at that time!\n\nThat day, yes I will always remember this day! Changed My Life Forever.\n\nI worked my 9–5 during the day and stayed up almost all night to work on my affiliate marketing business. I slept for an average of 4–5 hours a day for a month straight!\n\nDue to me working 8–9 hours on my business every day and the help of my mentor Josh King Madrid, I completely replaced my 9–5 income with INTERNET MONEY! \n\n$1,140 my first month online, the start of my FREEDOM.\n\nFast forward 6 months..\n\nI started earning up to $3,000 a week with Affiliate Marketing and increased my overall entrepreneurial skill set. By that time I had probably sent around 2343 messages to Team Jet Set trying to get to know everyone on the team, I wanted to build my network and join the incredible movement that changed my life.\n\n(*Only another Dream of mine at that point.*)\n\nIt was on July 2, 2017 I got an unexpected text saying..\n\n“Hey brotha, do you want to come through to our Yacht Party on the 4th of July?” — Josh\n\nSay no more! It took me 1 hour to book my flight and pack everything up!\n\nI celebrated the 4th of July on a Yacht packed with 6–7 Figure earners who where all there to network and share ideas. More important to me, I met my idols, the people I looked up to when I started in this Internet marketing world, Team Jet Set.\n\nIt was probably the Best Day of My Life, I met so many amazing people and after all I was feeling like the 18 months of hard work, late nights and early mornings finally payed off.\n\nThe day after I was formally invited to join the team and I accepted.\n\nYes you read this right, it came out of nowhere!\n\nThe Team I looked up to when times were tough invited me to be a part of them.\n\nSo here I am, July 5th 2017, 18 Months after dropping out of School and 6 Months after starting my Online Journey.\n\nEver since that day I made myself a promise,\n\nThat is exactly what I have been doing ever since.\n\nI am traveling the world whenever I want, to attend entrepreneurial events or just to work for a week with the Team. I truly got to the point where I can say, I live FREELY.\n\nAnd all of that was just because of one thing.\n\nConnect with me on Instagram: https://www.instagram.com/jetsetlukas/?hl=en"
    },
    {
        "url": "https://medium.com/@joshkingmadrid/how-to-build-a-personal-brand-that-resonates-with-millennials-c710582c8143?source=user_profile---------25----------------",
        "title": "How To Build A Personal Brand That Resonates With Millennials",
        "text": "In this era of Millennial marketing, social marketing, and influencer outreach, there are simply thousands of strategies your business can use to get where you need to go. Fortunately, we don’t have to think up these strategies on our own, but can look over the shoulders of businesses who have succeeded in paving the way for the rest of us.\n\nJosh King Madrid, better known as Jet, is a successful millennial serial entrepreneur, investor, marketing specialist, coach and is the Founder of Team Jet Set, a company created to educate and provide lasting value centered around inspiration and motivation. Team Jet Set understands the true meaning of a brand movement and how it centers around both the consumer and business owner. While not everyone is comfortable telling their entrepreneurial story, Team Jet Set strongly believes you have an obligation to inspire, teach, motivate and educate.\n\nLooking closer, I began to realize this company is a pioneer in their own right because they’ve also paved the way for four branding movements we can all emulate. Here are the strategies you could take to your personal business and start seeing results fairly quickly.\n\nTeam Jet Set believes in creating a community which is engaging and actionable. One of the first steps in building a great brand movement is to structure your brand’s promise. Your promise should reflect the hopes, values, and dreams of your brand community.\n\nIn doing this, you learn your community’s goals, what they need your help with, and what their challenges are. If your community can start to envision how they are going to get from point A to point B, and how you’ll be there every step of the way when they need you, it creates more passion and engagement with your brand. If you can share a vision that your community wants to strive for and can give them the tools to do so, tomorrow is always a better day.\n\nEvery entrepreneur is trying to learn how to create a positive experience around their brand. Movement notwithstanding, it’s something everyone should be leaning towards as a long term goal. Team Jet Set understands this as they are the parent company of many other facets of business which can feature other aspects for Millennials to work towards. Branching out and being resourceful like this allows their business to become more engaged with their community which in turn means more reaction and response from the people who follow them.\n\nTeam Jet Set’s particular passion engagement is to motivate, encourage, and inspire their following to change the course of their lives by offering skill sharpening tips, free content, and the ability to connect top entrepreneurs with their community in order for them to get a better entrepreneurship experience on their website.\n\nIt’s important to establish yourself as an expert in your particular industry. People from all over your niche are watching your brand. Will it succeed? Will it fail?\n\nThis is why it’s so important to take action. You’ve heard the old saying, “Actions speak louder than words.” It’s more true for entrepreneurs now than it ever has been. Your brand movement lives and dies by what you say, and more importantly, do.\n\nThe mission of your brand movement has to be present along every point in your entrepreneurial journey so you understand which directions you need to be traveling in. With a lot of different responsibilities and tasks which are set afoot for your business, one can get lost in the weeds doing meaningless jobs and forget people are watching. This matters not only for the people on the outside looking in, but also for the inner workings of your brand. What you do for your business, followers, and shareholders expresses your mission in everything. You must take real and innovative steps to execute the promise your brand makes to your community.\n\nTeam Jet Set leads by example. They encourage their followers to watch what they do, then execute. Compare this to other internet “gurus” who tell people to do certain things without actually having experience themselves.\n\nOne of the things Team Jet Set is successful in doing is understanding how the big idea can incorporate more consistency and successfully within a brand movement. Every company or solopreneur has ideas every day. Through trial and error, bad ideas get weeded out. Failure happens almost daily, it seems. They are all looking for the ‘Big Idea’ which will take them to the next level in their business. Team Jet Set mastered not just looking for big ideas, but executing them.\n\nAn important factor to remember in searching for your next big idea is the insights you have on a particular product/service, etc. Your insights can fuel your creative process, which is why most serial entrepreneurs consume important content which will get the creative juices flowing for them.\n\nYour next big idea will come from one of these facets of information flow. Read books, listen to influential and informative podcasts, search blogs, collaborate with colleagues, and test, test, test. Many people want to become apart of something bigger than themselves, but do not know where to start.\n\nTeam Jet Set built a brand off of innovation and collaboration because they mastered the fact that the more other people are involved, the more minds in one room, the bigger the impact that can be created within their brand. You always need to listen to your creative insight because your movement can be made prevalent through your next big idea.\n\nThere are many ways to start a brand movement, but there’s only one way to see it succeed, and that’s through adaptability, patience and consistency. Team Jet Set is the perfect example of a big business enterprise who has created a brand movement the right way."
    },
    {
        "url": "https://medium.com/@joshkingmadrid/is-credit-really-that-important-to-live-lavish-3b4074c7f619?source=user_profile---------26----------------",
        "title": "Is Credit Really That Important To Live Lavish? – Josh King Madrid –",
        "text": "When it comes to living an outrageous lifestyle and not going broke doing so at a young age, you need TWO things.\n\nThe first one is a no-brainer. Everyone wants to make more money.\n\nNOBODY wants to spend more money.\n\nThis is where the second one gets a bit more complicated….\n\nIt doesn’t matter how much money you make if you don’t have credit (unless you are making 10’s and 100’s of millions and even then you still should use credit.).\n\nThe whole point of LEVERAGING credit is to avoid spending your entire income.\n\nYou don’t want to have to spend 100’s of thousands CASH on cars when you can spend that money INVESTING into your business.\n\nThere’s so much wrong information out there online about credit and it’s really confusing if you don’t know what exactly to look for.\n\nAt this point you still may be wondering “WHAT THE HECK IS CREDIT? or HOW CAN I FIX MY CREDIT? or even better “HOW CAN I GET MYSELF AN EXOTIC CAR LEVERAGING CREDIT?”\n\nWell good news, is you’re in the right place, because my team has mastered credit and have used it to travel, buy exotic cars, get approved to make major investments and it’s all because we learned how to master credit like a pro.\n\nHere are some quick tips on why CREDIT is so important that I’ve found while doing research online:\n\nWhy is Credit So Important?\n\nSociety is becoming increasingly dependent on using credit to make purchases and decisions. These days, good credit is used for more than just getting a credit card or a loan. More and more businesses are making the case that you must have good credit before they extend products or services to you.\n\nIt Affects Where You Live and How Much You Pay\n\nBefore you can buy a house, mortgage lenders want to know that you won’t default on your mortgage.\n\nIf you don’t have good credit, the lender will consider it risky to give you a mortgage loan. Don’t think that because you’re not looking to buy a house right now that your credit isn’t important. Landlords also use your credit to decide whether to rent to you.\n\nIt Affects What You Drive and Your Car Payment\n\nUnless you have the cash to purchase a car, you’ll have to get a loan. Your credit not only affects whether or not you qualify for a loan, but also the amount and interest rate of the loan.\n\nGenerally, loan applicants with good credit qualify for larger loan amounts with lower interest rates.\n\nIt Can Affect Your Job Search\n\nMany employers conduct credit checks as a part of the hiring process. If you haven’t demonstrated financial responsibility, a prospective employer might be hesitant to hire you. For example, the employer might believe your level of debt is too high for the salary offered.\n\nIt Affects Your Ability to Start a Business\n\nMany people have dreams of starting their own business. Most business startups require a sizable amount of cash that you might not have available. In that case, you’ll need to obtain a small business loan. Among other things, you need to have good credit to qualify for the business loan.\n\nIt might be somewhat shocking to learn that your credit is needed to establish utility service. Your electric company contends that you’re borrowing one month of electric service. So, before turning on your electricity, the company will check to see if you have good credit. This applies to most utility services including cable, telephone, water, and even cell phone."
    },
    {
        "url": "https://medium.com/@joshkingmadrid/how-to-start-dropshipping-in-7-simple-steps-3c45e1893848?source=user_profile---------27----------------",
        "title": "How To Start Dropshipping in 7 Simple Steps – Josh King Madrid –",
        "text": "The most common question I get asked on my social media; since I do it, my team does it, my little brother does it and all our students are doing it is: “What is ecommerce dropshipping & how can I start?”.\n\nI figured I write this quick blog with some basic information on the topic since I don’t have a permanent video on my social media talking about it (usually just snapchat stories and instagram live feeds/stories).\n\nI got introduced to e-commerce a little over a year ago a little bit before I got into affiliate marketing.\n\nWhen I first started, no one (at least on social media) ever made any noise about ecommerce, now it is quickly growing and one of the most lucrative business platforms, especially amongst millennials.\n\nWhat exactly is dropshipping?\n\n“Dropshipping is a retail fulfillment method where a store doesn’t keep the products it sells in stock. Instead, when a store sells a product, it purchases the item from a third party and has it shipped directly to the customer. As a result, the merchant never sees or handles the product.\n\nThe biggest difference between dropshipping and the standard retail model is that the selling merchant doesn’t stock or own inventory. Instead, the merchant purchases inventory as needed from a third party — usually a wholesaler or manufacturer — to fulfill orders.”\n\nAlso if you want to start shopify and you want a free access link, head here: http://www.teamjetset.com/shopifly\n\nStep 1 is all about finding the right niche (what the niche or theme of the products you will be selling on your store). The key to a good niche is to be specific. Your goal shouldn’t be to sell a bunch of different types of products (This is my opinion! Some dropshippers have found success in having a super broad store. That strategy tends to work more if you are marketing on facebook instead of Instagram). We have no interest in trying to be Amazon or Ebay. Stick to a specific niche and you’ll find the later steps much easier and you’ll end up making more money with your store.\n\nStep 2 is researching your future competitors. This has always been my biggest advantage and secret to massive success online and it’s easier than you think! You’re going to go online and find websites that are already selling in your prospective niche. Then you need to find out a couple things about those sites. Such as, do they have a warehouse, showroom, or retail stores? The goal is to find companies that sell online for multiple brands but have no physical presence. This shows you that they’re drop ship suppliers. It means you can compete with them!\n\nStep 3 is all about setting up your store (yes before you’ve even found your suppliers)! Your best bet is to build a store on Shopify. They have a 14 day free trial. You can sign up right now here.\n\nStep 4: Find the best suppliers for your products\n\nStep 4 is finding suppliers for your niche. The easiest way is by using apps to find products from cheap sites that source their products from China. Looking for products that have good reviews and syncing them up to your site.\n\nStep 5 is all about optimizing for conversions. Basically, it’s doing certain things to get more people buying AND to make more from each person. This is where knowing marketing and psychology plays a big role as well as knowing the secret apps and key tricks that the top bosses are using. If you don’t understand the creative marketing and psychology behind selling and you don’t have anyone to teach you, it becomes really hard to SCALE UP your business to the 6 figure a month range, even 5 figure months may be hard. Trust me.\n\nStep 6 is all about bringing more, more, and MOREEEE people to your store. There are definitely techniques for bringing more traffic to your website but the real trick is getting good quality traffic. That way you’re getting the most out of the money you’re spending on your paid traffic. There are so many sources of traffic for drop shipping but if you don’t want to waste a bunch of money you should focus on a few of the best. The best sources of traffic in my opinion is social media; Paid Ads, Influencers, and Viral Strategies are all insanely profitable ways to market and they will help you get the best bang for your buck! Make sure to always split test though, so you know what traffic sources are producing the most sales and which ones are just wasting your time.\n\nStep 7 to building a MASSIVE drop shipping business is to start outsourcing and automating tasks. Only do this step after:\n\nMost of these last step is achieved by using apps and plugins that will automate day-to-day tasks for you. That way you don’t have to work as much while still making money. I have a few different secret apps that my team & I personally use to make our lives a lot easier.\n\nOutsource by hiring virtual assistants to take over easy and tedious tasks. So you can work as little or as much as you want.\n\nP.S: Also a hint of my personal advice! NEVER show anyone your store, especially on social media! You don’t want people to replicate your store/products, or even worse, your marketing! This can create a tougher market for yourself. There’s 100,000’s of new products being listed every month, so this is not a big deal, but you never know!\n\nDon’t forget to start your own shopify store by clicking here.\n\nComment below if you want more videos about dropshipping!\n\nBTW: Our dropshipping company, Excommerce and free training is coming out soon. Connect here to stay plugged in.\n\nIf you want to join our private facebook group with free ecommerce tips, head here: http://www.facebook.com/groups/excommerce"
    },
    {
        "url": "https://medium.com/@joshkingmadrid/who-is-jetsetfly-6dfb175d1e69?source=user_profile---------28----------------",
        "title": "Who is @jetsetfly ? – Josh King Madrid –",
        "text": "Josh King Madrid: Team Jet Set came from me deciding to surround myself with people who wanted to win in all aspects of life, who wanted to go beyond the normal expectations and raise the standards. I wanted to create a winners circle of millennials. I wanted to surround myself with entrepreneurs who thought on the same wavelength as I did, individuals who had a growth mindset.\n\nWhen I was younger, I didn’t have people who had the same mindset or aspirations as me around, so I had to create the environment that I wanted. There was no place for anyone, Millennials specifically, to be able to reach out and find someone making a difference that could mentor them and teach them how to attain the same success and happiness. When I was younger, I used to have massive goals, but my friends would have disbelief because they were too small minded and did not believe those things could be attained.\n\nSo, the idea came across when I decided to create a healthy environment where it was safe to dream again but most importantly a support team to actually turn these dreams into plans, more than anything I wanted to create a positive collaboration of people empowering others rather than a negative self-centered competition which only empowers one person.\n\nJosh King Madrid: The first step I would say was that I immediately started to make sure that I put in the necessary effort to attain the proven results. I believe too many people are focused on looking good instead of actually being good and I knew if I wanted to create a powerful brand with quality individuals, that I needed to become a quality individual myself first. I made sure that I worked on the Team Jet Set brand with any free time I had, between my multiple business ventures and the brand, I was working 16+ hours a day. Millennials don’t have quite the best reputation in having real results or doing anything serious. Being so much younger than others, I knew that I had to work 10x harder and smarter than everyone else so I can prove that success can be accelerated and doesn’t have to be attained at 30+. Nowadays age doesn’t determine someone’s ability to succeed or create a successful business, it comes down to purely two factors, experience, and work. I knew that my commitment level had to be great, and I had to focus on building my business at all times, not just when it is convenient. At the end of the day, I had to make sure I created results so that when I started to network with other entrepreneurs I had credibility behind my brand. This has allowed me tons of opportunities that have positively impacted my life.\n\nJosh King Madrid: The biggest mistake I would say I made, would be believing that I could do everything on my own instead of outsourcing and having team members working on a specialized task in the beginning of my brand, I ended up spreading myself too thin by trying to take on every task. I learned now that I should try to focus on what I’m best at instead of trying to do everything because it allows me to dramatically improve my skills for maximum results and the same goes for everyone else on the team. There is a saying that states “if you want to go fast go alone if you want to go far, go together”, this is the glue that keeps my brand together and growing.\n\nJosh King Madrid: When I bought my first pair of shoes with my own hard earned money in 2nd grade. My parents loaned me about $15 to buy wholesale beanies from China on a website like Alibaba or something and I retailed them at school and winter camp to the other kids, I even convinced their parents to buy the beaners for them and I ended up making like $40 profit. This one experience made me realized that I was able to get anything I wanted, I just needed to find out the right information, have an insane drive and work ethic. That small accomplishment has led me to accomplish every goal in my life sports wise, relationship wise, materialistic wise, and most importantly impact wise. It shaped my belief level to 1000% and boosted my inner-confidence through the roof. I think it is very important to treat everything in life as a win, no matter how big or small it may be. Once you get used to winning as a habit, you’ll never accept a loss. Things will just start to always go in your favor.\n\nJosh King Madrid: My dad would always tell me “One day you’re going to be 30 years old, and you’re going to look back and say either, “Wow, I’m so glad I did that” or “Wow, I wish I would have done that” but either way you will be 30, so do something today that will make you say “I’m glad I did that”. ”\n\nDelayed gratification is one of the biggest takeaways that I think has helped me reach success and anyone reading this should take this trait and master it. If you’re looking to buy something now, or get a job now, or go to school now instead of building a brand or business, saving your money, or taking a risk; then you will never be able to reach your full potential, ever. A lot of people go through “what ifs” because they make impulse decisions with the current moment and situation in mind instead of with the end goal & outcome in mind. Don’t do what you want right now, do what you need to do right now, even if it may be what you don’t want to do. Sacrifice and do things others currently won’t so one day you can have what others don’t. You must have a long term purpose and a goal that dominates your actions and decisions every single day."
    },
    {
        "url": "https://medium.com/@joshkingmadrid/the-day-my-life-changed-josh-king-madrid-exposed-66707605002d?source=user_profile---------29----------------",
        "title": "The Day My Life Changed — Josh King Madrid EXPOSED – Josh King Madrid –",
        "text": "Most people will not read this whole story. I have never shared this with anyone until this very moment in this picture. I’m going to leave the names out in here because it is a sensitive subject. In this picture, I was speaking at an e-commerce seminar/meet-up in Miami and I decided to share this following story\n\nWhen I was in school, I wanted to prove everyone wrong that doubted me and my ambitious goals and dreams.\n\nI had a lot of people who thought what I was doing with entrepreneurship was a big JOKE.\n\nSpecifically, I had a buddy who for some reason supported me with everything I did like basketball, academics, track and much more.\n\nWhen it came to starting my own business and building a brand he had the most doubt and negative comments towards what I was doing.\n\nI even made a bet with him that I would achieve all my MASSIVE goals that I said I would when he said I couldn’t and we filmed it and said after 3 months we’d look at it and see who was right. (I ended up achieving all of them)\n\nI completely forgot about it and then one day 5 months later I was scrolling thru my videos on my phone and found it and sent it to him. No reply.\n\nAnother 3–4 months pass since I’ve ever talked to him and I get a random text “Hey Josh, I’m super proud of what you been doing, and I’m sorry for always talking sh*t back in the day, keep it up, man”\n\nI contemplated replying since I originally felt hostile because of the negative energy I received months prior that I thought drove me to grind. Knowing my buddy for a few years I also know, just like myself that he LOVES to be right. So I commended him tremendously for reaching out to me. It takes a REAL man for him to do that. So after 12 hours of thinking, I finally replied to his text and let him know how much I appreciate him coming forward and congratulating me after 8+ months of my grind paying off.\n\nThen another 12 hours passed, about 24hrs after the original text, and I received a call from one of my old high school coaches, telling me “Josh, it’s “your buddy” man. He’s dead.. he got in a head on car accident last night”.\n\nMy heart froze. I felt horrible but I immediately looked for the positive situation that had to come from this negative.\n\nAll of a sudden “Proving people wrong or Doing it for the haters” didn’t feel good at all anymore.\n\nThat feeling of proving people wrong that I thought drove me to success was a bad feeling. Even though we had a disconnection, that was my boy and I would give up that “motive” 10 out of 10 times to have him back. I’ll miss him and I know he is in a better place now.\n\nI realized I don’t put out content, value, and work as hard as I do to prove people WRONG but to prove people RIGHT.\n\nTo stop the people who would’ve given up on themselves because of outside opinions or what they parents, teachers, and friends might say to discourage them, I do what I do, so I can inspire & educate those people to become the best they can for THEMSELVES & nobody else.\n\nI do it for the people who can’t, for the people who have permanently lost their opportunity…\n\nFor the people who just need a bit more belief in themselves.\n\nIt’s not about doing it to prove anybody WRONG.\n\nIt’s about doing it to PROVE YOURSELF RIGHT.\n\nThis is one of the biggest reasons I do what I do.\n\nSo I’m setting out on a mission to change the game forever:\n\nWhat Kevin Hart did to comedy…\n\nWhat Drake did to music…\n\nWhat Tony Robbins did to personal development…\n\nTeam Jet Set is doing to E-commerce and Internet Marketing…\n\nPlease share this, I want to leave a LEGACY with my mission in honor of my friend."
    },
    {
        "url": "https://medium.com/@joshkingmadrid/your-narcissistic-ego-will-make-you-millions-as-long-as-your-humble-fc92487b236f?source=user_profile---------30----------------",
        "title": "Your Narcissistic Ego Will Make You Millions As Long As You’re",
        "text": "Having a BIG EGO is THE BEST THING THAT MAY EVER HAPPEN TO YOU & it can also be the WORST THING IN THE WORLD & WILL RUIN YOUR LIFE. The only way to see success with an ego is to become a HUMBLE NARCISSIST (two seemingly oxymoronic traits)😂. Yet, you will have a high chance of achieving success if you can figure out to get these attributes to exist simultaneously. Narcissism and Ego give individuals the self-confidence to aim extremely high, but TRUE greatness requires more humble behavior. Here is the catch though, there is one thing you can’t EVER do…\n\nYou can not display your EGO to anybody else. Your ego must be kept 1000% to yourself. Nobody must ever know how highly you truly think of yourself. Nobody must see this side of you. The second you display your ego outside of yourself, you’re done.\n\nIt will destroy your business, your relationships, and your trust with your team, customers and/or clients.\n\nUse your self-induced EGO to boost your confidence, not your image. Nobody gives two flying f*cks about how you see yourself! The truth is 99.9% of people only care about themselves anyway, so if you are only promoting yourself to others, you will immediately lose others interest.\n\nThe problem is most people build their ego off of what other people perceive them to be. So when others tell them they are great and wealthy, they believe they are great and wealthy…\n\nBut.. when someone talks down, calls them ugly, and says they suck, they believe they are ugly, not worthy, and they suck, especially if it’s someone they perceive to be of high value like the hot girl at their school, an icon, the popular guy, their parents, best friends, the rich entrepreneur or whoever the HELL it is.\n\nThis is so WRONG in so many ways. The problem with your ego being factored off these factors at even the smallest of scale puts your confidence and abilities at risk of being in someone else’s control besides yourself. You must be in 1000% control of your thoughts, feelings, and actions if you want to become successful.\n\nI think so highly of myself that I don’t give a SH*T about what anyone thinks. I believe I’m the greatest, I don’t care if you are stronger than me, better looking than me, make more money than me, or am older and have more experience than me. One of my mentors once told me the following questions that changed my life, here is how our conversation went:\n\n“If you had the most attractive person you know call you ugly, would you be offended?\n\nYes, of course.\n\nIf you had a little green alien with one eyeball called you ugly, would you be offended?\n\nNo, not even the slightest bit.\n\nBut why? They said the same thing?\n\nYeah but one of them is super attractive and the other one is worthless.\n\n“That’s only YOUR personal perspective, you’re basing your emotions and confidence in two separate ways to twodifferent people saying the EXACT same thing based on YOUR PERCEIVED VALUE that you gave each individual. You’re giving them the POWER to determine how you feel and operate because you either perceive them to be more or less important than yourself.”\n\nThis changed everything for me. I started looking to value myself and appreciate myself more than anyone else.\n\nDon’t get me wrong though, I’m not ignorant to other people’s constructive criticism, opinions, or advice. I take it all in, I just positioned myself as an expert in my field that I know 99% of people are talking out of their ASS when talking to me. No matter their influence or credibility I think so much more highly of myself then their what their opinions are, now if it’s a FACT it is a different story. Seek that criticism, not to get yourself down, or beat yourself up, but to learn where you can grow. Accepting criticism and using it to improve has been an enormous learning process for me, and continues to be difficult but I strive every day to filter out the real constructive criticism versus cynical hate. This is where self-awareness comes in. You must know all your strengths and weaknesses. When your self-aware you know what criticism, advice, and opinions to take seriously and which ones to dump in the trash.\n\nYou don’t want to be the guy or girl who always thinks they are right because of prior success they achieved, this leads people to think that the people who hate on them may be hating off of pure jealousy; but, the reality is sometimes something that you are doing may actually cause them to perceive you in a different way that may resonate negatively with them. Trust me, I know this may not be your intention but its still important to know and learn their (Your haters)perspective because you may be able to tweak your approach which will allow you to win and influence them, allowing you to grow from that.\n\nIf you think your work is perfect, or worse, if you seek others out to affirm that belief… you’re not going to grow very quickly. I always know that I’m moving forward when I take a piece of feedback and use it as motivation to become better. For most people it is the other way, their ego is based off of what other people think of them and how they are viewed by others.\n\nInside my head, my ego and narcissism are so freakin’ high that it’s allowed me to have an insane amount of confidence in my actions allowing me to execute in my business and operate at the highest level.\n\nConfidence is one of the major key factors I believe allow someone to really succeed and fly because it removes self-doubt and skepitism when people decide grind and it replaces them with BELIEF and HUNGER. I see too many people scared to really go all in because their confidence is shattered and crumbled, due to the fact their inner-ego is too small and their outer ego is massive but corrupted.\n\nFlip that way of thinking, think so highly of yourself and use that to boost your confidence and use that confidence to make powerful decisions inside of your life and business. Then its as simple as executing with power to get things done.\n\nDon’t let what other people think of you form your ego. Just remember you want an INNER EGO, not outer ego. Remember your outer-ego in business is like dust in your eye, if someone says something that you don’t like, its going to lower your clarity and you won’t be see which means you will not able to execute what you are trying to get done.\n\nAt the end of the day you can’t deny that narcissism gets results look at Mark Zuckerberg, Steve Jobs, Donald Trump; and loved or hated they have results in their field. I promise you can ACTUALLY make an impact and leave a legacy IF you choose to; You have to be able to be totally self-involved and egotistical to be able to boost your beliefs so high that you are eager to push your vision and share your mission with the world, just remember what Kendrick said, REMAIN HUMBLE.😉"
    },
    {
        "url": "https://medium.com/@joshkingmadrid/this-will-disrupt-the-e-commerce-software-and-education-industry-13718db7e282?source=user_profile---------31----------------",
        "title": "This Will Disrupt The E-commerce Software and Education Industry",
        "text": "The number one question that I’ve been getting asked by literally thousands of people; kids, teens, parents, followers, family, even my old teachers, the last few months is “What is Excommerce?”🤔\n\nLets get one thing to straight, it is not a course… This is a full blown online e-commerce SAAS & marketing company with training.\n\nTo be technical.. ( Software as a service (SaaS) is a software distribution model in which a company hosts applications, tools, softwares, and systems and makes them available to customers over the Internet.)\n\nThis is why Excommerce is completely different and nothing like anything else in the market.\n\nHands down.\n\nWhat we would like to say is essentially Excommerce is your “one stop shop for everything Ecommerce, Dropshipping, and Internet Marketing Related”.\n\nNow… how do you know this is legitimate right?\n\nExcommerce the company is ran by a CEO who has over 25 years in business experience, has founded 2 multi-million dollars commerce companies and he has decided to hire and partner with some of the top e-commerce and marketing experts he could find online.\n\nWhich happens to be ME… (if you didn’t know who is writing this, it’s Josh King Madrid)\n\nas well as Thaddeus Strickland, Samir Chibane, Jeraun Richards, Jay Tee Rodriguez, and Juan Valdez.\n\nJust so you know every single one of us has made and is currently making over 6 FIGURES in the internet marketing & e-commerce industry.\n\nBut… this is all the boring stuff. You don’t care about any of that. 😑\n\nYou want to know WHY Excommerce will give you the ability to make a lot of MONEY. 💰💰💰\n\nOf course I am, otherwise you wouldn’t be reading this.\n\nSo I’ll get into it now… 😎\n\nSo starting off, I want to be BRUTALLY HONEST.\n\nMOST dropshipping stores are unsuccessful and make very little, if any, money.\n\nNot because it’s hard, it’s actually very simple. But because MOST of the people giving you information suck, MOST courses suck & are outdated, & MOST of the information on the internet is bluntly just WRONG, on top of that MOST “gurus” hold back all the REAL secrets that would help you scale to 5 & 6 figure months anyways.\n\nSo if you do know anyone who understands e-commerce and online marketing to the tee, in REAL LIFE who has the time and patience to teach you, it will be extremely difficult to understand the strategies that allow people to become successful & make more money than they could ever imagine.\n\nThe reality is you could go online and search dropshipping, but if you are anything like me or most people you will most likely be left confused with misleading information from sources that are really not credible; people who fake their results and income claims, have no sort of financial or time freedom lifestyle to prove their “self-proclaimed success”, or have any students with any REAL success stories & I’m not talking about making a couple bucks a few times; we already help people do that for free on our social media, I’m talking about real freaking results like 4,5, & 6 figure months online. 💰💰💰\n\n& those types of results are exactly what we plan on doing for people with Excommerce.\n\nHow does that sound? Too good to be true? Well it get’s better…\n\nIf your lost or not getting the results you want right now, don’t worry. Even I thought that these industries were confusing at first. Once I understood the strategies that allow me to successfully launch any online business after doing 7 days of 18 hour research sessions week after week, filtering out the real from the BS to become an online beast. I realized how amazing it would be to create a hub where you can go and literally learn it all at once and in the correct order. Excommerce is a company where it does just about all of the work for you, it will provide all the systems, tools, resources, case studies, softwares, trainings, and even copy/paste templates needed to really get results and fast. We want people to be able to actually WIN.\n\nNow, I’m a big believer in finding someone who has results and doing what they do to get what they get, here is the only flaw with this though…\n\nA lot of people are actually like this, so they go online and look for people who have crazy results and then they buy some sort of course to try to get whoever is selling it’s lifestyle. They tend to look for the easy way to make money instead of actually building themselves to quality individuals first. (The same reason why we teach credit and have a free mentorship program, it will help you long-term, not just short-term)\n\nSo what happens next? Well you guys go online and start looking for information, and you will obviously want to skip the information from source B and go straight to the person who already has what you want (Source A). BUT HERE IS THE MAJOR KEY. The only thing wrong with that is you guys only see one perspective. The problem with learning from one of these sellers “courses” is there teaching you one system that worked for them one time with one product during a time of one trend using only one strategy BUT the thing is NONE of that information may be #1 still relevant at all and #2 more importantly it may not be relevant to you. The key word in that sentance would be “one” because these “gurus” think that one thing that worked for them will work for everyone else so now all of a sudden they are qualified to sell you their “one secret”.\n\nThe reality is you guys need to find what works for your situation. Which is why we launched Excommerce, there is multiple trainings showing different avenues of making money and we even give the opportunity for you to make money with the Excommerce company. We wanted to KILL that “one” problem and truly create something that can work in every situation.\n\nAt this point, you’re probably liking the idea of Excommerce but thinking…\n\n“How much does this thing going to cost me up-front?🤔🤔🤔”\n\nWell, it really does get better…\n\nSo we realized that a BIG problem that would cross somebody’s mind is that they don’t have money up-front to afford something as great as this. Most people can’t even afford these guru courses. How can you expect to make money if you can’t even afford their courses? 🤦‍♂️\n\nSo we decided the solution for Excommerce is that we are going to give you the opportunity to make money before you even have to make your first investment with Excommerce. Yup, we are offering a 10 day free trial to unlock our VIP advanced Shopify training and our goal is to MAKE YOU MONEY within 10 days before you have to pay $37 month.\n\nThe reason we are doing this? Simple.\n\nWe value your trust, results, and word of mouth more than any monetary value.\n\nOur company Excommerce will never make money if we can’t help our community make money.\n\nWe are going to show you once you join Excommerce how to become a partner with us if you qualify and unlock over 5 NEW sources of income outside of drop shipping without selling anyone, going door to door, making phone calls, recruiting or any of that BS. We call this your Marketing Budget.\n\nWe want you to use this money to scale your e-commerce business marketing which will intern result in more sales, which means MORE PROFIT.\n\nBeing able to make money on the side will allow you to grow your ecommerce business exponentially.\n\nDid I mention this is not a course, there is NOT one thing in this system (like most courses) that cost $2000, $1500, $1000 or whoever much people charge.\n\nWe want you to CASH OUT at the Bank, not BREAK the Bank.\n\nThis business model is truly unheard of and will without a doubt change tens of thousands of lives. We have over 5,000 people inside the pre-launch groups and the company has not even launched yet, which is the CRAZY part.\n\nNow… I can go on ALL DAY about Excommerce, but if you really want all the exclusive inside juicy information on it.\n\nMake sure to watch this ENTIRE video by the way, if you’re not going to watch the whole video, then DON’T click👆."
    },
    {
        "url": "https://medium.com/@joshkingmadrid/what-i-learned-from-everyones-first-friend-e8bcd7ed3e74?source=user_profile---------32----------------",
        "title": "What I Learned From Everyones’ “First Friend” , You Know Him As MYSPACE TOM — Josh King Madrid &…",
        "text": "This weekend I had the opportunity to hangout with someone very important to the internet today, at an Influencer & Entrepreneur Party that I co-hosted, this “someone” is most commonly known by many as MySpace Tom. Tom was the founder of the very first popular social media platform called Myspace. When people talk about Myspace, they tend to remember two things: the often hilarious status updates they shared as teenagers, and the face of Tom, the first friend everyone had on Myspace. What most people don’t know about the platform and its founder though is that the popular social networking site, Myspace, was sold in 2005 for a startling $580 million. It was also the largest social networking site in the world between 2005 and 2008, and even surpassed Google as the most visited website in the US in June, 2006.\n\nI remember all the cool kids at my school were on this platform so I decided to hop on and become cool too, unfortunately it didn’t last long though because my parents didn’t let me use myspace and grounded the hell out of me when they found out I made a myspace account behind their back.\n\nSo unfortunately I didn’t get to use Myspace long, but my parents did encourage me to make a Facebook though, which back then was known as the “old person” platform; but since I used it so early it allowed me to get the jump on Facebook and learn how to make thousands on it in middle school.\n\n(But… that’s a story for another time though).\n\nAnyways, while I was with Tom, we talked about the future of social media, the things it really takes to build an online media platform, branding, team work and more, I realized how much real entrepreneurs have in common with each other despite all the dissimilarities like age, occupations, industries, and background.\n\nThe reality is, if you want to become a “BIG BOSS” that makes BIG money you must do these 3 THINGS, that I learned when I was speaking to Tom.\n\nI asked Tom, in the process of launching Myspace if he worked all day and if he did, how much sleep was he normally getting per day. He expressed that for the first 3 years of building this start-up from an idea to a multi-million (evaluated at billions) business that he only sleep 2–3 hours a night every day. He worked so long and hard at his craft that after 3 years he went from having a “baby face” at 25 years old to looking like he was in his mid-30s or older.\n\nThis is obviously insane and unattainable to the average person, but this explains why he produced results that were no where near average. Now, I’m not endorsing or telling everybody that they should or even could do this. It take’s a special type of person to do this but, you can’t expect insane superhuman results without insane superhuman work ethic and routines. You know what they say… Work hard for 4 years and have fun the rest of your life or have fun for 4 years and work hard the rest of your life.\n\nWhich is actually just what Myspace Tom is doing… He been spending the last few years of his time traveling the world and having fun. You can learn more about that here.\n\nThe easiest way to guarantee success: is to find multiple successful business models, find what people hate and dislike about them, fix these problems, and then merge it into one super business model. This is the strategy Tom used on Myspace, which is also the same exact strategy I personally have used for all my businesses in the past, it is by far one of the most unknown fool-proof ways to dominate an industry.\n\nNot many people know about this yet, but Tom was telling me about his new social media platform that he plans on launching with this exact strategy.\n\nI have no doubt in my mind, that it will be one of the next big successful platforms.\n\nNow, I can’t give too much details on this platform but, what I will tell you guys is that Tom has been smart enough with this new platform to take all the complaints from all the current social media and content channels and is using them to build a roadmap allowing him to go on to destroy these issues and merge them into one social media platform, which will create a very lucrative platform for the users.\n\nHe actually did this exact same thing with Myspace. At the time there were many other social media platforms out but all of these didn’t have enough “spark” to take it to the next level. Tom found where these others channels were slacking and used that feedback to create Myspace, which allowed Myspace to catch massive momentum and form into one of the original social media platforms we know about today.\n\nSince Day 1, Tom has worked with a team to turn the Myspace vision into a multi-million dollar company. He didn’t do it all by himself and he didn’t try to take on task he knew he wasn’t specialized or qualified to do, but rather hired or partnered with individuals who were skilled enough to create, develop, and execute his mastermind ideas into perfection.\n\nIt’s not possible to scale by yourself so he had other people on his team have worked in senior positions in other big businesses. Your partners are the most important things. If you don\u0092t have good partners, it will not work. Point blank. You need to have similar sensibilities and people you trust to fill in your weaknesses with strengths that they have.\n\nTom even went into asking us about our team and then went on to give us tips on how to expand Team Jet Set by giving us some insight on branding on social media using video content and youtube.\n\nI’m glad I got to connect to Tom and he was able to make it to our event, I’m looking forward to re-connecting with him and the future and becoming not only one of the first users on his new platform, but one of the first users to learn how to master marketing and monetization on it.\n\nFollow Tom on Facebook and Instagram to stay current with his activities."
    }
]