[
    {
        "url": "https://humanizing.tech/tool-31-resources-to-learn-ai-deep-learning-from-beginner-to-advanced-ed41b3fc1ae?source=tag_archive---------0----------------", 
        "text": "I’ve spent the last few weeks learning, well, about deep learning. I’ve parsed through the internet, read a ton, and tried to get a sense of where we are as a community. I wanted to put together a resource for someone who’s interested in getting up to speed as quickly as possible with the best of the best resources that I can find, from doing research, looking for funding, and learning about the various open-source frameworks to following along with excellent tutorials.\n\nBelow is a google spreadsheet that you can view and comment on, but not edit (at least not yet). If you have some other items you think are worthwhile to add to this, let me know and maybe we can move this to github, enable pull requests, etc.\n\nNow, I know there are likely tons of resources out there and many I likely have missed. I’d like to keep the list short so if you have one you think is better and could replace one of the links I already have, I’d rather do that than create a massive list of links that nobody will ever read. The goal is to get the best, right link, rather than all the links.\n\nThat said, I do still want to make it accessible to folks who’ve never heard of Github because I think it’s important to “onboard” someone who’s never heard of Deep Learning, and show them that it’s not as complex as they might think.\n\nBelow is a link to the Google Sheets document containing the various books, articles, and how-to posts for novices to experts alike. Feel free to add in your own favorite links using the same categorization format.", 
        "title": "Tool: 31 Resources to Learn AI & Deep Learning, From Beginner to Advanced"
    }, 
    {
        "url": "https://medium.com/@StephenMartindale/alphago-vs-lee-se-dol-ac929c939075?source=tag_archive---------1----------------", 
        "text": "In the wee hours of this morning, I watched Google DeepMind’s AlphaGo programme defeat Lee Se-Dol (9 dan professional) in the first game of a five game match that will continue for the rest of this week. They played on a full-sized (19 by 19) board, AlphaGo played white and Lee Se-Dol paid komi. The field was entirely level, the game entirely fair. This simply wasn’t supposed to happen during my lifetime!\n\nWhen I first encountered the game in 2007, my friend and fellow programmer promoted it as a game that bots simply couldn’t play. At that time, GNU Go was available but barely stronger than an improving double-digit kyu journeyman like myself — I soon learned to defeat it. A few bots exploited Monte Carlo Tree Search (MCTS) and they could achieve low single-digit kyu strength on a regular desktop computer or amateur dan strength on exceptional hardware but that was about all.\n\nEveryone knew that MCTS was the way forward, that heuristics used in the random Monte Carlo simulations would improve with time, and that the inexorable increase in exploitable computational power would permit an ever-increasing number of simulations to be run. Everyone knew that even the professionals would fall, one day. That day was supposed to be decades away and the DeepMind team proved everyone wrong.\n\nThis morning, the outcome of the game was far from the only impressive feat that DeepMind’s programme demonstrated: the human-like nature of its moves and the mature management of the clock were a wonder to behold, as was the calm and steadfast way in which it handled Lee Se-dol’s cunning but unorthodox opening that seemed like an attempt to deviate from more common and well-known openings that would exist in databases and opening books that the artificial intelligence was surely using.\n\nI was strangely sad when I saw Lee throw in a prisoner to indicate his resignation, this morning. In that instant, something ineffable changed in a way that can never be reversed. I will continue to watch in fascination as this match unfolds but, even if Lee wins the four remaining games, history was made this morning and I am very happy to have watched it as it happened.", 
        "title": "AlphaGo vs. Lee Se-dol – Stephen Martindale –"
    }
]