[
    {
        "url": "https://blog.hyperverge.co/how-we-raised-a-million-dollars-in-seed-funding-part-ii-9a2dc325b292?source=tag_archive---------0----------------", 
        "text": "This is the second part in a three-part series on our experience with fundraising. Read part I here\n\nNew York: Unplanning of THE Plan\n\nVignesh and I boarded a flight from Chennai to Delhi, from where we would fly nonstop to New York. We had prepared tirelessly for this trip, reaching out to people, setting up meetings, creating a financial model for different scenarios, business cards, demo video, presentation and a lot of other things. On the flight, we were served surprisingly good food and spent most of our time sleeping. We took some time out to check the financial model (already in its 5th version) and saved a new version 6.0.\n\nWe reached New York in the early hours of the day and headed over to Ayush’s, who was hosting us. Our plan was to spend the day there before heading to Pittsburgh in the evening. It was at New York that we had the first of our many meetings in the US. The meeting was with Sharat Potharaju, founder and CEO of Mobstac. Sharat is an IIT Madras alumnus (batch of 2006) who has raised multiple rounds of funding and had recently moved to New York. We showed Sharat the work we had done and asked him what he thought about it. Sharat’s advice was simple:\n\nAt this point, we had mixed feelings. We were feeling a little disappointed, knowing that all the work done by the team for the Kickstarter campaign was going down the drain. More importantly though, we were very happy, because for the first time, someone outside our team was truly excited about this idea. When we asked Sharat how much money we would need to raise, he suggested raising a minimum of $300k immediately. He also suggested that we should go for a fresh round of funding soon. This was the first time someone had told us that we needed so much money. Most of our technology work did not cost us anything as it was done at IIT Madras with the support of Professors and Incubation cell. All the other expenses that we had incurred till date (our travel cost, internship stipends, design, etc.) had never exceeded $10,000. Sharat very soon realized that we had no idea of what it meant to raise money from an investor. The next half an hour was spent learning about the basics — blurb, introductions, angel deck, financial instruments, etc. We stayed back in the coffee shop after Sharat left, looked at each other and thought about how the very first meeting on the first day in US had absolutely shaken everything we had planned for. We had dinner with Ayush and took a Megabus to Pittsburg. Lost in thoughts and gazing at the sky through the transparent roof, we dozed off.\n\nWe were at Pittsburgh for just one day and our plan was to meet some of the Professors from the Robotics Institute at Carnegie Mellon University. Arun and Shivram were hosting us at Pittsburgh. A professor at CMU who was an IIT Madras Alumnus had written to a few relevant professors on our behalf, requesting some of their time to meet with us. However, since we had planned the entire trip on very short notice, we were unable to get any responses. With no prior appointments with professors, we took our chances and started visiting the labs at the Institute early in the day. We met Natasha Kholgade and a few other researchers who were in the lab. Though our first few meetings started off well, we were still not able to get through to any professor. We were terribly jet-lagged and we settled in the cafeteria wondering what to do. Just to feel busy, I remember working on some low priority work (activating calls to India, sending out a few emails) and eventually dozing off only to wake up and find Vignesh laughing at me.\n\nWe were at Pittsburgh on a Saturday, the only working day we had. If we missed out on that day, our visit to Pittsburgh would not have been a useful one. All through the day while talking to the researchers, we had heard about Prof. Martial Herbert, the Director of Robotics Institute and the amazing work he had done. Unfortunately for us, there was no one who could introduce us to him.\n\nAt Lema Labs (my previous startup) there were numerous instances when meeting requests that would not go through the entire day ended up going through at the last hour. Maybe, it was the short nap, but something struck us. We decided that we had waited enough and we needed to make our own luck. We moved out of the cafeteria and decided to contact the Professor on our own. “What was the worst that could happen?”, we wondered. We went back to the lab, sat outside his office and started writing him an email. In a few minutes, he came out and looked at us waiting outside his office asked what we were doing there. We told him we that we were from IIT Madras and that we were writing him an email! That worked! He spent half an hour with us, talking about his work and asking us about our interests. With that boosting our confidence, we also met Prof. Yaser Sheikh, who does amazing work in the space of video processing.\n\nIt was a great icebreaker. It set the tone for the rest of the days that followed. While it is great to get introductions, pre-plan things and get work done, you need to be able to make the best of what you have. While these meetings with Professors did not help us in our fund-raising effort, it took away all inhibitions that we had about meeting people in US.\n\nWe spent the rest of the weekend learning WordPress to put together a decent new website for HyperVerge, which was something Sharat emphasised the importance of.\n\nAfter Pittsburgh, we headed East to Boston, via New York City. Our reasons when we originally planned our trip for visiting Boston were twofold — we wanted to meet Mr. Gururaj Deshpande, an IIT Madras Alumnus, as well as meet different friends of ours who were studying at MIT, for our Kickstarter campaign. When we reached Boston, unfortunately for us, Mr. Deshpande was busy. At this point, we were also not doing the Kickstarter campaign. With no solid reason for being in Boston, we had to figure out a way to make the most use of the trip. Prior to arriving in Boston, we had got an introduction to Mr. Marcel Singleton through our adviser in India and to Prof. Ramesh Raskar through Raj of Deshpande Foundation.\n\nWe had a day to spend at Boston before flying out to San Francisco, and I spent it trying my best to reach out and set up some meetings. Marcel gave us a very good idea about the machine vision market, the competition and about what it would take to get a contract there. We also met Krishna K Gupta from Romulus Capital. Our pitch to Krishna was our first pitch to any investor. I distinctly remember our pitch being a very confusing one. We also met/had calls with Mr. Scheffelaar and Amit Akkad. Most of these meetings did not play a direct role in the HyperVerge Fundraising Story. They were however very important as we were pitching HyperVerge to set of diverse and very smart people. Our pitch was getting cleaner and better with every attempt.\n\nProf. Ramesh Raskar is one the top innovators in the field of computer vision. He heads the Camera Culture Group at MIT Media Labs. His work on Femtocamera, Netra, CORNAR and many other innovations has created waves around the world. We knew of him and his work and Raj had sent an introductory email about us to him. However, it had received no response. Our day was ending in Boston and as always, we were in a waiting area at MIT Media Labs wondering what to do. We finally decided that the day was done, and nothing more was possible. Just before leaving, we thought it might be a good idea to tell Prof. Raskar that it was nice visiting MIT and that we would definitely meet him next time we come to Boston. As we were wrapping up, we got a reply from him — “Where are you guys?”, he asked. I replied immediately, “Outside your lab!”. We got 10 mins from him. He was talking fast; talking faster and thinking much faster than I have seen most people do. He left us with a promise to meet us in the Bay Area and gave us feedback on our pitch, saying that it needed a lot of work. We were finding it difficult to believe that we actually met him.\n\nSan Francisco — Entrepreneurship is in the air\n\nWe landed at SFO and Manish Kulkarni (my cousin brother) picked us up. He and Deepali were hosting us in the Bay Area. On the ride home, he asked us a lot of questions.\n\nI could not answer a single one of these questions well. It was a big wake up call — we were in the Bay Area! It was very different from most other places I have been to. There is a strong culture of entrepreneurship. People are a lot more supportive but they are also extremely savvy. No one cares or is amazed by the fact that we have come all the way from India, and are starting a company. Start-ups are everywhere. They have been blossoming for many years here. They like you if you can answer these questions.\n\nThat night over dinner, I was speaking to our hosts about Lema Labs. I was discussing about our growth plans, how we hire people, how we employ unique training methods and more. After dinner, I remember Vignesh coming up to me and telling me that my HyperVerge pitch lacked the passion that I had when I talk about Lema Labs. I did not know what to say to this, but I thought about it. I too felt that something was missing. In spite of all the effort that we had put in, maybe, I myself did not believe that we had something really valuable and that we were onto something big. Our first day in San Francisco shook all the confidence that I came here with. We went to sleep hoping that the next day would be better.\n\nNow that we were in the Bay Area, we started moving fast. Our first meeting was with Seshan Rammohan of the IIT Madras Entrepreneurship Forum (IITMEF). He took the responsibility of setting up meetings with relevant members of alumni community in the Bay Area who could mentor us. We also got in touch with Raj Desai (TiE) and many seniors — Sharadh (Amazon) and Jyotindra (ex- YCombinator incubatee). While Seshan sir was setting up a series of meetings with IIT Madras Alumni, we started attending a few startup events.\n\nDuring one such event, we saw pitches from 10 startups from India who were taken to the Bay Area by their incubator. Each of these startups had incredible pitches. Many established angels and veterans such as Raju Reddy were present. Despite these amazing pitches, it was clear that most of them did not have any great/unique technology. Most of their ideas did not seem interesting until they started putting forth their numbers and traction. This event had a very profound effect on me. I remember listening to every pitch with and feeling extremely uneasy. I really wanted to shout out to the world that we had this incredible technology, something that would take most teams few years to understand and build. I wanted everyone to know of what we are made of. I wanted us to standout. I held my own and stayed calm. As soon as the pitches got over, Vignesh and I met every important person there. We spoke passionately about HyperVerge. We told people about the good academic and industrial consultancy work we had done in the past. While everyone liked us as people, they were not very excited about HyperVerge. We knew that while our sincerity and passion was being communicated, our pitch was not working.\n\nAt this event, we met Sohag and Dipty, who were very kind to organize a wine and cheese party for us at their house on the Sunday afternoon. They liked us and wanted to support us by helping us raise some money. Every free hour that we had before that lunch was spent working on the website, the presentation and so many other things that urgently needed to be done.\n\nManish dada dropped us to their house. I practiced my pitch and we went in. We took everyone through our presentation, spoke about our previous assignments, spoke about the new product, answered most questions they asked, but we could see that our pitch had not worked. We could see people were not interested. If at all they would have given us any money, it would have been as charity and not because they saw a great future in HyperVerge. We came home dejected.\n\nAs always, Vignesh and I had a conversation before going to the bed. We discussed dropping the new app idea from the pitch and just talking about the work we had done in the past. We thought we should just focus on raising a minimal amount of money (USD 50–100k) and that we might have to wait for our chance and come to the Bay Area again better prepared.\n\nWe started our first of many meetings with alumni from the IITMEF with G Venkat Sir. We spoke about all the work we had done so far and about the app we wanted to build. Even before we could finish, we could see a spark in his eyes. He told us that we were on to something that was much larger than we had imagined. He gave us examples of many companies which have built amazing technology platforms that empower thousands of developers and enterprises. He told us about how HyperVerge can be the platform everyone comes to, when they need to process images and videos. He was the first person who could see what we could do and much beyond that. He told us that it will take a lot of effort, but we will be able to raise money through top VC firms.\n\nYet again, a meeting had shaken us completely. That evening, the Samsung team reached out with a requirement — they wanted a scene recognition module. At this point, that was the only working technology module that we had! It was an amazing co-incidence.\n\nI could not sleep that night. A rush of excitement and eagerness to execute helped me stay up and I worked on our presentation the whole night. Simultaneously, Vignesh started guiding our team in India to build a demo for one of the first scene recognition engines the world would ever see.\n\nPraveen started working on analysing patents, as it was very important to highlight the uniqueness of the work we were doing. On the other side, we were supposed to represent India in the finals of UAV the same month. Kishore made sure he insulated us from everything that was going on in India. He took over complete responsibility of the computer vision subsystem for UAV, spending sleepless nights trying to deliver what we had promised without any support from most of us.\n\nNext day, through Seshan sir’s introduction, we met Dilip Venkatachari and presented our new pitch. Dilip is an industry veteran who himself has been an entrepreneur, a Director at Google and is currently a VP at McKinsey.\n\nHe said “I can see it. It is no-brainer. You guys will not have any problems raising money. Anyone who is smart will want to invest in HyperVerge!”\n\nOur journey so far had taken us to extreme lows where we were starting to believe that our ideas did not seem to excite anyone except us. It only took few incredible conversations for that to change. And it changed in a huge way. Finally, our pitch started working. More importantly, we had found a story, a vision that we ourselves could honestly believe in.", 
        "title": "How we raised a million dollars in seed funding — Part II"
    }
]