[
    {
        "url": "https://medium.com/udacity/interested-inmachine-learning-20c98c1b4b72?source=tag_archive---------0----------------", 
        "text": "Interested in Machine Learning? Then we invite you to check out this very friendly introduction we made at Udacity!\n\nWant to learn more? There are actually 19 videos included in this playlist, covering topics like Linear Regression, Neural Networks, Hierarchical Clustering, and more.\n\nReally got the Machine Learning fever? Then consider enrolling in our Machine Learning Nanodegree program. It’s the best way to learn everything you need to know to become a successful Machine Learning Engineer!\n\nHere’s a recent student review that was posted on our site:\n\nWe hope to see you in our classroom soon, but in the meantime, please enjoy the videos we’ve provided!", 
        "title": "Interested in Machine Learning? – Udacity Inc –"
    }, 
    {
        "url": "https://medium.com/lux-capital/democratizing-ai-doubling-down-on-clarifai-363dacda4ecb?source=tag_archive---------1----------------", 
        "text": "Machine learning, AI, Conv Nets, Deep Learning, and Neural Nets … all rapidly maturing Artificial Intelligence technologies that have simultaneously become household jargon in the Valley.\n\nTesla’s self driving car, Amazon Alexa, Google Search, Facebook tag recommendations, Microsoft Cortana, and Apple Siri … all novel products leveraging the above mentioned AI technologies, developed by large tech mainstays, and increasingly popular nation wide.\n\nTechnocrati cocktail banter is developed and largely kept in-house by large technology incumbents to develop new products and disrupt adjacent industries. We’re witnessing first hand the world bifurcating, the haves and the have-nots. That said, historically a rapid rise and maturation of a new technology germinates within the the confines of a select few labs, institutions, social classes, and corporations before hitting a critical juncture when, via technological or economic means, it rapidly democratizes and is made available to everyone.\n\nClarifai’s growing product suite around developer centric AI tools are leading exactly that charge: democratizing the Artificial Intelligence revolution. 18 months ago when we first invested alongside Union Square Ventures in the company’s Series A, Clarifai had built a best in class image classification API catapulted by founder and CEO Matt Zeiler’s PhD work at NYU. There he had single handedly taken home the ImageNet championship — the Super Bowl of image recognition. At the time we openly admitted we weren’t sure what future products would look like, didn’t know which industries, platforms, and verticals to explore, and had an open and long mind when it came to future business model and the economics behind the business.\n\nFlash forward to today and it’s become increasingly clear just how impactful the AI revolution is and will continue to be. Written without hyperbole: no single industry or vertical will remain untouched, and those that don’t adopt will almost inevitably fall prey to technological disruption. This highlights the importance for those outside the Valley elite to have access to the rapidly evolving AI stack. Today Clarifai not only hosts a static API that tags thousands of images and videos with human level accuracy, but now empowers anyone from a wedding photographer to a large retail company to a sail boat enthusiast (hat tip: USV’s Albert Wenger) to easily access and build products employing Google level AI with drag and drop ease of use.\n\nIt’s still early innings, and there’s lots of work to do — but today we’re proud to announce Clarifai’s $30M Series B led by Menlo Ventures, with an outsized doubling down from Lux. We’re more than ever excited about the fundamental role AI will play across all industries and proud to back Matt and the team at Clarifai to continue enabling the democratization of AI for the masses. If you’re interested to be part of the journey the team is actively growing and hiring. If you’re outside the walls of the technology elite, but have product ideas that leverage cutting edge AI and deep learning — we’re thrilled to partner with Clarifai to empower you to realize your vision.", 
        "title": "Democratizing AI: Doubling Down on Clarifai – Lux Capital –"
    }
]