[
    {
        "url": "https://medium.com/@ilhamadun/deep-learning-pengantar-a9cbcf7855b2?source=tag_archive---------0----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "Deep Learning — Pengantar – Ilham Imaduddin –"
    }, 
    {
        "url": "https://medium.com/@clayostrom/this-article-was-making-me-wonder-similar-things-how-do-we-define-creativity-2b5b34a1ebfc?source=tag_archive---------1----------------", 
        "text": "This article was making me wonder similar things — how do we define creativity? Are the results of these experiments truly creative or just formulaic emulation?\n\nThe truth is that most of what humans create, and what we’d probably deem “creative”, are also just formulaic emulations based on inputs we’ve gathered.\n\nWhat I think you’re getting at is more on the “originality” side of creativity — a true break-through that’s a new combination of inputs from a variety of unrelated sources.\n\nThat’s probably an accurate bar, but it’s certainly not the bar we hold humans to when we apply the label of “creativity” or “artistic”.\n\nIt’ll be interesting to think about not just the advances of these specialized learning algorithms independently, but what happens when you start to merge them together.\n\nWill the self-driving car not just get you to your destination safely, but suggest a slight detour to see a beautiful rock formation?\n\nOr will the painting emulator develop a new style focused on visually expressing the poetry of Bob Dylan?\n\nAs we continue to work on developing computers that can emulate aspects of human behavior, it definitely opens up a lot of questions around how we actually think about ourselves.", 
        "title": "This article was making me wonder similar things — how do we define creativity?"
    }, 
    {
        "url": "https://medium.com/@robehill/putting-myself-out-there-9c581189960?source=tag_archive---------2----------------", 
        "text": "One way to experience growth as a person, is putting yourself out there, and being open to new experiences and challenges. The past month for me has been all about growth as I continue to explore new opportunities in my career.\n\nI’ve had the opportunity to develop and present training content on giving and receiving feedback. Over the past month my colleagues and I provided three training sessions to our staff.\n\nAll of the trainings brought with them some nervousness on my part. This mostly comes from my lack of experience with speaking in public and presenting training content to a large group in a way that resonates.\n\nAll in all the trainings went well. We invited attendees to complete surveys about the quality of the training content and how the facilitators presented it. Most of the feedback has been quite pleasant. Our goal was to create value for everyone by providing them with new skills that they could use.\n\nThe biggest lesson that I learned during this process was that storytelling helps people to connect with you as a presenter and the content. I called on different experiences from my past and allowed myself to be vulnerable by telling stories about times I’ve failed and what I learned from it.\n\nI also learned that stepping into the arena is not easy. The spotlight was on me and I needed to deliver. I needed to create valuable content that people found useful, and I needed to connect with my audience and engage them in the training.\n\nBecoming a trainer and presenter was a vision of mine when I was making my career transition back in April of 2016. To become great at it, I need to continue to work at it — which means continuing to put myself out there and making the most of opportunities.", 
        "title": "Putting myself out there – Rob Hill –"
    }
]