[
    {
        "url": "https://medium.com/@sunspirit/you-ask-me-where-i-am-so-far-away-6490956abab4?source=tag_archive---------0----------------", 
        "text": "You ask me where I am, so far away.\n\nI’ve been in a maze of tunnels.\n\nThe tunnels that the old man designed.\n\nThe ones he designed for you.\n\nDevised. To rob you, of yourself.\n\nNo winners. No grace. No wits.\n\nDark passages created for the inventor of clones.\n\nWith cruel delight, took your radiance:\n\nSet alight with the fuel of spite.\n\nPleasing himself “generously” with all disease.\n\nGet out! Get out! Get out!\n\nGo! Into the tunnels, be a man.\n\nI built them; All for you. Go!\n\nWILL you find your way out!?\n\nI challenge you! <Smirk of Smug- You WILL not>.\n\nThese are the days of the Jackal.\n\nShackles, and, your feet are his.\n\nYou bear their weight in supplication.\n\nTo be crushed by the wars he conscripted you to;\n\nYou his soldier and, his enemy.\n\nYou alighted. Again. Again. Again.\n\nHe pushed you back in.\n\nThat way, is the wrong way, he snarls.\n\nYou know those tunnels; Like the back of your own hands.\n\nThe same hands with which you pull me close;\n\nYou push me in.\n\nOne else has to know what it feels like.\n\nOne else has to know what it feels like.\n\nIt has been so.\n\nAsk me. Where I am.\n\nYou know where I am.\n\nYou pushed me there.\n\nThe tunnels of your dungeons.\n\nThere! Where you lost your heart of hearts.\n\nI am in the tunnels. You put me there.\n\nI know them well; Better than you.\n\nPush me. One time. Again.\n\nI’ll design my own. No lessons here.\n\nI only ever sought for me.\n\nYou cannot live on that breath.\n\nBecause. I am. NOT. Broken.\n\nBeg from the master cloner of decapitation.\n\nStill, it ESCAPES me.\n\nI SEEK it. I SEEK it. I SEEK it.\n\nHead to the ground. Pride in prostration.\n\nAre the blankets with holes of their darkness.\n\nYou showed me his tunnels, your dungeons.\n\nPush me again. And.\n\nAway. Is where I stand.\n\nCrumbling into the ground with jester and jailer.\n\nI stand in the warm embrace of the sun.\n\nSo now I ask YOU-", 
        "title": "You ask me where I am, so far away. – SunSpirit –"
    }, 
    {
        "url": "https://medium.com/@icyoverflow/great-article-2dd15367bc05?source=tag_archive---------1----------------", 
        "text": "I’ve been there, still working it out, despite the fact that I still am a hobbyist coder. I tend to think that it’s not actually “instinct”, though, it’s basically an accumulated experience that started very slow at the young age. I believe most coders, who started early enough in their life, have developed permanent neural links related to code, which makes coding “natural” for them, *like* an instinct. This is what expert systems are all about, developing strong neural links and connections in response to a given dataset (experiences), hence it is more of an experience than an instinct, imho.", 
        "title": "Great article. – Joe White –"
    }
]