[
    {
        "url": "https://medium.com/@m.haines_81949/a-universal-basic-income-directly-solves-one-problem-only-bc8a212f3d98?source=user_profile---------1----------------",
        "title": "MARKET-ORIENTED UBI THAT SOLVES THE ‘NO-RIDER’ PROBLEM— WITHOUT FUNDING or REDISTRIBUTION",
        "text": "Most people are familiar with the ‘free-rider’ problem. This arises as a result of the private use of common resources (the air, rivers and ocean, etc). Because each person can use the commons without cost, it can lead to degradation of the resource, eg through over-fishing, or pollution. The market cannot solve this problem because the commons is free to use. It requires the community to set and enforce the rules.\n\nLess well recognised is the ‘no-rider’ problem. This is another failure that the traditional market cannot address. It arises when people have no money to express their needs, so the market never responds to satisfy them.\n\nQuite simply, without money, its impossible to get a ride in the market economy.\n\nThis paper explains the nature of the problem and offers a unique solution involving a Market-oriented Universal Basic Income, or MUBI. It uses market mechanisms to give everyone the money they require to express their basic needs (in the market), without taking anything from anyone else.\n\nUnlike all other proposals for a UBI, the MUBI requires no external source of funding. It instead relies upon an aspect of the monetary system that is well-established, yet little understood by the wider community. It enables us to inject money into the economy via each citizen to meet their basic needs (directly boosting business and employment); and to keep it circulating — without borrowing or igniting inflation.\n\nIt offers the best of capitalism and socialism combined!\n\nFurther, MUBI need not be established wholesale, with the attendant risks of failure and unintended adverse consequences. It can instead be started at a very modest level, such as $10/week per person, and then increased as market conditions prove its viability.\n\nAt the end, the paper also invites the reader to support a Kickstarter project to develop a demonstration tool, conceived 80 years ago by futurist and SF writer Robert A. Heinlein — to help everyone better understand how the system works in practice.\n\nMany credible sources predict a massive upsurge in job loss in the 2020s due to AI and automation, possibly reaching 40 percent of the entire workforce. Even during the Great Depression, unemployment levels never exceeded 25 percent.\n\nOthers argue that the dislocation will only be temporary, as new work opportunities emerge, just as large scale employment in agriculture gave way to new jobs in manufacturing, and then new service industries. This is a theme repeated in The optimist’s guide to the robot apocalypse that also argues for automation to compensate for an aging population who cannot work, who will also need greater care.\n\nThere is little doubt that new jobs will emerge. However, there is no guarantee that they will pay as well as the jobs that are lost. While some may pay better, recent history suggests many more will be at the low end of the scale, potentially dropping the standard of living for a large section of the community — even as our capacity to produce improves.\n\nThen again, AI automation will likely go on dropping prices too, so a lower income may not mean a drop in a person’s standard of living — as long as they have an income.\n\nThese arguments and counter-arguments may (or may not) be true of the future.\n\nWhat’s certain is the speed of change is much greater this time around, making any adjustment process much more problematic.\n\nIn the immediate term, the consequences will be severe from at least four perspectives:\n\nAny one of these would potentially be an enormous problem for society, and perhaps even destabilizing. If we get one, we will almost surely get all four.\n\nThe paper Ten Responses to the Technological Unemployment Problem outlines a range of responses (explained in the paper):\n\nApart from numbers 1 and 10, which are not really responses, none of the suggested countermeasures are necessarily mutually exclusive. Nor is the list exhaustive.\n\nThe main point in favour of a Universal Basic Income is that it alone completely solves the ‘no-rider’ problem, and can be implemented quickly — with universal effect within each country; provided it can be implemented in a way that addresses the legitimate concerns that people have raised.\n\nConventional approaches to UBI suffer from a number of deficiencies.\n\nFirst, how can the UBI be paid for without generating inflation or requiring massive redistribution of wealth, or huge deficits (any of which is certain to spark significant and sophisticated opposition)?\n\nSecondly, how can a UBI be implemented in a way that minimizes or eliminates any presumed side effects, such a increased drug use or laziness?\n\nThirdly, how can a UBI be implemented so that those who have historically opposed such social welfare schemes, instead understand themselves and society as a whole to be major beneficiaries, along with the poor?\n\nFourthly, how do you prevent double dipping, while ensuring everyone gets their entitlement — even in places with little infrastructure or sophisticated financial systems.\n\nThe present proposal will successfully address the above concerns.\n\nBefore we get into the detail, it is important to acknowledge that the idea of a UBI has a long history, stretching back to Thomas Spence in the UK and Thomas Paine in America in the late 1700's.\n\nOver the centuries, there have been many arguments made for and against it. More recently…\n\nPhil Andrews has mounted an interesting philosophical argument in favour in Universal Basic Income: The Maslow Argument\n\nScott Santens explains why a UBI is not Socialism and is, in fact, the epitome of Capitalism in his paper: If You Think Basic Income is “Free Money” or Socialism, Think Again. He also shows how a UBI could be funded by reallocating monies from existing welfare programs.\n\nMarshall Brain further develops the arguments for a UBI and offers a range of other ways in which it could be funded.\n\nThe Basic Income Earth Network (BIEN) is another great resource that links to global initiatives aimed at developing a UBI.\n\nSimon Sarris puts a contrary point of view: After Universal Basic Income, The Flood, as does Henning Meyer in Five Reasons Why A Basic Income Won’t Solve Technological Unemployment.\n\nThis paper is short on data, as those by Scott Santens, Marshall Brain, BIEN and Simon Sarris either provide or cite a wealth of data to support their arguments, which this paper builds on.\n\nSome of the arguments against relate to the fact that a UBI (alone) won’t solve homelessness, or the drug and alcohol problem, or gambling addiction, or unhealthy lifestyles, or a lack of education; and it won’t. But it may mitigate those problems, especially when combined with enlightened support programs that treat the root causes, rather than the symptoms.\n\nFor those concerned that work provides ‘meaning’ as well as ‘money’, the UBI does not stop us offering ‘job guarantees’, as suggested by Meyer. If there is real work (not ‘make work’) to be done, anyone will be free to boost their living standard even further by accepting the work.\n\nThe problem with job guarantees is that they don’t cover those who cannot work, or their unpaid carers.\n\nOthers suggest we just need to help people to transition to new jobs, by providing retraining schemes, temporary income support and help with relocation expenses, and so on. Again, there is no reason why specific programs cannot work in parallel, each focusing on a different aspect of the problem. Of course, such schemes assume the person can work, though many cannot.\n\nAnother concern is that (some) people are inherently lazy and won’t work if they get ‘free money’. Yet, the evidence cited by Scott Santens shows that in practice this is not the case when the money is given unconditionally.\n\nThere is some evidence cited by Simon Sarris that some people on welfare just ‘sit around watching TV’. But what else is there to do when you have barely enough money to live on? Of course, they could get off their bum and find a job… except it costs money to get to interviews, and besides, they just lose benefits and there is no guarantee the job will last and then they are back to square one, re-applying for the benefits they just lost! The system is stacked against them.\n\nSome cite the increase in disability claims as another rort that shows how ‘lazy people’ milk the system. Yet, applying for the highest possible benefit when you cannot get work is a perfectly rational response. It is also perfectly rational (though soul destroying) to then sit around watching TV, as any attempt to do more could see your ‘disability’ claim denied.\n\nAnd then there is the argument that we are just taking money that was going to the poor and giving it to everyone, leaving the poor worse off. Or, that redistribution from hardworking people to ‘lazy good-for-nothings’ is simply theft and counter-productive; or we cannot afford it. Or all of the above.\n\nBut it does not have to be this way. We can set it up so people who can work have every incentive to find more work (to add to the social good and improve their standard of living), while the system underpins their basic needs… without taking anything from anyone else.\n\nMy argument for the UBI is very simple. It is the same one that Scott Santens has used:\n\nImagine you are walking downtown and feeling a bit hungry, you reach into your pocket and realise you have left your wallet at home: no money, no sandwich. But of course, that’s only a temporary problem.\n\nBut what if it’s not? What if every day you have no money at all? How will you eat, or get around… how will you survive?\n\nIn a market economy: no money means you have zero ability to signal your needs… or have them satisfied.\n\nWell, they are over 50% of the population in developed countries:\n\nIn most cases, the lack of income is ‘temporary’ (though often lasting years). The young grow up, the old die, the incapacitated recover (though not all), the unskilled retrain, and carers get to go back to work.\n\nIn the meantime, how do all these people survive?\n\nThere are only a limited number of ways to get money while you cannot work:\n\nAs well, tens of millions in the US, who work for minimum wages, are only marginally better off than not working, with earnings (especially for families) still below the ‘poverty line’. For some, this situation is also temporary. But for many it is not. To say they just need to lift themselves up is to ignore the reality that there are only so many higher paying jobs.\n\nA UBI does not solve all problems. Of itself, it doesn’t solve homelessness or addiction, or escalation in rent or health care costs. Nor will it result in a better educated population, nor will it help retrain people for a new career. At least not without other specific initiatives.\n\nWhat it does solve directly is one over arching problem: the lack of cash to express your needs in the market.\n\nIt simply means that, even without a paid job, each day you can reach into your wallet and know you are not going to starve, that you can afford appropriate clothing and public transport, perhaps even a secondhand car and petrol to look for work (attend interviews), the weekly rent (if we watch out for gouging), and yes, even a phone, a computer and TV, as well as basic health care and access to education (both increasingly online, hence the need for a computer). Stuff to survive in a modern city.\n\nA UBI will not change the relative position of anyone in society. Nor will it put a ceiling on the incentive to work. It actually frees people mentally to contemplate working — given they can afford the transport to get there, and not have to worry about finding or begging what they need to live that day.\n\nThe problem is how to fund it.\n\nMost proposals seek to re-allocate taxes and replace existing welfare programs. But this is not necessary. Nor is it desirable, given it is impossible to know the impacts on specific people of replacing their welfare payments with a UBI.\n\nFor this reason, and all the reasons that Simon Sarris states, all existing welfare programs should stay in place.\n\nThe UBI should simply reduce any welfare entitlements, as though it was earned income. In time, the UBI should supplant unemployment benefits entirely. All other welfare programs should also naturally phase down (though not out), as the UBI level increases over time. This will result in a tax saving.\n\nSo, if we are not re-distributing existing welfare, does that mean we need to increase taxes or charges on current incomes?\n\nNo, it does not.\n\nThe ability to pay a UBI comes through specialization and automation: enabling us to make more for less, with fewer people in the supply chain.\n\nSpecialization, automation (and globalization) has led to the creation of our current ‘leisured’ classes: those rich enough not to have to work, or who work ‘playing and administering sports’, or doing ‘creative jobs’ (in film and TV and the arts) and all the ‘service industries’ such as beauty and massage, and the manufacture of trinkets that do not actually supply any of our basic needs, as well as those on age and disability pensions and unemployment benefits, together with most of our children into their late teens. In the developed world, we have been supporting hundreds of millions of these people (including me) in increasing numbers over the last 100 years, solely due to our collective ability to make what everyone needs without their help. This ability is about to skyrocket through the use of artificial intelligence and robotics, as well as new materials and additive manufacturing techniques.\n\nThe problem with automation is that it breaks the link between earning money via work, and spending the money earned to purchase our needs.\n\nEven though the automated supply chain can provide the same volume of goods and services as before automation, it will not do so unless people have the same money to express their demand.\n\nThe question remains: where does the money come from to pay people who are no longer needed in the supply chain, as well as those who cannot work at all (young, old, incapacitated and their unpaid carers)?\n\nThe same place all money comes from: ‘the thin air’.\n\nTo some people this may seem an outrageous claim. But it’s true. All money is essentially created through the banking system ‘out of thin air’.\n\nThe process is described in this Bank of England paper: Money Creation in the Modern Economy\n\nIt is as simple as making two entries in the books of the bank: debit loan in the name of the borrower, and credit deposit in the same name for the same amount.\n\nThe first entry creates the debt that the borrower must repay, while the second entry creates the money they can draw down. The two entries keep the banks books in balance.\n\nIf the bank does not have the cash on hand to meet any deposit withdrawal, they can borrow it from another bank; or from the central bank who can literally print it (or most usually just make its own electronic entries to create the money).\n\nThis new money is injected into the economy as it is spent by the borrower — boosting demand, which drives additional supply (and/or inflation, if the economy is near or at full capacity).\n\nAs the loan gives the borrower a unique right to spend money they have not earned, it is only proper that they should repay it out of future earnings. Once the money has been repaid, they and society are square. They will have paid back what they first took out when they spent the proceeds of the loan.\n\nAs the loan is repaid, the money does not go to the bank. The entries are simply reversed in the books of the bank and the money goes back into the thin air from which it came.\n\nThe bank only gets the interest. This goes to pay its costs, including a margin for defaults, and its profit. Profit is simply the value added by the bank in supplying and organizing the people, equipment, processes, facilities and energy to qualify borrowers, manage the loans and enforce repayment; and to run the payments system. This is a hugely beneficial function that has been degraded by the amalgamation of investment banking with commercial banking, and is about to be disrupted by ‘Fintech’. (But that’s another whole topic).\n\nRegardless of a UBI pumping money into the economy for consumption, loans/borrowings will still be a vital part of the system for the purchase of assets.\n\nBorrowing provides governments, business and individuals with the ability to enjoy the fruits of an asset (bridge, machine or house) while paying for it out of income earned — as it is used. (Take the case of a bridge. To pay for it out of current revenue during the years it is built would be to disadvantage current taxpayers over future taxpayers who would get the use of the bridge without paying for it. By borrowing and paying the loan off over the life of the bridge, taxpayers share the cost according to the value it provides them. Similarly, the buyer of a house gets to enjoy the benefits of home ownership while working to pay off the loan).\n\nAs repayments take money out of the economy, in order for the economy to grow, new loans must exceed repayments on any day. This is why, under the current system, world debt must grow to maintain economic growth. (As later discussed, this ‘growth’ will have to become ‘circular’, to sustain a diverse and hospitable biosphere).\n\nCentral banks have also created money ‘out of thin air’ to buy existing securities from investors. This process is called Quantitative Easing. It has been used to inject liquidity into the banking system to remove the threat of bank runs during the Global Financial Crisis (and since, to keep equity markets from falling). Most of the money has been reinvested, bidding up asset prices, with little flowing to the real economy. This money will be destroyed as Central Banks reverse the process, either selling the securities back into the market, or waiting until the securities mature and are repaid.\n\nWith this understanding that ALL money is created ‘out of thin air’ (and destroyed by reversing the entries that created it), we can see that there are a number of ways we could issue it.\n\nBut these are not the only ways. We could also issue it:\n\nBut that’ll just lead to runaway inflation! I hear you cry.\n\nNot necessarily, and certainly not immediately. The extra sales generated by the UBI will first lead producers to expand capacity, generating extra income. The impact of this extra income on inflation depends on where it flows and what it is spent on.\n\nIts a truism that money flows up, much faster than it trickles down.\n\nHistorically, the resulting increase in profit will flow first to top executives and shareholders. And as it does, much of it is removed from the the ‘real economy’. Instead, it is invested, pushing up the price of assets and, in particular, securities — without impacting demand for most goods and services.\n\nRegardless, managing inflation is not a new problem.\n\nCentral Banks have two objectives: to keep unemployment and inflation low.\n\nIf bank lending injects too much new money into the system, outpacing the growth in our productive capacity, it can ignite inflation.\n\nCentral Banks use the cash rate (at which commercial banks lend to and borrow from it) to manage their twin objectives as best they can: increasing the cash rate if inflation looks to be a danger, and dropping the rate if employment is weak. (Though in recent years, the link between inflation and employment appears to have been broken, reducing the effectiveness of this tool).\n\nIf Central Banks are also given responsibility for the UBI we will simply be giving them an additional more targeted tool to stimulate the economy (in keeping with their employment objective).\n\nWe can also give them a complementary tool to damp the economy more directly than the cash rate: an Inflation Tax. The money raised by the Inflation Tax would not go into government coffers. It would be written back into the thin air from which the UBI came.\n\nImportantly, the Inflation Tax would not be an extra tax on current incomes. It would merely take out some of the new money being pumped in via the UBI — to keep the money circulating: pumped in, taken out and pumped in again, round and round.\n\nThis circulation is fundamental to how the economy works.\n\nEach week people need money to spend — to signal their need for food and other goods and services. But once they have spent it, they no longer have it to spend the next week. This means we have to inject new money into the economy as a UBI every week.\n\nThe money injected via the UBI does not disappear as it is spent. It goes into the hands of those who provide the goods and services, who then have it to spend. This is not a problem if the money just flows up into bank accounts, or to buy securities.\n\nIt is a problem as and when it is spent to boost demand beyond the capacity of the global economy to respond sustainably, as this has both consequences for inflation, and for the degradation of the environment. The point at which this happens cannot be predicted.\n\nFortunately, we don’t need to make predictions.\n\nThe Central Bank can start small, paying a UBI of (say) $10 per week per person, and gradually increase it — until there is a clear signal from the market that the rate has reached its limit. This will occur if and when inflation kicks in. While inflation remains below target, the Central Bank would continue quarterly increases. Otherwise, it would freeze the UBI and revisit next quarter.\n\nGiven this market mechanism we could term it a Market-based UBI (MUBI).\n\nWhile there is a risk that excessive inflation may appear quite quickly, both globalization and technology have been pushing prices down. This trend should continue, enabling us to make more for less, to meet the extra demand generated by the MUBI. As well, there is still a huge amount of ‘idle capacity’ across the world. Ask many companies if they could increase production without increasing prices and the answer will be a resounding yes. In many cases (such as health and education) AI and mobile technology is also likely to drive substantial price reductions over the next decade.\n\nSince the MUBI would be paid to everyone, unlike a loan to a specific person, it would not need to be repaid. It would simply represent a permanent increase in the money supply… week after week.\n\nAs noted, while the money from the MUBI is flowing in at the bottom to everyone, it does not stay there. As soon as it is spent, it flows up into the hands of workers and more into the hands of the higher paid executives and owners of the factors of production who see their returns increase from the extra demand generated by the MUBI.\n\nThis suggests that the simplest and most equitable way to take money out is to tax a set percentage of all spending (an Inflation Tax). Again, this can be done on a ‘trial and error’ basis, starting with a small percentage on consumer goods and services and see what happens to inflation. (Similar to how Central Banks now manage interest rate changes, and as proposed for the MUBI).\n\nIf you don’t spend, it means you have contributed value (via work and/or investment) and not consumed it, so there is no social cost in deferring tax until the money is spent.\n\nThe money raised via the Inflation Tax would be written back into the thin air from which the MUBI is created.\n\nThe sole aim of the Inflation Tax is to take money out of the economy — to keep the money supply ‘in balance’ with our growing productive capacity — to ensure low inflation.\n\nThe Inflation Tax will be relatively easy to implement where a Goods and Services Tax is already in place, at it would simply represent a change in the rate, with the increase going to the Central Bank to be written off.\n\nA percentage tax on spending may seem regressive, but combined with the MUBI it is not.\n\nEven though everyone gets the same amount of MUBI and pays the same percentage tax (as necessary) on every dollar they spend; the combination is a Net Progressive System, wherein those at the bottom get most of the benefit from the NEW MONEY — which is what we want.\n\nA crucial advantage of this system is that the progressivity is attained without using different tax rates.\n\nThe practical significance is that, because there is only one tax rate, the system cannot be manipulated to favor one group over another.\n\n[The following example illustrates the progressive nature of the combined effect of the MUBI and the Inflation tax:\n\nImagine a MUBI of $12,500 and an Inflation Tax of 25% on spending (just to make the maths easy — the expected rate could be much much lower).\n\nWe can look at tax as a percentage of income, or a percentage of spending.\n\n$2,500 tax on an income of $12,500 = 20% of Income. Alternatively, after tax you would get $10,000 to spend (12,500–2,500). The $2,500 tax then equates to 25% on spending.\n\nThat is, a 20% income tax is the same in this case as a 25% tax on all spending.\n\nWith a MUBI of $12,500 and a 25% tax on spending, if you have no other income you go from zero to $10,000 to spend. That is, you pay no net tax, but get a net benefit.\n\nSomeone who is earning $100,000, would then have $112,500 (including the MUBI). 20% of this gives an income tax of $22,500, leaving a net of $90,000 to spend. (22,500/90,000 = 25% tax on spending).\n\nIn this case, the net tax on their original earnings would be $10,000 (100,000 pre-MUBI income - 90,000 to spend post MUBI) — equals a net tax of 10% of pre-MUBI income.\n\nSomeone earning $1,000,000, would have $1,012,500 to spend after the MUBI. They would pay $202,500 tax leaving a net of (1,012,500–202,500) = $810,000. Based on pre-MUBI income the effective tax paid would be (1,000,000–810,000) = $190,000 or 19% of pre-MUBI income.\n\nThe higher the income, the higher the net tax — up to a limit (in this case) of 20% of income. That is, under this system, the maximum net tax rate always approaches (but never reaches) the income tax rate.\n\nImportantly however, it may be expected that over time, earnings will also increase due to the extra demand generated by the MUBI.]\n\nThis system has one aim: to put money into the hands of those who do not have it (or enough of it), so they can buy what they need to live on — without having to assess who those people are, and without killing the incentive to work…\n\nDoing it in a way that treats everyone the same: same MUBI and same % Inflation Tax rate.\n\nAs everything produced ultimately gets consumed, it should make no difference in terms of equity whether we tax all income (which represents the value of production) or all spending (which represents the value of consumption).\n\nTax would be much easier to administer if all current taxes were stopped and all incomes (wages, rent, fees, interest, dividends, etc) were paid gross into your bank account(s), with tax taken as a percentage on any withdrawal. (To avoid double taxation, it would require a system of rebates on the resale of assets, and on the proceeds of loans and gifts).\n\nThen we could have:\n\nThe Council and State rates would depend on our principal place of residence.\n\nEveryone would then have a direct common measure of the monies required to fund each arm of government.\n\nImportantly. an increase (or drop) would have the same percentage impact on everyone living in the same locality, regardless of their income.\n\nCombined with a MUBI, the system would provide a floor that eliminates any perceived regressive effects of the tax on spending (as shown in the example above).\n\nThis approach has the added benefit of removing tax from the decision-making process (as no business would expense tax). It would also capture spending on imports with zero additional administration.\n\nLevies could still be applied to price the cost of anti-social behaviour (eg smoking health costs), with the money raised solely to educate and mitigate the effects of the behaviour. This way, income from the levy would reduce as the behaviour is modified, but so would the need for spending on mitigation. It would be a virtuous diminishing spiral; rather than addicting government to the revenue, as now so often happens with such levies that go into general revenue.\n\nJust because inflation kicks in, does not mean that the combination of the MUBI and welfare is sufficient to deliver a basic lifestyle.\n\nIf it is not sufficient, we will need to go on increasing the MUBI and deal with the inflation it could generate via the Inflation Tax.\n\nSpecific programs will still be required to alleviate homelessness and drug and alcohol addiction, and a lack of education and other social ills. Though evidence from around the world (as cited by Santens and others) is that the MUBI will certainly help, and not hinder.\n\nWe may also need to look at ways to share around the available work, for example, making it easy to work ‘part-time’, with the MUBI providing the floor.\n\nSo what will happen as we gradually increase the MUBI?\n\nFor the rich, it will just be another tiny number in their bank account. It will make zero difference to their spending, meaning it will make zero difference to the rest of us that they receive it. (Though they will benefit from the extra spending the MUBI generates within the economy as a whole, as their businesses expand to provide the extra goods and services demanded).\n\nOthers will spend their MUBI immediately on stuff they really need (or want), boosting business and employment. This will reduce social ills and societal costs, including homelessness, poor healthcare, and crime. It will make people feel safer quitting a job to start a business, or to learn a new trade.\n\nAs the rate is increased, those with other income and/or lesser needs will cut back their hours of work, or drop out of work altogether to pursue other interests… caring for family, inventing, playing sport and all manner of games, cultural interests, volunteering, socializing, house and garden maintenance, growing their own food and cooking it, playing in VR, managing their investments, reading and learning and writing and making videos, engaging in civic activities… whatever. None of us can complain because they are only getting the same MUBI that we are getting, while paying the same percentage tax (as required).\n\nThose whose wants are greater, or who have greater family responsibilities can then step into the vacated jobs, without loss of their MUBI.\n\nAt some point however, the labour market will tighten, as more people decide to reduce their paid work in favour of other activities. It would mean that any further increase in the MUBI could lead to a labour shortage which could push up real wages, pushing up prices. This is no bad thing if it happens gradually. Higher wages traditionally correlate with improved community measures across the board. And, if an employer cannot afford the wages, the good or service won’t get made, or it will be produced using robots. No one is guaranteed work or a business. But everyone should be (and can be) guaranteed a basic lifestyle, with every incentive to do better.\n\nOnce we reach an acceptable minimum, the Central Bank’s task will be to hold the MUBI and Inflation Tax, making fine adjustments to ensure it meets its twin objectives of low unemployment and low inflation, in keeping with our ever-growing productive capacity.\n\nAs with interest rates, the combination of the MUBI and Inflation Tax will be a balancing act, that will never be perfect. But it does not have to be perfect. It just has to work. Like all aspects of the economy, it will be subject to improvement with experience, better understanding, and AI guidance.\n\nOf course, this is all speculation.\n\nThe beauty of starting small is that we don’t have to speculate when we come to implementing a MUBI. We can just do it and see what happens. If for some strange reason a major problem does start to emerge, we just stop increasing the MUBI.\n\nThe worst that will have happened is that people have got a bit more money to spend and inflation kicked up a bit.\n\nThe most likely scenario is that everyone wins:\n\nApart for simply agreeing to do it, the biggest challenges remain ‘identity’ and ‘distribution’, especially in less well developed regions.\n\nNo only do we need to know that money is not ‘double spent’ or ‘counterfeit’, we also need to know that the recipient has been allocated their share and no more.\n\nAcross the developing world, new approaches like M-pesa are showing how it is possible to use cheap telephony to distribute ‘money’. Combined with cheap distributed renewable energy this will allow for remote distribution.\n\nAs well, there are now many new ‘blockchain’ initiatives aimed at solving the identity problem by putting each person back in control of their own identity — in a way that allows others to rely on the claims they make. A key part of this problem is ‘proof of life’, that is also being addressed.\n\nThe links are are not endorsements or acknowledgement that the approaches even work as claimed. They are offered merely as ‘illustrations’ of the problems being worked on.\n\nUntil these wider problems are solved, the MUBI may need to be restricted to developed countries and limited areas/numbers in developing countries (as now being done with Manna, a crytpo based UBI).\n\nThe biggest risk is that the new demand could strip the planet bare. The best way to mitigate this risk to the biosphere is to speed up the transition to a ‘circular economy’.\n\nThese are two TED talks that put the threats to the biosphere in perspective:\n\nAnd some steps along the way:\n\nAnother risk is that any country implementing a MUBI could become a magnet for immigrants. However, this can be managed by limiting inflows, and by providing a qualifying period for access to the MUBI.\n\nOthers believe that the problem is the ‘market system’ itself, and that a MUBI would simply underpin a bad system that emphasizes competition over collaboration.\n\nIt’s true that competition is central to the market. But it is far from bad.\n\nOn the creative side, inventors and entrepreneurs are driven to conceive of ‘better’ products and services and/or ‘better’ processes to produce them. This is essentially a mental process that has resulted in all the advances we now benefit from.\n\nCompetition in the market is also by and large a mental process. It exists first in the head of the buyer, when deciding which is the product or service that ‘best’ meets their needs.\n\nCompetition between producers is also vital to ensure the lowest cost and highest quality; and to also ensure the most efficient use of resources. This happens via Adam Smith’s ‘Invisible Hand’:\n\nWhen a person works and/or invests to produce a good or service, they add value to society’s resources. The amount of value they (and all suppliers in the process) contribute is represented by the money the buyer pays.\n\nThe money is simply ‘information’. It records the value of the goods and/or services provided by the seller to the buyer.\n\nImportantly, it allows the seller to take out of society the same amount of value (not more or less) — when they spend the money.\n\nIt is vital that this value is ‘fair’. If it is too little, the seller is shortchanged. If it is too much, the buyer loses out.\n\nThis is where the ‘market’ and Smith’s ‘Hand’ comes in.\n\nThe buyer wants to pay the lowest possible price, but is forced to bid up in competition with other buyers. Sellers want to maximise the price, but are forced by other sellers to bid down. This process also weeds out the least efficient producers, to ensure optimum allocation of our resources.\n\nThe price that clears the market can be regarded as ‘fair value’, subject to some major provisos: that there is a large number of buyers and sellers bargaining in good faith (without collusion or fraud), that each party acts rationally and has perfect knowledge of all factors affecting the market, and that each has equal bargaining power which is exercised with due regard for the public good!\n\nObviously, these ideals rarely exist in the real world. Fortunately, in most cases, it works ‘well enough’. However it does require an appropriate governance framework and nudge strategies to encourage open competition and to protect both the commons and individual rights. It is here that we fall down.\n\nWhile competition is vital to its operation, it is a mistake to equate ‘the market’ and capitalism solely, or even primarily, with competition.\n\nOf course, producers do spend large amounts competing to influence each buyer’s decision via advertising and marketing. But the amount of resources consumed in doing so are minuscule compared to the resources employed in the creation and delivery process… which is entirely collaborative along the whole supply chain from the mine, sea and farm, to factory, warehouse and shop.\n\nOnce conceived, it takes millions of people from across the globe collaborating to support a product’s production and delivery (including the design and manufacture of the equipment that makes it, all the way back to the mine and farm, as well as those who provide all the services to support everyone who works along the whole supply chain, and in the supply chains that support them), using knowledge accumulated over the whole of human history!\n\nMost human endeavour is expended collaboratively. Only a tiny (but vital) proportion is devoted to competition.\n\nOf course, the system is not perfect. It is often subverted by big business and powerful interests that use unfair practices and manipulate legislation to reduce competition and monopolize the supply chain. This is where the challenge lies — not the market per se.\n\nAs asserted at the start, there are two problems the market cannot solve.\n\nOne is the ‘free-rider’ problem that allows people to consume common goods and services (like the biosphere) without paying for them (eg by polluting a river, or over-fishing, etc). Tax provides one way of mitigating this problem, by forcing everyone to meet a common cost. Another way is to put a price on the use of the commons, for example by pricing carbon. Another is to develop nudge strategies to encourage desired behaviour; while the most common method is to outlaw and punish anti-social activities. As discussed, in the Naoko Ishi video above, the ideal is to have the community police its own common resources (even on a global level), via behavioural ‘norms’ — \n\nthough this requires near universal awareness of the problem. Another is to find market mechanisms to protect the commons by turning ‘waste’ into a resource, as David Katz proposes.\n\nThis ‘free-rider’ problem has to be addressed in parallel with the second problem, if we are to avoid catastrophic degradation.\n\nThe second problem is the ‘no-rider’ problem.\n\nThis is where people lack the money they require to signal their needs in the market because they cannot work in the production process: the young, old, incapacitated, their unpaid carers, and those who lack the skills required by the market.\n\nThe MUBI offers a way to solve this last problem, without taking anything from anyone else.\n\nBy solving this one problem in a fairly automatic fashion, societies will be able to redirect their scarce resources towards solving other problems (such as homelessness and drug addiction) while evolving towards a ‘circular economy’ that delivers sustainable technological abundance, without ‘waste’.\n\nWhile it would be ideal to simply jump from today’s scarcity-based systems to those of abundance, that is not going to happen. Indeed, if technological unemployment in the 2020s reaches the levels some are forecasting, society may collapse before abundance is attained.\n\nMUBI gives us a bridge to a new kind of world. One that fosters self-reliance and innovation while ensuring those who cannot participate in the production process can still enjoy sufficient of its fruits to live a meaningful life — without taking anything from anyone.\n\nWhat that life may ultimately look like is anybody’s guess. Jonathan Kolber has offered one possibility in his book: A Celebration Society. This is not utopia, but a jumping off point for looking at how a society may function in a world of ‘abundance’. There are of course many other ideas emerging to imagine this future… but first we have to get there.\n\nSome foresee a time when we won’t need money. I’m not so sure. Money is just information about the things we value, which have an inherent ‘scarcity’, It also provides a tool for measuring (albeit imperfectly) a person’s contribution to creating goods and services of ‘value’.\n\nIt is human nature to value what is rare, and to manufacture rarity simply for the pleasure of possessing something that is unique… even if it is nothing more than a table at an exclusive restaurant, or more substantially a penthouse overlooking the river.\n\nThe MUBI does not have to concern itself with individual wants and needs or even ‘value’, and certainly not ‘entitlement’. It simply provides each person with the means to signal their own basic needs, leaving it to the (regulated) market to satisfy them — based on the ‘value’ that each person perceives in any exchange.\n\nHopefully, this paper will have explained enough to ignite interest in the idea, though it may still leave you wondering just how it would work in practice.\n\nTo solve this problem, we are proposing to set up a Kickstarter campaign to fund development of an on-line tool and board game that allows people to understand:"
    },
    {
        "url": "https://medium.com/@m.haines_81949/the-claim-of-low-bitcoin-fees-is-a-fraud-74d26fb7cf99?source=user_profile---------2----------------",
        "title": "The Claim of Low Bitcoin Fees is a Fraud – Michael Andrew Haines. –",
        "text": "One of the claims for BTC is ‘low transaction fees’ compared to traditional financial institutions. Nothing could be further from the truth.\n\nCurrent direct fees are around $5 per transaction, but have recently been above $16.\n\nThis is regardless of the amount transacted… so not much good for a cup of coffee.\n\nBut that’s only the start of the problem.\n\nBTC already consumes more electricity than Ireland, and if demand for the coins was to keep increasing at the projected rate it could consume a large percentage of the world’s electricity within just a few years.\n\nEach transaction now costs around the same in electricity as 9 US households use in a day, approx $36 (very rough estimate, but the right order of magnitude). Making for a very expensive coffee indeed!\n\nBut this is only the base transaction cost. The true cost is hidden in the rising price of the coins themselves.\n\nEffectively, the rising price represents a transfer of purchasing power from the wider community to coin holders just to effect the transactions.\n\nThere is no validity to the claim BTC are a ‘store of value’. A store retains what is put in it. As nothing has been put in, the coins should be worth what they were when first issued, namely: nothing.\n\nSo, why do people pay more and more to get BTC?\n\nTo avoid the claim they are a ponzi scheme (with everyone paying more simply in the expectation that others will pay even more in the future); the only argument can be that the coins enable secure transactions with low fees.\n\nSo what’s the true cost to the community of BTC providing secure transactions?\n\nSince inception to 1 Dec. 2017, there have been 277,040,706 transactions.\n\nThe current (5.06 pm on 3 December 2017) price is USD 11,063.\n\nThe total number of BTC on issue is around 16.7 million.\n\nThis gives a total value transferred of $184,752,000,000 from the community to the holders of BTC as the cost of effecting 277, 040,706 transactions.\n\nGiving the cost per transaction of USD 666 — for every transaction that has ever been done on the Bitcoin blockchain.\n\nYet, we could go further and look at the current running cost of transactions.\n\nThe price of BTC on 1 Nov 2017 was $6,527, giving a price increase of $4,536 by the end of the month. This gives a total uplift in the value of all BTC on issue of: 16.7 million x $4,536 = $75,751,200.000.\n\nThis increase in price could be seen as the marginal cost to effect all transactions over the month: 9,351,311\n\nThe cost is therefore around USD 8,100 per transaction for Nov 2017! (I know this is not a strict measure as, if the price falls it would suggest a negative cost, but it does show the madness inherent in the pricing).\n\nImagine if, instead of hiding the transaction cost in the rising price of the coin, we offered a stable crypto, but charged every user a fee of USD 666 or worse, $8,100 for every transaction. You’d want to be buying a pretty expensive cup of coffee to warrant those sort of fees.\n\nThere’s no doubt that we will one day get a crypto that has a stable price from the time of issue, that does not consume huge amounts of electricity. But Bitcoin is not it.\n\nWe should outlaw BTC (and all deflationary crypto) to prick this speculative bubble and get everyone’s focus on developing a stable secure crypto we can actually use as money, that holds its value over time and consumes little electricity… so everyone can properly account their profit and loss on trading in real goods and services."
    },
    {
        "url": "https://medium.com/@m.haines_81949/big-government-and-big-money-are-both-ayn-rands-children-588744271d93?source=user_profile---------3----------------",
        "title": "Big Government and Big Money are both Ayn Rand’s Children",
        "text": "Though she never would have admitted it, Big Government is her bastard child, along with her favored son:\n\nIt’s time that both Ayn’s children left home (Earth). Maybe Elon could offer them a ride on his rocket to Mars.\n\nThis is not to deny the need for government or money, nor the value of the free market in allocating resources among those who have money… and equal knowledge and power, who understand the full consequences of their decisions… and act rationally!\n\nThere is little doubt that markets are the best we have for allocating resources among buyers and sellers. But they are not perfect… because people are not perfect. Nor do they work if you have no money.\n\nMoney is like a vote to signal what you want the market to produce. No money, no vote. No vote, nothing gets made to meet your needs.\n\nShe seems not to have understood a basic economic truth: that the total value of every good and service produced is equal to the total income of all participants in the process. Participants take their income shares as wages, interest, fees, royalties, rent and profit.\n\nIn the absence of sharing, they are able to consume all that they produce — as they spend their incomes.\n\nBut what about the people who cannot participate in the process: the young and old and incapacitated and those without the skills required by the market… and their unpaid carers (over 50% of the population)?\n\nThe only way they can share in the bounty is for those who participate in the production process to share some of their income. In part, this is done through family (but with family breakdown, less so nowadays) and part through charity. The rest is through taxes… and crime (a rational response to exclusion).\n\nFrom a naively selfish perspective, I should share nothing.\n\nAnd yet, even rationally, we should pay taxes to help the poor as it is now well established that poor people suffer much worse health and are afflicted by more crime… both these drain social resources and diminish productivity and safety for everyone in the community.\n\nUnfortunately, Rand saw taxation as theft. A view happily endorsed by those who see their own self-interest in the accumulation of money.\n\nThese are bad ideas. They result from a failure to understand the nature of money, seeing it as a ‘good’ to be accumulated, rather than the ‘means of exchange’ that must circulate.\n\nAs tax is spent, it goes straight back into the hands of the people who paid the tax; those who work in and own the businesses that provide the goods and services the money buys. The more money going round, the higher the turnover, the more wages and profit earned, the greater the wealth that is generated.\n\nThere are also goods we may agree to produce collectively, such as roads and other infrastructure, as well as services, such as the administration of justice and policing, etc. that involve natural monopolies or common interests. Tax is how we pay for these.\n\nRand also abhorred the use of force by the State. Except to prosecute criminals and enforce property rights in the pursuit of “full, pure, uncontrolled, unregulated laissez-faire capitalism”.\n\nYet, all rights come with restrictions and responsibilities.\n\nMy right to make noise is balanced by your right to peace and quiet. Your right imposes on me both a restriction (to make noise only up to a certain volume and only between certain times in certain places) and a responsibility (to not make noise outside those restrictions).\n\nMy right to make whatever concoction I choose (and claim whatever properties I like for it) is balanced by your right not to be poisoned or deceived. Again restricting what I can make and sell and what I can claim. Also imposing a responsibility to not make and sell products that are harmful, and to not make false claims.\n\nMy right to dig up whatever I like, wherever I like, and emit whatever foul chemicals and waste I like in the process of making stuff, is balanced by your right to live in peace with clean air, water and food, restricting what I can and cannot do; placing on me a responsibility to abide by the restrictions.\n\nWe all have restrictions and responsibilities as well as rights. However, none of these are absolute.\n\nTraditionally, it is social norms that circumscribe our rights and responsibilities, and define and restrict ‘anti-social’ behaviour.\n\nBut what of large cities, with shifting and increasingly multi-cultural populations? Universally, human beings in these situations have found it necessary to establish the limits to behaviour via regulation, enforced by the State.\n\nThe problem is not that the State enacts laws and enforces them. The problem is the extent to which the law imposes restrictions that are ‘unfair’, ‘over-bearing’ or ‘add no value’.\n\nIt is not as simple as saying ‘get rid of government’, as the anarchists would have us do, or just ‘make it smaller’, as the libertarians prefer.\n\nWe don’t need more laws to fix market failures and anti-social behaviour… nor less laws to restrict big government.\n\nThe behaviours we are trying to influence have not changed for generations.\n\nInstead of more or fewer laws, we need simpler laws that people understand, which are fairly enforced.\n\nGetting there requires a process of continuous improvement. An active review of all laws on a rolling basis to understand their purpose, and to check that they actually elicit the behaviours intended. In fact, the more laws there are, the more of our administrative and legal resources should be devoted to revisiting, revising and simplifying them, as opposed to writing new ones.\n\nAll our competing Rights, Responsibilities and Restrictions flow through to the ‘market’.\n\n \n\nAs such, it is impossible to have a ‘free market’, unencumbered by government ‘interference’. This is especially so where the market is no longer mainly composed of many small producers, but is dominated by a few large conglomerates.\n\n‘Free’ simply means free to compete on the same terms. It does not mean ‘free to do what I like’.\n\nThe purpose of regulatory intervention in the market ought to be to protect the rights of the general population — by imposing restrictions and responsibilities on participants to prevent them running roughshod over our individual rights in pursuit of their own ‘happiness’ (profit).\n\nIt would be better if we did not need laws, if we educated our children to adhere to cultural norms… but this is an ideal that must be tempered by reality.\n\nPeople by and large are not rational creatures and are often led to act against their own self-interests. A cigarette anyone? Or how about this sugar hit?\n\n \n\nOver our lives, we all gather innumerable biases and beliefs and react emotionally to such an extent that it is irrational to believe in the idea of a ‘rational human’!\n\n \n\nPsychologists have shown how ‘post the decision’ we can ‘rationalise’ it (ie find reasons after the fact as to why it was the ‘right’ decision). This is a very different process to ‘making rational decisions’. Very few people go through such a process… even in business.\n\n \n\nMost business decisions I have seen are made on the basis of ‘gut feel’, or at best ‘comparative data’.\n\n \n\nA decision can only be truly rational if we first make explicit the decision criteria to be used in judging between alternatives, and the weight to be given to each. With all alternatives identified and assessed against all the criteria. Who does that?\n\n \n\nLook at ‘climate change’. Is it rational to heat up the only planet we have? Is it even rational to deny the possibility, when there is no other place to go and the consequences are potentially dire for us and all future generations?\n\n \n\nIf government is to protect the rights of its citizens, as Rand would have it, don’t the countless billions of ‘yet-to-be-born’ citizens have the same rights as you and I?\n\n \n\nPerhaps Rand would say: too bad for future generations, I’m pursuing my own happiness!\n\nRand’s focus on individual rights and one’s own happiness may seem logical (which is how Rand fancied a mind ought to work). But such fancy flies in the face of the facts… which is the definition of irrationality.\n\nAt face value, these are not bad injunctions, compromised by her last imperative:\n\nThis is based on the assumption that ‘the pursuit of happiness’, as an end in itself, leads to enduring happiness (as the US Constitution also implies). Who has not seen or experienced the exact opposite?\n\nWho are happiest: those who pursue the objects of their desire (their ‘happiness’) at all costs, or (as her other precepts reference) those who live for what they can create and what they can provide to others?\n\nAs well, reason operates within the strictures of our social and economic systems. If the system encourages me to act in my own selfish interests to the detriment of others, reason must defer to it.\n\nIn banking, the system ensures ‘moral hazard’ by rewarding bankers with big bonuses and commissions on dodgy loans and securities, but shields them from the downside risk through government guarantees. It is therefore quite rational for any single banker to pursue dodgy deals, despite the social cost that we all bear (except for the bankers who keep their money when the deals go bad).\n\nIs it rational for us to accept this situation? In our own interests, we should change the way the system works to eliminate this behaviour. Yet this can only be done by infringing or curtailing the rights of individuals to make money however they see fit under the current regime.\n\nIt means recognising rights which we all share in common. Not just individual rights.\n\nRand treats each individual as their own centre. Yet, as the old aphorism goes: we are no islands. I can only achieve what I achieve because we collaborate together to achieve it.\n\nIn writing and posting this article, I rely on the knowledge generated by untold numbers of people: those who design computers, write software, design and build machines of every sort, and extract the minerals and grow and process and deliver my food… and in a million other ways.\n\nRand seems to place importance on competition above all… relying on Adam Smith’s ‘Invisible Hand’ to deliver the best outcome for us all.\n\nYet, competition is only part of the story.\n\nAll animals compete. Humanity is so successful not because we compete, but because we collaborate in ways no other creatures come close.\n\nHow many people does it take to design and make a modern car in a modern factory… not just in space, but over time.\n\nIt is the sum total of all accumulated knowledge and skills that allows a car to be designed and built. All people must be educated from prep and trained to work in all the different factories to design and make the parts to make the machines that make the parts that make the machines that go into the machines that make the cars, as well as all parts for the cars themselves. Not to mention the people that build and maintain the cities that house and feed and educate everyone; and the companies that make the drugs and the doctors that keep us healthy… on and on.\n\nCompetition takes place only at the point of decision making.\n\nEssentially, competition exists only between ideas: between ‘this’ and ‘that’. It occupies only a tiny portion of human activity. Once the decision is made, most activity is collaborative. It extends along the whole supply chain to the point of delivery of the manifested good and/or service.\n\nBy all means, let’s be rational: understand that we are irrational beings utterly dependent upon each other.\n\nWe are each a tiny cog in this great wheel of collaborative endeavour that we call life.\n\nWe are not only dependent on other humans (past and present), we are utterly dependent upon the eco-system services that bring us air, food and water, as well as medicine… even ‘spiritual’ peace found among the wilds of nature.\n\nRand sees none of this.\n\nThe reference in the heading to ‘Big Government’ and ‘Big Money’ is not about the size of either Government or the Money Supply. It is pointing instead to the financialization of the economy and the concentration of power (on both sides of politics) in the hands of those with money who have taken Rand to heart — to pursue their own self-interests.\n\nOn the one hand removing legislation that placed fetters on them, or making it so complicated that enforcement becomes almost impossible. While on the other, imposing regulations ‘in support of their industry’, which are really only barriers to entry for new players, or allocations or even more money from the public purse. How ironic for Rand.\n\nThis is not an attack on the accumulation of wealth, but a caution that lobbying in our own interests ought to be an individual affair, and not the province of Big Money. Our rights, responsibilities and restrictions should be ‘self-determined’ by everyone equally.\n\nThe inter-dependence between people, and between people and other creatures and our eco-systems, indicates that ‘self’ is a much broader concept than the mere ‘human body’ a person may possess.\n\nOn this wider view, perhaps Rand is right after all…\n\nBut then, she would have to sacrifice the rights of individual ‘me’ for the rights of the ‘greater me’… if it was in the best interests of the whole do so. And she would have none it.\n\nThe evidence is against her.\n\nOur success as a species is testimony to the worth of collaboration and sharing within a robust market for ideas, where money is simply a vote for what we each want produced… within a framework of rights, restrictions and responsibilities that ensure civil society, governed by the people, for all the people (including those who cannot participate in the production process… ever more as automation takes hold).\n\nWe have succeeded, not because we are individuals, but because we are a community of individuals who strive together.\n\nThe problem is not that the rich have too much money. It is that the poor have too little, or none at all to give expression to their needs in the market.\n\nAll that’s missing is a way to ensure a minimum standard of living for everyone without encouraging sloth, and without the need for moral judgement about who should get how much.\n\nThis does not require us to take away wealth from anyone.\n\nHow we may address this problem is a topic for another day."
    },
    {
        "url": "https://medium.com/@m.haines_81949/making-change-happen-8306a6b5d01c?source=user_profile---------4----------------",
        "title": "MAKING CHANGE HAPPEN – Michael Andrew Haines. –",
        "text": "As long as it does not offend the laws of nature, an idea goes from theory to practice when the exact number of people needed to make it happen believe that it should happen.\n\nThis can apparently happen through millions of people shouting loud enough to get the attention of the few who hold the levers of power… or through a single conversation with the right person.\n\nTold right, the story will shift the world view of all those who hear it, making their world better by making the world better for everyone.\n\nAs Margaret Mead is famously reputed to have said: “Never doubt that a small group of thoughtful, committed citizens can change the world. Indeed, it is the only thing that ever has”\n\nSo, who is it that can make the change you want to see happen?\n\nThen find the few people who know those few who know the few people who know the few people who know the few who hold the power to make the change… and tell your story.\n\nIf it inspires everyone in chain to repeat it, very soon the change will happen. How hard can that be 😊"
    },
    {
        "url": "https://medium.com/@m.haines_81949/the-eternal-quest-544bc279009e?source=user_profile---------5----------------",
        "title": "The Eternal Quest – Michael Andrew Haines. –",
        "text": "Matt Chessen, you may enjoy this.\n\nIn the tradition of the Mahabharata, the following poem is an abbreviated epic that recounts the Eternal Quest.\n\nIt follows the adventures of Eno Enol Eht in his search for God.\n\nIt seems it was written over 35 years ago, when suddenly it appeared that a new perspective on life opened up… though it was of course not new :).\n\nIt has never been published before, as the time never seemed right. Perhaps today it is apt.\n\nOnce upon a time\n\n Across three billion ages\n\n Through galaxies, and star-crossed skies,\n\n Now distant, as the pages…\n\nOf the Scriptures, that once answered\n\n Each, and every ‘why?’\n\n In a country long forgotten\n\n Beneath a deep magenta sky…\n\nA man, Enol by name, walked wondering\n\n Along a path well-trod.\n\n In search of Life and Meaning.\n\n In search, alone, for God.\n\nThrough eons, men just like him,\n\n Had probed their wide frontier.\n\n Until their science told them,\n\n That God, was not near here.\n\nBut now his new invention,\n\n Would answer the ancient call:\n\n Where is the place that God lives?\n\n That’s if He lives at all.\n\nWithin it, he can travel \n\n Beyond his own world’s rim.\n\n He now can go inquiring,\n\n Through space, and time, for HIM.\n\nSo long, this quest may take him,\n\n He cannot not hope to stay\n\n In body, as he has been.\n\n Instead, he must away…\n\nWith all his limbs and organs,\n\n Except, for his own brain\n\n Which, connected to the craft,\n\n Alive, will ever now remain.\n\nSuch eternity, he knew\n\n Would not permit a mind\n\n To continue living rationally\n\n Without members of his kind.\n\nSo in there, bound inextricably\n\n While traveling all alone,\n\n The computer, to his brain can give:\n\n Pictures, of his home.\n\nEach sense was simulated:\n\n Sight and sound, and even smell.\n\n With touch, and taste, and\n\n Feelings too, that he knew so well.\n\nHis body too was given back,\n\n As in a vivid dream.\n\n With every breath, just as before,\n\n And heartbeat, strong and keen.\n\nAnd looking down, he saw again\n\n His limbs, extending forth.\n\n Striding along a country lane,\n\n As the sun set… in the north!\n\nSo real for him, it made the world\n\n His mind tossed fore and aft.\n\n Was he still upon the globe;\n\n Or now, inside his craft?\n\nThen hasty memory brought to him\n\n Once more, and in some pain;\n\n He was a ‘living man’, no more.\n\n But, an ‘encapsulated brain’.\n\nIn melancholy mood, he soon\n\n Perceived a strange rapscallion.\n\n A holograph of man, called Gizmo;\n\n Who was seated on a stallion.\n\nTo Gizmo, each command, he’d give.\n\n Who, just as it was made;\n\n Took action hard upon it…\n\n To do, as he was bade.\n\nCommunicating thus, with the craft\n\n With whom he’s one.\n\n He spoke a single word — Begin.\n\n So simply, it’s begun.\n\nTime and Space, made Point and Nought.\n\n And all direction banished.\n\n To this centre, went his ship,\n\n And in a moment vanished.\n\nThen outward, into Time and Place\n\n And back again, he’d travel.\n\n In systematic search, for God\n\n Who’s mystery, he’d unravel.\n\nTo pass the time, Enol at first\n\n Lived out a pseudo life;\n\n A play, he knew for certain,\n\n Could cause him little strife.\n\nBut through the years, the task grew dull.\n\n For, there never was a sighting.\n\n So Enol turned his Gizmo\n\n To something more exciting.\n\nIn deep insight, he one day thought\n\n To make the play more real;\n\n By blocking out his memory\n\n Of encapsulating steel.\n\nCommanding thus his Gizmo,\n\n To hide his true identity.\n\n Enol at once, seemed to become\n\n A separate living entity.\n\nHe walked his homelands; and if asked,\n\n This body is myself, he’d say.\n\n For, with memory of the craft now gone;\n\n He seemed, no longer in a play.\n\nBut when the body tired\n\n As it was made to do;\n\n ‘Enol’ would sleep, and as he slept\n\n The truth would come anew.\n\nNo body have I, any more.\n\n It is just a play of senses\n\n That Gizmo makes within my brain,\n\n Creating life’s pretenses.\n\nThrough the ages, Enol searched;\n\n But dead-ends were ever rife.\n\n When at last, the idea came;\n\n To diversify his life.\n\nAs well as being Enol,\n\n As he had always seemed to be,\n\n He’d have Gizmo give him memories,\n\n And sensations, so he’d see:\n\nAnother form, with different thoughts\n\n And feelings, in the flesh.\n\n Each part, thus in the play, he’d take;\n\n Re-playing it, afresh.\n\nSo in this Play of Life, he lived.\n\n He fought, and died there too.\n\n He’d feel the sword thrust into him.\n\n The searing pain, cut through.\n\nBut as he died,\n\n He’d wake again, to the living Truth\n\n It was just a silly game, no more.\n\n His consciousness was proof.\n\nIn playing out another life, he’d be\n\n In battle, strong and fierce.\n\n And raising up his sword\n\n He’d this time, Enol pierce.\n\nThe sword jarred in his arm.\n\n Enol, dead at his feet.\n\n The passion in his blood ran strong.\n\n The victory, it was meet.\n\nBut as he died, Enol at once recalled\n\n It was just a game, and he a silly sod\n\n Who had temporally forgotten\n\n His search for truth… and God\n\nScientists, created in the play\n\n Were disdainful, and quite terse\n\n When questioned ‘bout the cause\n\n Of the known, Universe.\n\nThey examined all phenomena\n\n And discovered many laws.\n\n Which they proved beyond all doubt\n\n Were the ultimate first cause.\n\nWith instruments and theories\n\n They mapped the world they knew\n\n In which no spirit essence,\n\n Showed itself, as being true.\n\nFor, in opening up each object,\n\n It was clear, for them to see\n\n That its inner workings\n\n Were, of Spirit, simply free.\n\nYet, ‘twas only ever Enol’s brain\n\n aware of ‘their’ conclusion…\n\n Of the laws that programmed\n\n (Not the Universe), but his own illusion.\n\nWhile in the play, he never guessed\n\n It was his brain, and his machine\n\n That gave consciousness to see\n\n All that was, by each man seen.\n\nParadise, when gone beyond,\n\n This too, by him was known\n\n And gods, and ‘spheres’ — to Enol’s brain\n\n All happenings, were shown.\n\nThen playing out a life of crime\n\n Enol, was shot one day\n\n And instantly transported\n\n To the realm where he should pay.\n\nIn concentrated pain\n\n And horror, unrelenting\n\n The memory at that moment\n\n Left no room for his repenting.\n\nIt seemed, in just that instant\n\n He had ever been this way…\n\n And ever onwards, in the future\n\n He’d be bound, in pain, to stay.\n\nThat fleeting thought,\n\n Encompassed in his brain,\n\n Was the measure of eternity,\n\n In the moment he was slain.\n\nThe dreadful certainty\n\n That this was hell indeed\n\n Transfixed his very being.\n\n Of nought else, could he take heed.\n\nDo not doubt; his hell was real.\n\n His sentence, it was spelt.\n\n He did not have to mock\n\n Or feign, the agony, he felt.\n\nHow long it lasted,\n\n Who can say.\n\n A moment, or a thousand years,\n\n Or just a single day?\n\nBut, as moments do;\n\n This one, too passed –\n\n Death died.\n\n And in the pit, was cast.\n\nReturning to himself at once\n\n His pain, by joy was soon replaced.\n\n For, in the mirror of his mind,\n\n His consciousness, he faced.\n\nEnol could not, his own brain sense.\n\n For, body-less and bound\n\n He had no means to touch, or see it.\n\n His state, it was profound.\n\nMemory alone remained in him\n\n Which told of his condition;\n\n When wide awake inside the craft –\n\n Controlled by his volition.\n\nEnol knew, when then aware\n\n He was both victor, and his victim.\n\n It did not matter how he lived, or died.\n\n Till, one day, Gizmo tricked him.\n\nGizmo played out a different game\n\n In which each new life that Enol saw\n\n Depended on the thoughts, and acts\n\n That proceeded from the one before.\n\nAs Gizmo set the play in motion,\n\n Enol was bound to follow fate.\n\n His every thought and act, dictated\n\n Each life played out, to its due date.\n\nGizmo never gave him peace.\n\n Round and round, was Enol tossed.\n\n From life to life an endless quest –\n\n All knowledge of himself was lost.\n\nBut truth to say, ’twas Gizmo tricked.\n\n From the first, it was of Enol’s making.\n\n He alone chose, and pre-programed\n\n The time, of his own waking.\n\nOnce in a thousand years, or so;\n\n He’d step ‘outside’ the play.\n\n Though taking part, still as a man\n\n He’d speak the truth, and say…\n\nTo each one that he met: This is a dream,\n\n I am not real, I have no life, but yours.\n\n Do you not know, that we are one,\n\n Who are the final cause?\n\nBut most people would not listen.\n\n For as such, it was planned.\n\n So the dream would not end quickly,\n\n Few could understand.\n\nEnol it was, in every age\n\n Who all believers chose.\n\n He alone decided, to whom\n\n The truth, he would disclose.\n\nAnd for the ‘unbelievers’,\n\n He destined suffering, and pain.\n\n But as the subjects of his wrath,\n\n Who were they, to complain?\n\nThe parts they played\n\n Were ephemeral, and unreal.\n\n ’Twas Enol who in truth, suffered\n\n Each, and everyone’s ordeal.\n\nThe lives that he commanded\n\n Were full of pain, as much as pleasure.\n\n But the joy that Enol knew, on ‘waking’,\n\n Was far beyond, all other measure.\n\nHis mind, at once filled full\n\n With the knowledge of himself –\n\n Eternal and Unchanging, \n\n Full of Power, and of Wealth.\n\nA mighty laugh rang out –\n\n Sending ripples through his mind\n\n As he recalled the moments when\n\n Life, had seemed unkind.\n\nThen came a time not in the play\n\n When his craft, was subject to attack –\n\n From forces beyond reckoning,\n\n Which from his senses, brought him back.\n\nAnd there, in the centre\n\n Of his ship, now wide awake.\n\n He felt the thunder bolts of force\n\n That made his very being quake.\n\nThe heat became unbearable,\n\n As it seared his living brain.\n\n Until at last, his ship destroyed;\n\n He melted with the pain.\n\nSo ends this story, of a man –\n\n Called Enol, if One willed.\n\n But as the ship blew into bits\n\n No life, was thereby killed.\n\nTime and Space, made Point and Nought.\n\n And all direction banished.\n\n To this centre, Enol went\n\n And in a moment vanished.\n\nA laugh rang out,\n\n Though not through air,\n\n Or Brain, or Mind…\n\n Or, anywhere.\n\nNo time, or place, then did remain\n\n But Life, which of itself, my son\n\n Knew of itself…\n\n As simply One.\n\nNo Enol had walked wondering,\n\n Along that path, well-trod.\n\n As it ever has been…\n\n The walker, S/He is God.\n\nAnd so Dear One recognise your ‘no-face’, which looking out, itself can never be seen. This clear space in which the whole world appears is the ‘Single Eye of God’.\n\nNotice that all apparent beings have heads.\n\nBut in looking, now notice where ‘your’ head should be…\n\nThe whole world appears!\n\nThe body is apparent (when it is apparent) as a foreshortened image of only the front of the torso and limbs.\n\nSeeing-colours, Hearing-sounds, Feeling-feelings, Tasting-flavours, Smelling-odours, Knowing-ideas (number, form and meaning) and the Power to manifest these into meaningful patterns that appear as ‘my body’ and ‘my feelings’ and ‘my thoughts’ and ‘my surroundings’… as in a dream.\n\nImpossible to know the nature of this Consciousness.\n\nThis never-ending story is just a game in which there are no ultimate winners… or losers. For nothing ever really changes… ever.\n\nThis is the same truth told in all great religions:\n\nOne (Consciousness) alone Is. All else is a dream :)"
    },
    {
        "url": "https://medium.com/@m.haines_81949/whats-wrong-with-crypto-currencies-and-how-to-fix-it-fe7a22438b55?source=user_profile---------6----------------",
        "title": "WHAT’S WRONG WITH CRYPTO-CURRENCIES — AND HOW TO FIX IT",
        "text": "Most articles on the benefits of Bitcoin (and their ilk) conflate the ideas of ‘commodity’ and ‘money’.\n\nCommodities (like gold) have their own intrinsic value.\n\nContrary to the ideas behind Bitcoin, money works best when the token that represents it has no value itself.\n\nHistorically, money was (and remains) a ‘record of debt’, first transcribed on clay tablets and later as an amount (the face value) on metal coins (the tokens), as well as via many other media, including shells, sticks and stones.\n\nThe debt (as evidenced by the face value of the token) is owed by society to the holder of the money.\n\nWhat the seller gets in return is nothing of value. They simply get a bit of metal or paper or an electronic record (that we call ‘money’) which is nothing more than information about the value the seller has provided to a member of society.\n\nThe form of the record is determined by the community where it is accepted.\n\nIt records the debt that all members of the society then owe to the holder. In effect, we collectively promise to give back real value (in the form or goods and services), equal to the value that the seller has contributed to one of our own — NOT MORE OR LESS.\n\nAs a corollary, it represents a right by the seller to claim resources from society. It also gives the seller the means to ‘vote’ for what they want produced to meet their needs. No money, no vote.\n\nFor this to work, the token representing the ‘record of value’ (money) should be without value.\n\nIf you conflate the value of the token (say gold) with the value of the debt (the face value of the money), it can lead to hoarding (when the value of ‘material’ in the token exceeds its face value).\n\nWorse, conflating the token with its face value completely negates the basic principle of money that you should only be able to take out of society what you put in. It also makes it impossible to account the profit and loss on the sale of goods and services.\n\nA few years ago someone paid 10,000 Bitcoins for a couple of pizzas worth $40 (the real value of the transaction). Today, for doing nothing but holding the record of value (10,000 bitcoins), the seller could take back out of society $20 million of goods and services. This is a preposterous result, due solely to a perceived increase in the value of the token!\n\nIf the seller contributed $40 value, they should get to take out $40 value (in real terms) whether they spend it immediately or at any time in the future.\n\nOn the other hand, if the ‘value’ of Bitcoin again collapses (as it surely will), those who gave good value for it, will find they cannot get back the same value from society.\n\nSociety cannot function on this basis.\n\nBitcoin and its ilk are a disaster waiting to happen.\n\nThis is not to say the current monetary system is without major flaws.\n\nFortunately, a new crypto-currency is evolving that will act as true money, that will have none of the flaws of the current system or of the existing crypto-currencies.\n\nThe value of these new electronic tokens will be zero.\n\nWhat they will do is act as a stable ‘record of value’ for each transaction, so people can take out of society what they put in (not more or less) — whenever they choose to spend.\n\nIt will enable everyone to confidently account the profit and loss on the goods and services they buy and sell, without having to consider the impact of currency trading.\n\nHolders will also be assured that their record cannot be counterfeited, lost, stolen, destroyed, duplicated or negated — making collapse of the payments system impossible. But that’s another story in the making :)"
    }
]