[
    {
        "url": "https://medium.com/@kevalpatel2106/ai-launcher-the-beginning-7b2f035be332?source=tag_archive---------0----------------", 
        "text": "“Machine learning is a type of artificial intelligence (AI) that provides computers with the ability to learn without being explicitly programmed.”\n\nWhen I heard about this I was amazed and was thinking about what can we do by using machine learning. I decided to make an android application that can use machine learning techniques to understand user’s preferences and current context to take useful actions according to current situation.", 
        "title": "AI Launcher - The Beginning – Keval Patel –"
    }, 
    {
        "url": "https://medium.com/@MichaelTeifel/my-process-for-learning-natural-language-processing-with-deep-learning-bd0a64a36086?source=tag_archive---------1----------------", 
        "text": "I currently work as a Data Scientist for Informatica and I thought I’d share my process for learning new things. Recently I’ve been wanting to explore more into Deep Learning, especially Machine Vision and Natural Language Processing. I’ve been procrastinating a lot, mostly because it’s been summer, but now that it’s fall and starting to cool down and get dark early, I’m going to be spending more time learning when it’s dark out. And the thing that deeply interests me is Deep Learning and Artificial Intelligence, partly out of intellectual curiosity and partly out of greed, as most businesses and products will incorporate Deep Learning/ML in some way.\n\nI started doing research and realized that an understanding and knowledge of Deep Learning was within my reach, but I also realized that I still have a lot to learn, more than I initially thought. So I did what any person does when they want to learn, I went to the library…I’m just kidding this isn’t 1995. I found a graduate level standord course that had class materials available for free online. http://cs224d.stanford.edu/.\n\nI went straight to the syllabus and checked the prerequisites. Then I started going through the course material. I decided I needed to take the prerequisite courses in order to understand the material best. I needed Linear Algebra, and Machine Learning knowledge and a knowledge of Convolutional Neural Networks. So here’s the curriculum I put together that will work for anyone with a serious interest in deep learning.\n\nIm gonna be going through this during my nights. I’m hoping to have a solid understanding of the concepts by January. That will provide me with a base to work on other projects that I have dreamt up that require Natural Language Processing.\n\nAlso a note on my learning style, I prefer to learn in a self paced manner, so when given the choice I will choose the Stanford courses over Coursera as the latter are released in weekly sections and Stanford courses are available all at once.", 
        "title": "My Process for Learning Natural Language Processing with Deep Learning"
    }, 
    {
        "url": "https://towardsdatascience.com/deep-wide-cheap-machine-learning-905437615c09?source=tag_archive---------2----------------", 
        "text": "Among competing hypotheses, the one with the fewest assumptions should be selected. The above quote is translated interpretation of Occam’s razor from Wikipedia. It is also a basis of a common principle in design of computer systems, analytic modeling and in general systems engineering. In other words: Simple beats Complex. However, in the technology, data, analytics ecosphere we (and I include myself) have a fascination with the shiny new things. Partially because hot, buzzy, shiny things get massive attention and we have seen in recruiting and jobs that having the latest bleeding edge technology expertise on your resume is like honey to the recruiting bees (and that extends to inflated compensation as well). It’s a cycle! Companies and Recruiters wants shiny and buzzy technology skills and candidate gravitate towards shiny and buzzy technologies to prime their resumes. What is lost in this hype cycle is simple beats complex, the old stand by that works and is easily explainable is pushed aside in favor of the latest and greatest — and complicated.\n\nThe big takeaway here for any professionals in the analytics & data science world faced with a business problem: apply simple over complex — first! It does not mean don’t look to learn and keep up with latest techniques, technologies, methods and applications. In a recurring talk on Cheap Learning, Ted Dunning walks attendees through several examples of cheap learning techniques that solve big problems, of note — Data Exfiltration Cyber Attack, Merchant Financial Services Fraud. In those examples, Ted showed how using large scale data analyses using arithmetic and basic algebra can yield remarkable effective results. The main takeaway from Ted Dunning’s talk was that using cheap learning techniques we can lower the tree to increase the low hanging fruit from the tree of business problems. He suggested using the combination of large data sets, scalable architectures and simple math to solve problems. Once the low hanging problems on the lowered tree are solved, then only go after the higher levels of the tree to solve the impossible to hard problems using some of the more sophisticated and emerging methods. Another perspective(pdf) on the topic comes from Xavier Amatriain, he recommends a balanced view on how to solve the hard problems and not overlook the tried, tested and proven techniques in chase of the shiniest and newest approaches. Some examples of anti-patterns he gave were ignoring the metadata features and jumping directly into the feature learning from images for activity identification. Another anti-pattern was not using ensemble methods and simpler explainable models in favor of complex multi-layer networks. Beware of complex models that only a handful of experts on the planet can decipher.\n\nSummarizing perspectives from both leaders in the Analytics field, here are some concepts to keep in mind while jumping into the world of complex models and cutting edge machine learning, deep learning and artificial intelligence domains: Feature Engineering may be burdensome but architecture engineering can be out right alchemy. If you get stuck in a bleeding edge problem, you may be alone, so be prepared and plan for deep dive time. Model, Algorithmic and Outcomes explainability is important particularly in highly regulated fields and even in other fields it is an ethical responsibility.\n\nGiven these caution signs, there is no reason to walk away from the immense progress being delivered from the field of complex modeling — deep learning. There is a best of both worlds approach here and that is Deep & Wide Learning. Simply put use Deep Learning where feature ambiguity exists combine it with wide learning to solve problems with features providing high predictive power. Deep and Wide learning may also help with some cold start problems when dealing with small data sets. For further reading on Deep & Wide Learning, I suggest you take a look at this very readable article from Google Research on this topic. If you liked reading this article and are curious about how to introduce AI & Deep Learning in your enterprise, please read my article on Analytics Automation.", 
        "title": "Deep, Wide & Cheap Machine Learning –"
    }, 
    {
        "url": "https://medium.com/@annebot/machine-learning-meets-seo-848e2e0aee9f?source=tag_archive---------3----------------", 
        "text": "Did you ever think you’d live in a world where the foxiest job title was “Data Scientist,” people who build “models” all day? Well, Weird Science has come to pass. This is our new and very exciting reality. Knowledge and experiences are wrapped together for a new set of challenges, from data scientist to developer to marketers.\n\nLast year’s news that Google was using a new machine learning tool called RankBrain — used to contribute to its search engine results — caused a kerfuffle in the SEO world, leaving us wondering just what kind of impact it would have.\n\nIn general, it seems like the tech industry is feverishly hot on both bots and machine learning (ML) lately. Thousands of data scientist positions are open for hire in Silicon Valley alone. Bots are actually a subset of machine learning called NLP (natural language processing), and the world is buzzing about them.\n\nIt is my belief that both AI-bot and ML trends will continue to have substantial yet intriguing impacts on SEO in the years to come.\n\nBut the real story isn’t so much about RankBrain, which is just one of several filters Google applies, as what Google is doing with machine learning in general. To understand how this will impact SEO, we need to understand what machine learning really is.\n\nThe original definition of Machine Learning is:\n\nMachine learning (ML) is not new as a field. It was first proposed in 1959 as “the ability to learn without being explicitly programmed.” The long and the short of it is that ML, while old, is also the new trend du jour.It’s where machines can predict using data models. Data models learn from data. Data is being produced from all sides by the gigabyte… That’s a major reason why Data Scientist will remain the sexiest job title for a while.\n\nMachine learning is more of a statistics-based approach to AI than a lot of people are used to. “Classic AI,” the type that people think about when they think of the horn-rimmed glasses wearing, pocket-protector bearing, MIT or Caltech classic nerd, is about as hip as the outfit they’d be wearing.That was known as “Symbolic” AI, because symbols were used for concepts, and many researchers thought the brain itself was structured this way. Neurobiologists actually joined the party in the 1990s; the field is called Computational Neuroscience — fancy!\n\nML also applies to people who are accessing data on the internet. You know that any networked GPS game (like Pokemon Go, perhaps) is a geo-specific search, possibly geo-spatial. Geo-spatial means coordinates mapped onto a sphere, with a height component. It’s increasingly common for databases to include geo-search capacities right in their query languages (for example, PostgreSQL stands out here).\n\nOK, so what does ML mean to SEOs? Keywords will become less effective over time. Keywords are the SEOs most influential friend right now, and a lot of less knowledgeable SEOs rely on them exclusively (to the detriment of themselves and their clients).\n\nGeoff Hinton and Jeff Dean at Google have said that algorithm updates Panda and Penguin were based on machine learning systems they designed. The arms race of search algorithms is guaranteed to always put pressure, even the vanguard, to constantly innovate.And as the core ranking systems of search engines get updated with newer systems, they will continue to get exponentially smarter. SEOs themselves should not become machines, but they must harness them.\n\nWith that in mind, it seems clear that Google’s ultimate aim is to apply machine learning so that its search algorithms will be able to learn and update themselves automatically, and it’s here where the real impact will be felt.\n\nThe most noticeable impact, from SEO’s perspective, is that there would likely be much fewer updates such as last year’s “Mobilegeddon” when Google started ranking sites on smartphones and tablets according to their “mobile friendliness.” That major update was implemented by humans, and happened suddenly and all at once. With a machine learning-based search algorithm, it’s likely to evolve more gradually instead of making such sudden changes.\n\nAside from that, machine learning should be a welcome boon for reputable SEOs, as it will effectively give them a license to continue doing the good work they’ve already started. Google has long stated it requires two things from websites — that they meet its technical requirements, and they also serve as great resources, which means they should contain lots of relevant and knowledgeable content.\n\nGoogle has always said that websites should first and foremost try to serve up useful content, instead of just keyword-stuffed fluff. It’s likely that machine learning will soon make it even more critical that those requirements are met. Indeed, the evidence suggests that keyword stuffing has already become much less important, as a recent MarketingProfs study points out:\n\nSEOs have long used keyword targeting as a central part of their strategies, but with the introduction of machine learning, keywords simply won’t be necessary anymore. Machine learning means Google will be better be able to understand which are the most authoritative sites for any search phrase, regardless of if they actually use that specific phrase or not, because it will soon be able to understand the actual content on each site.\n\nThere’s a reason why Google keeps on pumping out major updates such asPanda and Pigeon. And it may come as a shock to some, but Google doesn’t do it just to frustrate SEOs (that’s just a bonus for them). Rather, it’s all about Google cementing its dominant market share in search, by serving up the best possible results for customers, so they don’t need to look elsewhere. Every single algorithm update has been done with this goal in mind, and the introduction of machine learning has been done for the same reason. Indeed, every search is individualized now, so that when you see results, they are unique to you, but you don’t know why.\n\nAs such, maybe all SEOs need to worry about is ensuring their websites are packed with high-quality content that users want to reach and share with their friends. No matter what role machine learning comes to play in Google’s search rankings, that will never change.\n\nDeep learning is a mix between a buzzword and a concept. The learning part is straight out of AI research and refers to Neural nets. These are data structures that mimic physical neurons in order to simulate brain-like functioning. Recent computing advanced such as cheaper Graphic Processing Units (GPUs) have enabled stacking of neural nets into layers, or even layers or layers. That’s where the deep comes from. Of course, since the field has been around for a long time, the inside joke is that deep learning is really deep marketing.\n\nWe dream of machines coming to their own conclusions, yet we fear it at the same time. The funny thing is that ML is not new, nor is it truly automated. Humans still need to engage heavily in training machine learning projects (for now).Self-directed algorithms are a booming field of research, but humans still have to set the parameters.\n\nIn search marketing, we’re constantly looking at how people try to find things they need. Search algorithms have always been and always will be at the core of AI research.\n\nIn Orwell’s 1984, history was constantly rewritten so that the victors would always find the “right” information in a SEARCH. Studying your potential searchee means following more than keywords, it’s looking at different places and formats. Recent research data indicates that voice search, longer question-style queries are dramatically on the rise.", 
        "title": "When machine learning meets SEO – annebot –"
    }, 
    {
        "url": "https://medium.com/@itsquiz15/gaining-a-basic-understanding-of-the-subject-1614054d4c4e?source=tag_archive---------4----------------", 
        "text": "Acquisition of basic information appears when we help learners to notice the connection between different items, understand the significance of the subject, provide useful communication, feedback system, and possibility to ask questions and take part in the education process. Productive presentation of the knowledge and engagement are necessary to lead the students in the learning. The teacher needs to appeal to the students’ curiosity and challenge them to explore new areas and become productive.\n\nThere are 3 main types of knowledge: content, pedagogical content, and curricular knowledge. The educator has to deliver all these 3 kinds of knowledge to the audience through understandable language or performance. Build education process as learner-centered and capture the attention.\n\nDeep understanding appears when knowledge is structured around the core principles. Emphasize the key ideas and help students to see the similarity with the other issues of the subject. Teach learners to structure their increasing body of content knowledge in accordance with the most valuable principles. Design your course to create in learners the capability to recognize features of any question to the deeper understanding and build the foundation of the discipline. Make clear how each topic fits in the course by emphasizing the role of the each component of concepts and the connections among them.\n\nStudents frame meaning for a new idea by connecting it to ideas they already know. Research figured out that successful education includes linking new knowledge to the past experience. It demands conceptual change and the development of integrated knowledge structures. Students tend to build interpretations that agree with their own prior knowledge. So, lecturing to the audience is often an unproductive tool for creating conceptual change when learners disagree with the material. Effective education includes assessment what students already know about a subject. When students’ prior knowledge involves misunderstanding, there is a need to rebuild entire framework of concepts. Productive training has to find those misconceptions and eliminate them and move on. To be successful in advanced study, students must have gained a sufficient knowledge base that involves all the types of knowledge that we’ve mentioned.\n\nFocus the students on the learning task by starting with a question and connect the topic with the real world situations. The most effective motivational strategy is adaptation the education to the learners’ needs and preferences, the relevance of the information, possibilities for success. The intrinsic motivation appears according to the learner personal efforts in the course. Students will acquire knowledge through their own contribution. Through the lecture, the learner has little investment in the learning and unproductive outcome.\n\nProvide practice and feedback. Practice is the use of the principles in conversation and other learning activities. The more principle is used in future practice, the stronger the neural connections, and the simpler it will be to recall and implement the knowledge. Research has shown that many learners broke down to recognize that learned skills to implement in the real world situation. But the more students practice, the higher the probability that they will succeed in it.\n\nPractice and feedback may be performed in many different ways, from collaboration to web-based tutorials and assessments. Engaging activities are useful where the learners generate examples of the principles, illustrate with their own infographics or maps. After this practice, give students feedback and adjust their understanding.\n\nThe more freedom will you give to the students in deciding when and how to learn, the better will you get the result. Students have different approaches and learning styles that are a function of the cooperation between their characters and their prior experiences. Teachers need to be sensitive to such differences so the education and course materials will be relevant to learners’ styles.\n\nInclude differences among students in the plan of appropriate assessments. Students with different learning styles demand a variety of opportunities to be evaluated. It may involve concept maps, writing, quizzes, speaking, project development and so on. They may demonstrate understanding through extrapolation which includes the predictions based on their knowledge.\n\nThe learners may have little experience with the content knowledge and they cannot have good learning skills, so it is important to keep track of their progress. Non-graded assessments will be most productive in empowering learning. Use surveys to ask learners to estimate their knowledge and about their skills. Also, you may apply online quizzes to see immediately the level of student understanding.\n\nBuild education process as learner-centered and capture the attention. Effective education includes assessment what students already know about a subject. When students’ prior knowledge involves misunderstanding, there is a need to rebuild entire framework of concepts. Productive training has to find those misconceptions and eliminate them and move on.\n\nFocus the students on the learning task with the motivation that appears according to the learner personal efforts in the course. Students will acquire knowledge through their own contribution. Provide practice by using the principles in conversation and other learning activities. Engaging activities are useful where the learners generate examples of the principles, illustrate with their own infographics or maps. After this practice, give students feedback and adjust their understanding. Also, let the students choose the learning styles to increase their engagement.", 
        "title": "Gaining a basic understanding of the subject – Itsquiz –"
    }
]