[
    {
        "url": "https://medium.com/@ChiefScientist/does-syntax-really-exist-7e491d54f234?source=tag_archive---------0----------------", 
        "text": "At the recent EMNLP (Experimental Methods in Natural Language Processing) conference in Lisbon, I’ve reconnected with a whole bunch of folks from my UPenn group, including Jason Eisner, who leads a strong NLP group at Johns Hopkins university. Inevitably, the discussion turned to Deep Learning. Yoshua Bengio, one of the trailblazers of the current research directions, was keynoting the conference. In Deep Learning, you feed massive amounts of data to the beast (a machine or a cluster of machines, often armed with number-crunching GPUs), and it finds the appropriate representation, or model, for your problem. Computational linguists, and simply linguists before them, spent years hand-crafting various formalisms, such as grammars, to describe how language works. Some of those grammars employ complex logic rules, such as lambda calculus, to ascribe meaning to the atoms of language in a composable manner, and then use the machinery to compose top-level meaning from lower-level ones. These grammars can be used in applications such as Machine Translation. They would reorder words in when going from the source language according to the rules of the target language using mappings between grammars, or generating output from the formal intermediate representation built using the hand-crafted systems of comprehending language. But Deep Learning techniques will produce an output of comparable quality without having humans to teach them any grammar.\n\nWhen we talked with Jason about it, in a delightful seafood restaurant in Lisbon — where things are open late so all NLPers could go eat after the welcome reception where only small sweet yellow cylinders where served — he took a napkin, and drew two sequences. One read, “mind=>language=>behavior”, and the other, “mind=>behavior=>language”. Jason asked, does our mind generate behavior directly, or is it mediated via language?\n\nWhich struck me as a profound challenge to our formal systems of language. They started to look like models of the brain from previous centuries. Those models are largely speculative; we only understand only a few entry levels of the actual wet neural networks, e.g. visual cortex, recognizing edges, their orientation, and motion direction. Is syntax such a crude approximation of a very complex process emitting language?\n\nPerhaps, by feeding all the language available on the web and in digital form to the novel Deep Learning algorithms, we’ll discover better representations of the intelligence processes generating it. In fact, I’m sure we will. The models would probably make grammars we built up to know look like counting stones. And those representations might end up being AI.", 
        "title": "Does Syntax Really Exist? – Alexy Khrabrov –"
    }, 
    {
        "url": "https://medium.com/@AeronComposite/why-fiberglass-gratings-are-selected-range-of-products-for-factories-and-food-industry-bd60d3f0fa24?source=tag_archive---------1----------------", 
        "text": "Why Fiberglass Gratings Are Selected Range Of Products For Factories And Food Industry?\n\nGratings made of fiberglass and resin amalgamated are out of the ordinary and complicated range demanded by majority of the manufacturing clients crossways the world.\n\nWhy #Fiberglass #Gratings Are Selected Range Of Products For #Factories And #Food #Industry?", 
        "title": "Why Fiberglass Gratings Are Selected Range Of Products For Factories And Food Industry?"
    }
]