[
    {
        "url": "https://medium.com/@awjuliani/simple-softmax-in-python-tutorial-d6b4c4ed5c16?source=tag_archive---------0----------------", 
        "text": "Softmax regression is a method in machine learning which allows for the classification of an input into discrete classes. Unlike the commonly used logistic regression, which can only perform binary classifications, softmax allows for classification into any number of possible classes. In this post I walk through the construction of a basic softmax classifier using python and ipython notebook. I show how to conduct digit recognition on the MNIST database, but the code can be applied to any number of machine learning problems. Feel free to reuse this code wherever may be helpful!", 
        "title": "Simple Softmax Regression in Python — Tutorial – Arthur Juliani –"
    }, 
    {
        "url": "https://medium.com/@gitter/building-online-communities-deeplearning4j-c8fe2008559f?source=tag_archive---------1----------------", 
        "text": "We asked Adam & Chris, the founders of Deeplearning4j — first commercial-grade, open-source, distributed neural net library written for Java and Scala, with one of the most active communities on Gitter — to share their thoughts, experiences and lessons learned on open source community building. Find out what they say and check out the deeplearning4j channel on Gitter.\n\nTell us about a little bit about yourself and the Deeplearning4j community. How did it all begin?\n\nWe started building Deeplearning4j in late 2013. Adam had been involved with machine learning for about four years, at that time, and deep artificial neural networks were looking more and more promising. The first network in Deeplearning4j was a restricted Boltzmann machine, since that was the net that Geoff Hinton had come up with back in 2006, which was the turning point in the field. I was working for another startup doing PR and recruiting, and had previously worked as a journalist, so I took care of the documentation (and still do), since we believed that proper communication was key to making open-source code valuable.\n\nWhat are they main issues discussed in the deeplearning4j channel?\n\nThe main issues used to be installation. Engineers in the community taught us a lot about how to write clearer instructions, and how to make the code and experience better. If we hadn’t had that feedback loop, Deeplearning4j would be worse. Open source communities are an amazing for quality control! The sooner you fix an issue, the less demands you get from the community about that issue. It’s a great incentive to move quickly.\n\nNow the main issue is loading data and neural net tuning. We are working on communicating better about that, and about making the framework better, so that ETL and tuning get easier. Finally, there are a lot of basic questions about machine- and deep-learning. Many software engineers have figured out that deep learning and machine learning are really powerful tools, so they’re trying to grasp new ideas. We’ve written a lot of introductory material, and we point them to various web pages where those ideas are explained.\n\nWhat common goals do you have as a community?\n\nThe community is centered around Deeplearning4j and our scientific computing library, ND4J, which powers the neural nets. So we answer questions about how to use the libs, and in the process, we help people understand more about deep learning in general. It’s not a deep learning hotline, unfortunately, so there are some questions we don’t tend to answer. But we do help engineers in the DL4J community build apps and understand how neural nets work. The common goal is to learn about deep learning, and to build cool shit. We’ve only seen the tip of the iceberg in terms of what deep learning can do. So far, we’ve seen huge advances in image recognition, machine translation, machine transcription and time series predictions. By many metrics, machine perception now equals or surpasses human perception, and that will change society in ways that are hard to imagine. Those changes just haven’t been implemented yet. So the secondary goal of the community is to bring this narrow form of AI into the world, so that it can make a difference.\n\nWhat are the most important factors that you have taken into account while creating and maintaining the community? What factors contribute to the success of your community?\n\nCreating and maintaining a community is a huge commitment of time and effort. You have to be available, and you have to try to understand where other people are coming from. They don’t always know the jargon to ask precise questions, so you have to have the patience to figure out together with them what they’re trying to ask, or where they’re stuck. We’re not always as patient as we should be. Being available, making that effort, and offering support for powerful tools like this are a good way to build a community. When the makers of a big project are available to answer esoteric questions about how it works, that creates a lot of trust, because people know that you speak with authority and that if something is really broken, it’s going to get fixed. There’s a tight feedback loop between the community and the project creators.\n\nWhat are the key challenges that you encounter while managing the community?\n\nOne of the challenges is: What questions do we care about, and what questions do people need to answer for themselves? If someone has really basic questions about Java, an IDE like IntelliJ, or a build tool like Maven, most of the time they need to figure that out for themselves. Our Gitter channel isn’t the right place to hash through that, although we do help in special cases, because sometimes you need to expand your heap space for neural nets to work.\n\nYou also have to find a balance between building the community and building the product. Ideally, you’d have a big team with full-time support engineers and the rest of the team working on the code base. But most open-source projects have very small teams. There are just a handful of people capable of support, and they’re the ones who also should be fixing bugs and adding features.\n\nHow do you encourage participants’ commitment and contribution to the community?\n\nYou create a smart, friendly environment in the community. You remind them you appreciate contributions, and you show them, as best you can, what needs to be worked on. We created top-level files recognizing our contributors, showing people how to contribute, and laying down the rules of the community. We also wrote a devguide, and we now label all issues as bug, enhancement or documentation, so that people can scan the queue quickly and explore where they can add something.\n\nTell us a little bit about the time commitment required to set up and establish the community. How much community maintenance is required on an ongoing basis?\n\nSkymind is a distributed team, with engineers in Australia, Europe and the US, and Deeplearning4j community members in almost every time zone. There’s a Skymind engineer watching the Gitter queue probably 12–16 hours out of any weekday. This is a pretty serious commitment, because there are less than 10 of us. It’s not their full-time job, but maybe they’ll be running unit tests and answering questions on Gitter in their downtime.\n\nBased on your experience, do you feel that the open source communities have changed and evolved over the past years? If so, how?\n\nOpen-source is winning the enterprise stack, so it’s a lot more important than it used to be. The biggest organizations in the world are running on open-source software. Linux won the operating system, Hadoop won big data storage. And open-source won because when you do it right, you get better code. More eyeballs mean more uptime. So the size of the OSS community, and the quality of attention that software engineers bring to open-source projects, have both increased over the years.\n\nWhat advice would you give to someone who wants to start an online open source community from scratch?\n\nFirst, build something neat, something you care about. Focus on building one thing that works. Then, share it with people. They will help you improve it, and they may help you think about what to build next. Don’t do too much big upfront development. Try to scope it so that you can ship in a reasonable amount of time. A few weeks, say. Open-source is valuable because it’s a conversation, and the conversation leads you places, so that you and project evolve in ways you can’t anticipate. Also, by open-source early, you’re increasing your exposure and therefore your chances of getting help. We’ve had amazing developers join the community and the Skymind team.\n\nWhat digital tools do you use to help manage and grow your community?\n\nThe code lives on Github, the conversation lives on Gitter. There are about 1360 devs on the Gitter channel now, so it’s probably one of the more lively neural net conversations on the planet. Our website is hosted on Github, so the content lives there, too. We generate a lot of automatic documentation with Javadoc (always a WIP…). We ask people to use Maven as their automated build tool. One of the biggest problems with any software is the install, and Maven helps make that a little easier. You need to constantly try to clear away obstacles, so that people can just use your code and not worry about other stuff.\n\nCan you share a success story of a community member that happened thanks to their participation in your channel?\n\nFor most of the stories, you just had to be there. But in general, a lot of data scientists and Java engineers come, and they just build something for their companies that works. They’ll come back later and say: “We saw a 200% increase in ad coverage when we made DL4J part of the recommender system.” Another guy built an app with DL4J and then an investor saw it and he raised funds. So that’s all pretty cool. With open source, you’re throwing a rock out into the ocean, and you don’t always hear it hit the water. You can’t even see the ripples. So it’s encouraging when people come back and say “thanks” and tell us how it helped them. That makes it more meaningful.\n\nYou can visit the deeplearning4j community on Gitter.", 
        "title": "Building Online Communities: Deeplearning4j – Gitter –"
    }, 
    {
        "url": "https://medium.com/jornal-do-empreendedor/tecnologia-o-que-o-futuro-est%C3%A1-trazendo-f782ccf7aec9?source=tag_archive---------3----------------", 
        "text": "A indústria de computação avança em dois ciclos na sua maioria independentes: ciclos financeiros e de produtos. Tem havido uma grande quantidade de discussões ultimamente sobre onde nos situamos no ciclo financeiro. Os mercados financeiros chamam muita atenção. Eles tendem a flutuar de forma imprevisível e às vezes descontroladamente. O ciclo do produto em comparação recebe relativamente pouca atenção, embora seja o que realmente impulsiona a indústria de computação para a frente. Podemos tentar compreender e prever o ciclo do produto através do estudo do passado e extrapolando-o em direção ao futuro.\n\nHavia telefones com mais recurso na década de 90 e os primeiros smartphones como o Sidekick e Blackberry no início de 2000, mas a fase de crescimento do smartphone realmente começou em 2007–8 com o lançamento do iPhone e, em seguida o Android. A adoção de smartphones, desde então, explodiu: cerca de 2 bilhões de pessoas têm smartphones hoje. Em 2020, 80% da população mundial terá um.\n\nEssa nova arquitetura derrubou os preços dos sistemas de computação básicos de cerca de US$ 100 para cerca de US$ 10. O Raspberry Pi Zero é um computador Linux de 1 GHz que você pode comprar por US$ 5. Por um preço similar você pode comprar um microcontrolador com Wi-Fi que executa uma versão de Python. Logo esses chips vão custar menos de um dólar. Será rentável incorporar um computador em quase tudo.\n\nHá muitas coisas interessantes acontecendo em software hoje. Os sistemas distribuídos é um bom exemplo. Como o número de dispositivos tem crescido exponencialmente, tornou-se cada vez mais importante a 1) paralelizar tarefas em várias máquinas 2) comunicar e coordenar dispositivos. As tecnologias de sistemas distribuídos interessantes incluem sistemas como o Hadoop e Spark para paralelização de problemas de Big Data e Bitcoin / blockchain para proteger dados e assets.\n\nMas talvez os avanços de software mais interessantes estão acontecendo em inteligência artificial (AI). AI tem uma longa história de hype e frustração. O próprio Alan Turing previu que as máquinas seriam capazes de imitar com sucesso os seres humanos até o ano de 2000. No entanto, há boas razões para acharmos que a AI possa estar entrando em uma era de ouro.\n\nUma boa parte do excitamento com relação a AI concentrou-se em algo chamado de deep learning, uma técnica de aprendizado de máquina, que foi popularizada pelo famoso projeto de 2012 do Google que usou um cluster gigante de computadores para aprender a identificar gatos em vídeos do YouTube. O deep learning é um descendente de redes neurais, uma tecnologia que remonta à década de 1940. Ele foi trazido de volta à vida por uma combinação de fatores, incluindo novos algoritmos, computação paralela barato, e a ampla disponibilidade de grandes datasets.\n\nÉ tentador descartar o deep learning como outra moda do Silicon Valley. O excitamento, no entanto, é apoiado por resultados impressionantes na teoria e no mundo real. Por exemplo, as taxas de erro para os vencedores do desafio IMAGEnet — um concurso popular de visão de máquina — estavam na faixa de 20–30% antes da utilização do deep learning. Usando o deep learning, a precisão dos algoritmos vencedores começou a melhorar, e em 2015 superou o desempenho humano.\n\nMuitos dos estudos, datasets e ferramentas de software relacionados com o deep learning tem utilizado código aberto. Isto teve um efeito democratizante, permitindo que indivíduos e pequenas organizações construíssem aplicações poderosas. O WhatsApp foi capaz de construir um sistema de mensagens global que serve 900M usuários com apenas 50 engenheiros, em comparação com os milhares de engenheiros que eram necessários para as gerações anteriores dos sistemas de mensagens. Este “efeito WhatsApp” agora está acontecendo em AI. As ferramentas de software como Theano e TensorFlow, combinados com data-centers em nuvem para treinamento e GPUs de baixo custo de implantação, permitirão que pequenas equipes de engenheiros possam construir sistemas de inteligência artificial em state-of-the-art.\n\nAs startups construindo produtos AI terão que ficar com foco laser em aplicações específicas para competir contra as grandes empresas de tecnologia que fizeram da AI uma prioridade. Os sistemas de inteligência artificial ficam melhor à medida que mais dados são coletados, o que significa que é possível criar um ciclo virtuoso de efeitos de data network (mais usuários → mais dados → melhores produtos → mais usuários). A startup Waze utiliza os efeitos de data network para produzir mapas melhores do que seus concorrentes muito mais capitalizados. O sucesso das startups de AI seguirão uma estratégia similar.\n\nCarros. As grades empresas de tecnologia como Google, Apple, Uber, e Tesla estão investindo recursos significativos em carros autônomos. Carros semi-autônomos como o Tesla Model S já estão disponíveis ao público e vão melhorar rapidamente. A autonomia completa levará mais tempo, mas é provavelmente que não mais de 5 anos. Já existem carros totalmente autônomos que são quase tão bom quanto os motoristas humanos. No entanto, por razões culturais e regulamentares, esses carros totalmente autônomos provavelmente precisarão ser significativamente melhor do que os motoristas humanos antes de serem amplamente permitidos.\n\nA maioria das pessoas acha o Echo um chamariz até experimentá-lo sendo surpreendidos em constatar como ele é útil. É uma boa demonstração de quão eficaz os always-on de voz podem se tornar uma interface com o usuário. Vai demorar um pouco antes termos bots com inteligência generalizada capazes de realizarem conversas completas. Mas, como mostra o Echo, a voz pode ser um sucesso hoje em contextos limitados. A compreensão da linguagem deve melhorar rapidamente a medida que os avanços recentes do deep learning caminham para serem incorporados em dispositivos para comercialização geral.", 
        "title": "Tecnologia: O que o futuro está trazendo – Jornal do Empreendedor –"
    }
]