[
    {
        "url": "https://medium.com/@adrianbarwicki/smart-contracts-for-origintrail-node-pooling-c82183c5ab62?source=user_profile---------1----------------",
        "title": "Smart contracts for OriginTrail node pooling – Adrian Barwicki –",
        "text": "The purpose of this post is to outline smart contracts for OriginTrail node pooling and collect feedback from the OriginTrail community on the proposed model.\n\nIf you are new to the concept of master nodes, you may check this out.\n\nBigger rewards\n\nThe amount you stake affects how many simultaneous contracts you can service as well as the quality and price per contract you can command. Staking 1MM TRAC will make you more than staking 10k TRAC.\n\nOriginTrail tokens can be litigated\n\nTRAC tokens serve as collateral in the agreements with companies. This has both upsides and downsides. The upside is that you are expected to receive higher rewards for it. The downside is that in case of server downtime, the collateral can be fully litigated. This can possibly exclude non-technical persons that want to be part of the OriginTrail ecosystem.\n\nis a smart contract for pooling tokens for managed OriginTrail nodes. It supports the following configuration options:\n\nOnce deployed, the contract can be in one of four states: , , or .\n\nIn the state token holders are able to deposit funds to the pool or withdraw funds from their pool balances. Only whitelisted addresses will be able to deposit funds into the smart contract.\n\nIn the state token holders can only withdraw their funds from the pool. The state is set if the contract does not reach its minimum cap.\n\nIn the state token holders can withdraw funds which were not included in the pool's overall contribution to the pool. After the contract creator sets token contract on , contributors will have shares in the pool assigned. The shares are ownable, meaning that the owners of the shares will be able to transfer the ownership.\n\nIn the state, the pool manager transfers the tokens back to the smart contracts. Token holders can withdraw the pool balances entirely.\n\nThe security and integrity of Staking Company and node pools is our key focus. Our smart contract will be fully audited and our infrastructure tested.\n\nOnce the contract is in the state, the owner of the contract will be able to transfer the tokens to a pre-specified list of addresses. These addresses will be used for the OriginTrail node configuration. The received rewards of the nodes, their performance and the total amount of staked tokens will be fully transparent.\n\nContract owner will be able to invoke a function and attribute the earned rewards to the owners of the shares in the pool. The respective owners of the rewards will be able to reinvest the rewards or pay them out.\n\nThe operation of distributing rewards is likely to fail for pools consisting of many contributors because of gas limits. This is why we will limit the number of accounts in a pool and have a maximum amount of 20 accounts.\n\nThe first pool is planned to accept 1MM of TRAC tokens. This means that the minimum acceptable amount will be 50k of TRAC.\n\nConsidering this limitation, the first pool will be invite-only.\n\nThe fees of the pool manager will be adjusted in a way that participants have bigger benefits of joining the pool than running the node on their own.\n\nThe balances in the smart contract serve as proof of lease to the Staking Company. The terms of the lease will be specified in a separate contract with the pool shareholders."
    },
    {
        "url": "https://medium.com/datadriveninvestor/earn-passive-income-with-cryptocurrency-masternodes-ae53199d0e49?source=user_profile---------2----------------",
        "title": "Earn passive income with cryptocurrency – Data Driven Investor –",
        "text": "Today, cryptocurrencies are much more than just a way of payments. Through the use of smart contracts and innovative consensus methods, it’s possible to earn passive income with cryptocurrency. Some projects accomplish this through:\n\nAdditionally, it can take many months or even years until you earn your initial investment and begin to make a profit.\n\nA master node is basically a server in a decentralized network that has to meet specific requirements to support the network. In exchange for it, it earns regular rewards.\n\nThere is one master node which is currently in the top 20 coins and that is Dash. This makes it one of the most popular coins to operate as a master node and earn passive income. However, given the demand, running a master node on Dash is one of the most expensive with 1,000 Dash required. This is about $400,000 as of now. The ROI per year is rather small at 7% currently.\n\nOriginTrail is a supply chain protocol. There is no minimum amount of coins required to be able to run a node in the network. It’s required that the node has a high uptime and runs in an honest manner. Generally, the more tokens you have, the more will you be able to earn. The returns are dependent on the market and should increase as the protocol gets more adoption. The non-performing nodes can be punished, so performant nodes are expected to be rewarded more for this risk. The explanation of the OriginTrail nodes has been given by Shillman_Crypto and can be found here.\n\nVeChain is a tracking solution for supply chain on blockchain. It supports a number of products including agriculture and luxury goods. There are many requirement levels for running a node in the VeChain network. They required amount of tokens ranges from 10k tokens to 250k. Depending on the amount locked up you are classified to a selected tier and receive different rewards. An overview of VeChain master nodes is given here."
    },
    {
        "url": "https://medium.com/vq-labs/p2p-cryptocurrency-payments-for-marketplaces-86a86d9d8703?source=user_profile---------3----------------",
        "title": "P2P cryptocurrency payments for marketplaces – VQ Labs Blog –",
        "text": "The rapid change of the paradigm in marketplace industry presents a danger for companies. We look at it as an opportunity.\n\nA bunch of payments providers is accepting cryptocurrencies currently. However, the intermediary in between remains in control of the transactions. The next wave of marketplaces will allow direct transactions between users without any middlemen. There is a growing interest for such marketplaces and will be a key differentiation to marketplace software companies that offer such implementation services to their clients.\n\nWe recognised this trend and we are implementing the payments in cryptocurrencies into our marketplace technology. We plan to release the first version in the “Warsaw” release at the end of Q2 2018. You can read more about our roadmap here: https://medium.com/vq-labs/vq-marketplace-update-roadmap-for-q2-2018-8eb5c6fedda8\n\nThanks to projects such as Metamask and Infura, end users (e.g. marketplace customers and suppliers) should be able to use smart contracts without any technical knowledge about blockchain.\n\nRequests for on-demand blockchain consultancies and software agencies are skyrocketing. Tomorrow’s market is a reality reinforced by more projects, implementations and companies demanding blockchain than there are experts available to work on them."
    },
    {
        "url": "https://medium.com/vq-labs/vq-marketplace-update-roadmap-for-q2-2018-8eb5c6fedda8?source=user_profile---------4----------------",
        "title": "VQ Marketplace update — roadmap for Q2 2018 – VQ Labs Blog –",
        "text": "We are a technology company reimagining the marketplace industry. Here are our goals for Q2 2018.\n\nThere is a big hurdle for starting marketplaces in many regions of the world due to lack of support in payment providers. It’s often necessary to integrate with multiple payment providers per each region separately. Cryptocurrency payments will enable the marketplace creators to accept payments globally without even setting up an account with payment providers.\n\nThese new foundation in our technology will simplify electronic flows. This solution has even greater advantages. A ledger containing all standardized accounting entries can automate real-time accounting, improve auditing, automate factoring, simplify expense reporting, make escrow simple and reliable, and detect and automatically pay taxes. All of those advantages will contribute to lower barrier of starting and running marketplaces.\n\nThe cryptocurrency of choice is ethereum. We are currently looking at protocols such as Request Network for supporting the payment requests in our infrastructure.\n\nWe realized that to provide best service and to have a greater impact, we need to shift away from offering software as a service and transform into a technology company.\n\nIn Q2 2018, we will rely on our partner network to help entrepreneurs and companies implement, host and operate digital marketplaces. This will allow us to focus on the technology development and consulting activities around it, or to put it differently, to allocate our resources in a more focused manner.\n\nIn February 2018, we have received 51 requests for building marketplaces — we could not reply to all and we could not scale up the operations and provide a service of high quality at the same time. With this change, those requests would be forwarded to our partner network.\n\nIf you are a software agency interested in joining our vision of reimagining the marketplace industry, let’s chat! Tweet to us at https://twitter.com/vqlabs or contact us through our website: https://vqmarketplace.com.\n\nWe want to see on-demand economy strive. We realized that we can have only big impact if the developers can use our code and leverage it to build marketplaces instead of reinventing the wheel. Therefore, we will release documentation of the platform with focus on developers.\n\nWe will further research decentralization of parts of marketplace businesses. We plan to do an extensive R&D on how to handle escrow accounts, dispute resolution and reputation in a decentralized way. You can track the current progress in our white paper draft: https://vqlabs.typeform.com/to/MPwoi9.\n\nWe welcome feedback of any kind!"
    },
    {
        "url": "https://medium.com/vq-labs/vq-marketplace-decentralized-marketplace-network-34f2a457dfb4?source=user_profile---------5----------------",
        "title": "VQ Marketplace: Decentralized marketplace network – VQ Labs Blog –",
        "text": "We could observe the rise of many great companies in the past years, especially sharing economy marketplaces. It is safe to assume that almost everyone has used a marketplace service, whether it was for renting a room, booking rides and services, or working flexibly and putting our unused resources to work.\n\nThe “gig-economy” market is growing extremely fast as more and more people prefer flexibility and control over their careers. It encompasses over 200 million workers with a total annual transaction volume approaching $2 trillion. The market is forecasted to grow 10% yearly towards 40% of the global workforce in under 10 years. With the rise of blockchain technology, a wave of disruption is coming to this growing market. Blockchain technology will change the way we transact, work, own stuff and also, access services of any kind. It will remove the platforms in sharing economy and allow people to transact without the need for an intermediary.\n\nWhile online marketplaces have many upsides in the traditional model, they also carry some downsides for the the key stake holders in the marketplace ecosystem: clients, suppliers and new marketplace creators. Those problems can be solved with the blockchain technology. Centralized platforms often have high fees for using them, hurting individual users but benefitting the underlying corporation. 20–30% platform fees are normal in the current sharing economy system. Suppliers are dependent on the centralized platforms Additionally, the centralized nature of the platforms means that the suppliers are dependent on them. It makes them vulnerable to changes in terms of service, prices or government regulations. High barrier of market entry for new marketplaces The value of traditional marketplaces comes from the centralized control over their data and the network they created. New marketplace creators need to build the whole supply side and overcome a chicken-egg problem. We make it easy to start a marketplace\n\nWe believe anyone should have quick access to anything. We believe that sharing economy will play a major role in the sustainability and success in economic development. Peer-to-peer and on-demand marketplaces will empower this shift. This is why we developed VQ Marketplace. It enables anyone​ ​with​ ​an​ ​idea​​ ​to​ ​start​ ​an online​ ​marketplace. How does it work?\n\nStarting marketplaces in our marketplace infrastructure requires no coding, it’s risk-free, entrepreneurs can start marketplaces easily with plug&play templates, and the whole codebase is open-source. Even with low costs of technology, new marketplaces still face the chicken-egg problem that causes high barrier of market entry. It is not enough to build the platform. The creators need to build a community of suppliers and clients. The new marketplaces need to have lower fees and carry better user experience to attract new users. These challenges can be addressed with blockchain technology and introduction of features such as decentralized supply listings, peer to peer transactions, trustless disputes and global reputation.\n\nDemand users book listings from supply users. At the booking time, a certain amount of tokens are locked as collateral for both parties. The suppliers may require that only accounts with certain amount of tokens may send requests for the listings. If the transaction is successful, the respective amount of tokens is transferred to the supplier. If something goes wrong and the booking is disputed, “dispute hubs” with a significant amount of tokens do the arbitrage of the dispute and are paid mediation fees by the party at blame. The users can also invite new users into the ecosystem and are rewarded tokens for their first transactions. Those referral rewards come from “VQM Reserve”. If the parties use a certain marketplace storefront / dApp, they pay predefined fees to the marketplace creators. However, they can always choose a different dApp with less fees if they do not like it. The parties can also allocate certain amount for each transaction for insurance or other purposes. The token can be exchanged at cryptocurrency exchanges.\n\nOnce the decentralized architecture is laid out, marketplace creators can use our tools for building decentralized marketplaces. Users in the ecosystem will be able to subscribe to value-adding services for customer support, disputes, KYC, notifications, e-mails or more — the “hubs of excellence”. All of those hubs require software to handle their operations which we will provide as a service. We don’t want to be gatekeeper so we will have a free plan enabling anyone to join the ecosystem. We plan to monetize once there is an extended usage of the service.\n\nWe will lay focus on acquiring marketplace creators and developers in the initial stage. The token will play a vital role in bootstrapping the system. We will reward the most creative, most performing marketplaces on a regular basis. Every stake holder in the ecosystem will be rewarded to bring new users to the ecosystem. The rewards will be biggest in the beginning decreasing with time as we have more adoption. We will start a worldwide ambassador program allowing the most engaged members of our community to work with us. We are a startup based in Germany with international team from Poland, Turkey and Germany. We have been building on-demand and sharing economy applications for the past 3 years. Our founder — Adrian Barwicki — has received innovation awards from SAP, Zurich Insurance and TechCrunch. One of our key shareholders is innoWerft GmbH — a SAP startup accelerator giving us network and access to German market. Why now and why us? Rise of blockchain technology has made it possible last year One of first In the market In one year time, we will have missed the big chance We are growing stronger every month. If you would like to join us on our mission, get in touch via info@vq-labs.com. We are always glad to meet new people and discuss synergies. You can also register for the token sale here: https://vqmarketplace.com/token-sale. Support us by sharing our website with your friends and following us on social media."
    },
    {
        "url": "https://medium.com/datadriveninvestor/chicken-farm-and-blockchain-ebf553ebf90b?source=user_profile---------6----------------",
        "title": "Chicken, farm and blockchain – Data Driven Investor –",
        "text": "Do you know for sure what you have eaten today was actually a fresh and healthy food? I know, you think “Yes”, but let me tell you about the 13th of March 2018:\n\nThese are three product recalls affecting thousands just in the United States. It’s not an isolated case as we have product recalls on a daily basis. What’s a product recall? Here’s a formal definition:\n\nNothing speaks better than a story so let’s run through a specific and rather the oversimplified scenario:\n\nFarms — sold wholesale 2000 chickens to suppliers\n\nSuppliers — sold further to 10 different processors\n\nProcessors — packaged different parts of the chicken and made 6000 packages\n\nDistributors — distributed the packages to 50 different grocery shops across the country\n\nRetailers — sold to multiple consumers that cannot be traced back\n\nAnd now customers get sick and it is discovered that the chicken was contaminated. We are facing a big challenge as we need to:\n\nDepending on the level of transparency in the supply chain, this process may last days or weeks. You can read more about transparency (or rather a lack thereof) in the supply chain industry here: The path to transparency in supply chain.\n\nIt may take days, even with a full transparency and using a conventional record keeping to trace a package back to the farm where it was produced.\n\nDays with full exposure of the contaminated food to the customers.\n\nWe need a digital list of transactions that is available to all participating stakeholders that cannot be altered. If you think Bitcoin, you are close. This is the feature of a blockchain — peer-to-peer network of decentralized computers to process the complex blockchain algorithms and maintain such distributed digital list of transactions.\n\nIn the case of the global food supply chain, all participants — farmers, suppliers, processors, distributors, retailers, regulators, and consumers — can gain access to known information regarding the origin and state of food for their transactions.\n\nWith that kind of transparency in the chain, the tracibility becomes a matter of seconds. Customers can easily verify and trace back the food they have purchased. Furthermore, with smart integration with their credit card and electronic receipts, they can be automatically alarmed for the purchased products if a contamination discovery is made.\n\nCompanies such as VeChain Foundation, Waltonchain_EN and OriginTrail are actively working on blockchain solutions addressing the food traceability problems. Walmart Labs — the biggest retailer in United States — is also actively researching this field and supporting projects with the same mission all over the world. It has recently awarded an European company OriginTrail for its blockchain supply chain protocol which, in essence, enables customers to verify the provenance of every item sold on the platform and the local producers to transparently communicate the state of the package among all stake holders in the supply chain.\n\nDo you know any other blockchain projects focusing on food safety and traceability? Let us know in the comments section!"
    },
    {
        "url": "https://medium.com/vq-labs/sharing-economy-marketplace-model-c6732f3e0644?source=user_profile---------7----------------",
        "title": "Sharing economy marketplace model – VQ Labs Blog –",
        "text": "We outline a protocol for requesting and booking fractional usage of assets and services. It is used in the VQ Marketplace Platform (VQM)for building on-demand and sharing economy marketplaces.\n\nThe fractional usage model is inspired by the Internet Calendaring and Scheduling Core Object Specification (RFC2445), or simply iCalendar/jCal.\n\nUsers on VQ Marketplace can both represent demand and/or supply side. Supply users can create supply listings and send requests for demand listings. Demand users can create demand listings and send requests for supply listings.\n\nDemand users can create orders based on requests. We outline couple of scenarios based on the different handling of requests and orders.\n\nInstant booking\n\nDemand user sends a request for supply listing and an order is automatically created referring the request. This scheme covers popular use cases in all types of marketplaces.\n\nRequest booking and approval\n\nDemand user sends a request for a supply listing. The supply user can approve each request that he or she received. After approval of the request, an order is created for the demand user.\n\nApplications\n\nSupply user sends a request for a demand listings. The demand user can browse through the requests and create one or many orders, respectively for each received request.\n\nFractional Quantity Usage\n\nWhen an order is created, the quantity (quantity) of the listing counting the number of units available will decrement. When the quantity of the listing becomes 0, it is evident that it is sold out. New requests need to specify the desired quantity. If the quantity of new request is higher than the quantity of the listing, the request will be automatically declined btw. refused to be created. The supplier can always increase the number of units available.\n\nIntervals\n\nListings for services or assets that are made available to different parties over time (e.g. fractional usage of an office building’s conference rooms), must first be broken into intervals that represent blocks of time representing when the asset can be booked. For example, a freelance designer may offer their services by hour, while a hotel would offer their rooms by the day.\n\nThese intervals are a fundamental building block for how we think about managing fractional bookings in the VQ Marketplace Ecosystem.\n\nListings that offer fractional usage of assets must define a constant size (in seconds) of each interval (intervalSize) as well as the initial timestamp of the first interval (createdAt). In this manner, desired windows of usage can be calculated client-side using basic algebra. Timezone adjustments can be done on the client-side. By default, the minimum purchasable interval is 1, but it can be set to any integer greater than or equal to 1. This can be made configurable either as a global marketplace setting or a listing setting.\n\nIntervals are represented with whole numbers and are non-divisible since they represent the smallest purchasable unit of time on VQM. Intervals are numbered starting from 0 and are calculated relative to the interval start time (a unix timestamp) of a listing.\n\nWhen we consider now fractional usage of an asset, we do not need to understand how large of a window of time that interval represents. It only needs to know whether that interval is available and how much it costs.\n\nThe listing owner can create an availability calendar. By default, it can be assumed that the listing is always available with the price specified in the listing (price). The owner can then specify non-overlapping intervals for the listing with start and end for each interval. Optionally, a new price can be specified for each interval. In order to avoid currency conflicts, the price is specified as a reference to the main listing price (relativePrice) from 0 to x%.\n\nWhen requesting a booking of a fractional asset, the request must specify the desired start and end of the booking interval. When the request is accepted and an order is created, the availability calendar adds a blocking interval hindering a double booking.\n\nAdditionally, the intervals model of fractional usage can easily be extended with periodic rules. In particular, the Recurrence Rule (RRULE) section of the iCalendar specification can be adopted format for displaying recurring events on a calendar and is a possible extension for defining bookable intervals for VQM listings."
    },
    {
        "url": "https://medium.com/@adrianbarwicki/hack-your-ico-marketing-strategy-750a10032fb3?source=user_profile---------8----------------",
        "title": "Hack your ICO marketing strategy – Adrian Barwicki –",
        "text": "There have been 235 Initial Coin Offerings (ICOs) in 2017 amounting to almost $4B in funding. The number only includes successfully conducted ICO where the soft cap was reached.\n\nDue to the growing interest for ICOs, it is expected that more projects will be raising funds in an ICO in 2018. As the ICO sector becomes more crowded, the startups need to fight for attention of the investor.\n\nPlanning a marketing strategy for your project from day 1 is crucial. The areas in your marketing strategy will include:\n\nThere are many agencies out there offering professional PR and Marketing services for ICOs. Their prices are hefty as shown in the image below. On top of that you can be prepared that the costs will additionally include a few percent of the total amount raised and few percent of the tokens issued in the ICO.\n\nIn this article, I’m going to give you some supplementary growth hacking strategies that you can use to market your ICO if you want to gain traction.\n\nMost of the members of the community will hold your tokens and have a natural incentive to promote and share your content. The community picks up on promoting the content once a certain “virality” or “spread” threshold is met. Maja Voje (CMO of OriginTrail) did a great job in building the online community, managing it and creating a high value engagement among members.\n\nExemplary way for promoting a good-quality content can be illustrated on the following example:\n\nThe post “The path to supply chain transparency” has been shared in the Telegram group of OrginTrail. The community picked it up, shared on Reddit, discussed on social media and retweeted multiple times, generating tens of thousands of views on all channels combined. This has been done with a 0$ budget. The effect can be fully attributed to the community.\n\nCommunity building should be your focus.\n\nCome up with a unique and interesting story about your ICO and reach out to reporters. It serves the purpose of trust building and gives more exposure to an audience that does not normally follow the ICO sector.\n\nThe recently launched German ICO wysker (by ann-lauriene) shows how to reach out to a wide audience with a low budget. Wysker has been featured in one of the most trustworthy and most-read business magazines in Germany “Handelsblatt” with over 100k daily copies."
    },
    {
        "url": "https://medium.com/vq-labs/customer-conversations-discover-your-customer-segment-7da44c622668?source=user_profile---------9----------------",
        "title": "Customer conversations: discover your customer segment",
        "text": "Customer conversation is something every entrepreneur should be prepared for. It allows to refine your understanding of customer’s problems. It expands your network and generates leads for your future sales. Most importantly, it helps you avoid building a product nobody needs.\n\nIn this post I will not try to convince you its important. I will rather focus on how to reach out to a customer, prepare before the conversation and evaluate it later.\n\nIt is crucial that one talks to the customer from the target group to understand their needs. This needs to happen not after, but before designing a product or a solution.\n\nI am a tech person and rather awkward in social interactions so it was hard for me to even setup a meeting without feeling that I am being pushy or intrusive. I created a guideline for this, allowing me to reach out, manage the expectations, get an acceptable return rate, conduct the meetings and learn if my startup is going in the right direction or our customer segment still needs to be narrowed down.\n\nIt is important that the customer conversation is kept casual and no high expectations are set. The customer must not think that it is a sales meeting. The reason is simple: When you do not yet understand their needs, the sales meeting will be disaster. You also want to keep the focus on the customer, not on you.\n\nYou need to put the conversation in the right frame and the customer needs to know it in advance.\n\nThe following points build a simple frame for an opening email for a customer conversation:\n\nIf you have a shared contact, then you can include an additional point:\n\nTo give you an real-life example:\n\nWhen you go to the meeting, you should have 2 learning goals. My learning goals are always the same:\n\nYou will be also able to identify the most pressing problems that are not solved in the most optimal way yet. As you ask about new investment, it is rather sure that the problems you will identify are new and the solution market for these problems is still emerging.\n\nIf you do it correctly, it puts you in a very attractive position:\n\nThough you will be heading to the meeting to learn, it might be that you already have a set of assumptions about the customer problems and an idea for a solution. You should design a set of questions that can jeopardize your assumptions and the solution idea. In this way you will save yourself a lot of time and money on not building something nobody wants to buy.\n\nCustomer conversation can only be successful. They allow you\n\nI’d like to use the following rule while evaluating a set of customer conversations:\n\n3–5 customer conversations and the answers are the very similar\n\nGreat! You have validated your assumptions. You refined your understanding of the customers’ problems. Now you can move on to looking for pilot projects for your solution.\n\n3–5 customer conversations and the answers are all over the map\n\nAlso great! It is a lesson that your customer segment is still to broad. You need to go one step back, splice the customer segment and reiterate the customer conversations.\n\nLet’s stay in touch! I am always happy to connect with other startups and entrepreneurs.\n\nFurther recommended resources:\n\n1. Are You Having the Right Type of Customer Conversations? by Intercom\n\n2. How to Use Customer Conversations to Guide Your Brand Strategy by @BWarsinske\n\n3. Don’t listen to your customer… Have a conversation! by Marcelo Calbucci"
    },
    {
        "url": "https://medium.com/vq-labs/are-cryptocurrencies-and-digital-tokens-a-security-instrument-d69e502e5d30?source=user_profile---------10----------------",
        "title": "Are cryptocurrencies and digital tokens a security instrument?",
        "text": "Disclaimer: This post is solely designed to inform the future contributors to VQ Marketplace project (VQM) about the process of preparation and organization of the token sale. You should not rely on this post as a legal advice.\n\nProjects, token issuers and other community participants need to carefully analyze their projects and tokens to determine whether the security laws in the respective jurisdiction apply before issuing a new token. If this is a case, the issuance comes with a broad regulatory framework.\n\nIn this post, I’ll try to run you through how we at VQ LABS were able to estimate if our future Initial Coin Offering / Token Sale is likely to be considered a security by U.S. and German jurisdictions.\n\nWe involved regional legal advisory firm from Karlsruhe, Germany and used Coinbase’s A Securities Law Framework for Blockchain Tokens for the estimation.\n\nThe framework proposed by Coinbase uses the “Howey test” to estimate how likely a particular blockchain token is a security. According to this test, a token can be recognized as a security if it falls under a definition of an investment contract. Here’s the summary of the questions each startup needs to ask to determine before organizing an ICO.\n\nIn the following, we will discuss each of those points and refer to the intended token sale offering of VQ Marketplace Token (VQM).\n\nOur definition: An investment of money occures when it is exchanged for value.\n\nBitcoin — not an investment of money\n\nThere was never any initial coin sale for Bitcoin. The only way to acquire new bitcoin is via mining. Bitcoin is token which is randomly distributed for free.\n\nAs such, buying bitcoin does not count as an investment of money.\n\nEthereum tokens without mining scheme — an investment of money\n\nOn the other hand, any token sale as long as it does not involve mining the tokens, consitutes an investment of money.\n\nSimilarly, the VQM Digital Token will be a pre-minted token and likely to be recognized as an investment of money.\n\nOur definition: a “common enterprise” is defined as an enterprise in which the investment is depending on the success of the startup organizing an ICO.\n\nLet’s draw two opposing scenarios:\n\nA) Depending on the success of the startup: Returns are paid to all token holders equally (or in proportion to their token holdings) regardless of any action on the part of the token holder then their interests.\n\nB) Not depending on the success of the startup: There is a possibility of varying returns between token holders, based on their participation or use of the network.\n\nVQM token holders will be initially able to pay subscriptions for the Service of VQ Marketplace Platform. A significant discount will be granted as opposed to payments in Euro or Dollar. We will propose also more use-cases for the token in our VQ Marketplace Ecosystem. Moreover, in designing the token use cases, we will take a special care that only holders of the tokens who are stakeholders in the VQ Marketplace Ecosystem receive advantages.\n\nIn this way, we are taking the measures that the token is more likely to be purchased in order to access the token economy and less likely to be purchased with an expectation of profit. This makes us less likely to be considered a “common enterprise” by the regulatory body.\n\nWhat is the timing of the token sale?\n\nAnother dimension that should be considered is the timing of the crowdsale. Two opposite examples of a startup issuing a token are:\n\na) depending on the success of the startup: The startup has an idea and a white paper. The buyers are completely dependent on the startup to execute the roadmap.\n\nb) Not depending on the success of the startup: The platform is live or launched at the time of the crowd sale.\n\nVQ Marketplace Platform is already operational as of today (08.02.2018) and we are planning our crowd-sale at the time when the issuing token will already be an integral part of the Ecosystem or about to coincide with the token sale offering. As such, the timing of the token sale makes us less likely to be recognized as a “common enterprise”.\n\nDoes the token holder rely on manual, off-blockchain action to realize the benefit of the token?\n\nThe holder will be able pay VQM Tokens to build and run Marketplaces on our VQ Marketplace Platform. The network will initially be centralized and rely on legal terms of service outlined by us.\n\nFurthermore, we plan to decentralize the marketplace ecosystem making the token a native currency within it, not depending on off-blockchain solutions. It is our plan that all functionality will be inherent to the token and occur programmatically.\n\nWhat function does the token have?\n\nThe token will be integral part of the VQ Marketplace Ecosystem. From the start, the token holders will be able to pay for subscription to the service with the token.\n\nFurthermore, we will introduce more use cases for the token at a later stage. In designing the use cases, we will follow the following principles:\n\na) The token will not represent ownership or equity interest in a legal entity, including a general partnership entitlement to a share of profits and/or losses, or assets and/or liabilities. It will not give the holder status as a creditor or lender.\n\nb) Only holders of the tokens who are stakeholders in the VQ Marketplace Ecosystem receive advantages.\n\nCan the token holders exercise real and significant control via voting?\n\nToken holders will be able to exercise a real control over the specifics about the development roadmap. When deploying a Marketplace Union, the token holders will be able to signalize which Marketplace Verticals we should at put focus on at VQ LABS: be it Services, Rentals, Products or other.\n\nRead more about VQ Marketplace Ecosystem and Marketplace Unions.\n\nHow is the token sale marketed?\n\nIt will marketed as a sale of tokens which give the right to access and use the network. It is to be said that economic return is possible, but only when using the network.\n\nHowever, it is not possible to prevent some buyers from buying a token purely for speculation. Our marketing does not intent to promote the token sale as an investment nor an ICO due to a wording similarity to an IPO (Initial Public Offering).\n\nWe shall take no actions for buyers to believe they can profit from holding or trading the token, rather than from using the token in the network.\n\nWe will not use the terms like ‘Initial Coin Offering’ or ‘ICO’, and investment-related language like ‘returns’ and ‘profits’ as it encourages buyers to buy a token for speculation, rather than use."
    },
    {
        "url": "https://medium.com/vq-labs/boosting-network-effects-in-the-vq-marketplace-ecosystem-4363e23ff48c?source=user_profile---------11----------------",
        "title": "Boosting Network Effects in the VQ Marketplace Ecosystem",
        "text": "A network effect is the positive effect described in economics and business that an additional user of a good or service has on the value of that product to others. When a network effect is present, the value of a product or service increases according to the number of others using it.\n\nJames Currier, the leading expert in Network Effects and partner in NFX Guild emphasizes in one of his interviews:\n\nWe are currently in a process of building the VQ Marketplace Ecosystem. In this post, I’ll give you an overview on how we plan to leverage Network Effects to boost the marketplaces in our Ecosystem and make every Stakeholder profit: Clients, Suppliers and Marketplace owners.\n\nIn the current Platform-Economy, the network effects are centered around single platforms and communities with a paradigm “Winner Takes It All” with single exceptions of very isolated markets (e.g China). The existing platforms have less competition because new companies have bigger barriers to enter the market. This results in higher fees and lack of incentive for new innovation.\n\nIn the VQ Marketplace Ecosystem, suppliers who posts listings on one Marketplace, will be able to publish their listings automatically on other Marketplaces in the same vertical that are part of the Marketplace Union. Apartment rentals, services and ride-sharing marketplaces are examples of possible verticals.\n\nThe incentive for existing marketplaces to join the union, is to gain access to much bigger user base (namely of all of the marketplace owners) than they currently have.\n\nFor new marketplaces to join the union, the process of creating a new marketplace needs to show the following characteristics:\n\nWe will create initially predefined unions for every marketplace vertical where new marketplace owners will be able to join without restriction and operate their marketplaces in a new geography with a differently designed user application/storefront or offering better fees.\n\nEvery marketplace joining the network thus increases the value for the end-consumer and every consumer creates more value for each Marketplace participating in the union.\n\nImagine AirBnB (rental marketplace), Uber (on-demand taxi marketplace), Amazon (product marketplace) in a single network. Every user in the Marketplace Ecosystem will have one global account instead of many separately for each marketplace. In this way, the customer will be able to seamlessly use every marketplace.\n\nThe consumer profit from a spectrum of all the offerings from different marketplaces without the hurdle of starting multiple accounts and running verification to have the access to goods or services on the Marketplace.\n\nEvery Marketplace in the network profits from more users in the Ecosystem. Consumers will prefer to use marketplaces in the Network because of the ease and fastness they create and have lower fees than centralized platforms.\n\nWe will create a community approach on the supply side on every Marketplace. When a service provider gets a deal, they can engage other suppliers on the platform to join forces with them. Suppliers will be able to form teams and realize projects, gigs and tasks together. The Supplier teams will give the following advantages:\n\nThere is currently a gap for complex on-demand services on the market. We are providing the Entrepreneurs, Creatives and Business owners with technology to enter this niche.\n\nThe Marketplace owners own their brand, but the marketplace infrastructure is intended to be a public good.\n\nWe will start our own Marketplace where you can get Marketplace Templates. It will allow to start a copy of predesigned or already existing marketplace platforms in seconds.\n\nEveryone will be able to create a template for configuration based our standards and protocols and sell as a digital good.\n\nIt will lower the hurdle of starting a new marketplace, incentivise to transfer existing business models to a new geography, form local markets and increase the competitiveness in the market.\n\nVQ Marketplace Ecosystem will integrate a global decentralized Reputation System based on the Ink Protocol. Suppliers and Clients will be able to take their earned reputation with them from Marketplace to Marketplace."
    },
    {
        "url": "https://medium.com/@adrianbarwicki/how-to-pr-your-startup-and-make-customers-f57a0e263328?source=user_profile---------12----------------",
        "title": "This ain’t about advertising — How to PR your startup and make customers",
        "text": "We build an audience of over 1000 people. The product does not turn out to be a market-fit. What do we do? We get into a cocoon, we adapt, we change… and we do nothing to communicate with the audience. Once we are done, we lose all the engagement we would normally get.\n\nHow could we have kept the audience engaged? What should we have done instead?\n\nListening provides insights into how your clients view your brand and let you understand what the overall sentiment is towards your startup.\n\nOnce you know what your audience thinks and looks for, you would be able to engage them. Engagement is not to drive traffic to your site — That is a short-sighted strategy that at best will result in a few transactions. It is to forge long-term mutually beneficial relationships.\n\nSo how can startups achieve true engagement? The same way a person would establish a relationship with another person.\n\nOffer help, knowledge, support or value. The desired result is trust. Trust that leads to loyalty. Trust that leads to advocacy. It takes time and effort but the rewards can last a lifetime.\n\nLet’s take as an example a customer that really takes into account the price. It’s important the price is affordable. With us taking 2000€ per consulting day, sometimes, it’s just not feasible for the startups to afford it.\n\nBut personally, I want to come across and really empower the entrepreneurs and startups, not the enterprises.\n\nWhat do we do?\n\nWe say: “All right — we are doing right now this and this marketing campaign, help us with it, share it, bring your friends to share it. In return, we will be able to justify the discount of 50%”.\n\nThe outcome is trust. Trust that what you do is in the very interest of them. Trust that leads to loyalty. Trust that leads to advocacy.\n\nIt takes time and effort but the rewards can last a lifetime.\n\nMany founders shy away from giving the company their face because they are afraid of personal embarrassment.\n\nYet, research shows: Founders that personally represent the company, are more motived (maybe because they feel the pressure to perform?) and their audience develops a personal touch and loyalty. Also, they reach better conversion rates.\n\nRemember that the business is done between people, never between companies.\n\nFrequent tactics involve putting your face on the company website, publishing content as yourself, becoming active on social media — as yourself. Besides — network, network, network.\n\nWe are also starting to do it now and I feel VERY uncomfortable about it — I got to be the one to be the face of the company.\n\nIt’s as simple as that: You google my name, you land on the company website, you buy our products or become aware of it.\n\nYou launch a product or a beta program, then you plan a big 2-months promotion. Then… for half a year your followers get no updates from you.\n\nOne wants only to communicate successes. Obviously. Everything in between is not worth it.\n\nI will tell you one thing. Half of the success is to sell your mission, not your product. Your product may suck and be incomplete and have errors in every possible corner. And yet, your customers will test it and give you feedback because they share or like your mission. And you know what? They’ll buy it once you fix the issues.\n\nCommunicate often, communicate about the day-to-day activities in your startup, let other know why you go to event A or B. Make photos from important meetings and share it.\n\nSeriously, I recently had a meeting with an important politician to talk about Sharing Economy and the significance of it to the integration of the refugees in Germany. At the end, I asked if I can get a selfie with him after a meeting. Did I feel embarrassed about it? Sure! Was it relevant to our customers that we look for ways to empower them? Certainly.\n\nDo not communicate only if there is sunshine on the horizon. Communicate also during the bad times.\n\nCommunicate the day-to-day activities of your startup.\n\nFace it, you are not the only one who does it. There are so many that do and broadcast the same way as you do. Maybe they copy you, maybe you copy them. The chances that what you do is unique — are really low.\n\nDon’t push the content, give little hints and let your audience pull it.\n\nIn both cases, you make them aware of what you do, but there is a clear difference:\n\n* in the first case they are irritated that you spam them\n\n* in the second case, they appreciate that you gave the effort to present the full information.\n\nPeople will tell you that you should set up an agenda for your PR, marketing etc. and stick to it. But along the way, you will notice that some things work better, some worse. Don’t be afraid to change or even disrupt the agenda. Exploit what works, drop quickly what does not.\n\nAs a startup, you don’t have the resources to execute something that works only in 50%. You want the 200%.\n\nWe have one mission — spread the Sharing Economy and two really different target groups — Startups and Enterprises. Even though the mission is the same, you customize it to each of the groups.\n\nI’ll tell you one thing, none of those target groups really cares that we want to spread the Sharing Economy.\n\nOne of them expects to hear that “we want to empower them in the field of Sharing Economy with Technology”, and the other that our “Innovation Lab can be a reliable key and long-term partner in driving innovation in Sharing Economy”.\n\nThe same mission, but broadcasted differently.\n\nIf you are an authentic self — you have no competition.\n\nI personally made so many mistakes, I am embarrassed to say that we tried to launch many products, burn thousands of euro of my own money and have nothing out of it.\n\nIn the beginning, I would not admit that our ventures have just been ventures of a layman and still are. Now we are building a SaaS business for Sharing Economy Platforms and we have never done anything like that before. Our precious partners neither.\n\nWe maybe learn the same lesson told thousand times before, but we have a unique and authentic way path to learn it.\n\nYour audience wants to hear your story. An authentic story. And this is something that can make your PR really stand out.\n\nWhat’s your strategy for PR? I’d love to hear that."
    },
    {
        "url": "https://medium.com/@adrianbarwicki/a-guide-to-win-a-hackathon-in-24-hours-992771009038?source=user_profile---------13----------------",
        "title": "A guide to win a Hackathon in 24 hours – Adrian Barwicki –",
        "text": "I have attended three Hackathons so far. HackZurich 2017, InsurHack 2017 and the TechCrunch Berlin Disrupt 2017.\n\nIn all of them, I had great experiences, met really inspiring people and learned many new things. It is a success in its own, even if you do not win any prize.\n\nWe won the Zurich Insurance & T-Systems Innovation Award. The proposed solution was Safe Drive - an AI-enriched smartphone application that helps prevent car accidents constantly monitoring driver alertness.\n\nOut of 42 different teams and over 300 hackers, we won the main prize and the SAP Hybris Company award — 10 000$ in total. Our project was Quick Insurance — Micro-insurance for everyday things.\n\nSince the rapid prototyping approach that is used by “hackers” is also interesting to companies, together with Marcel Engelmann, Ingmar Wolff and Lukas Samuel Maxeiner from the HackZurich team we extracted the key ideas and necessary steps that made us win.\n\nIt is is crucial to have the right people in the team.\n\nWhat do I mean by right people? I mean having a group of people that would trust one another and respect each other’s competencies. These two are already hard enough to be found among people who have been working together for a long time. It is even harder when the team members are totally stranger to each other.\n\nYou’ll need the 3 H’s in your team:\n\nThe hustler eats, sleeps and breathes the business model.\n\nHustler is the leader of the team, the one who builds the team, ignites their passion for the hackathon idea, manages the project, prepares and presents the final pitch. The hustler has a keen eye for the progress made, tracks it and brings focus to the team. He is also responsible for getting the organizators of the and the sponsors of the Hackathon know about the project.\n\nThe hacker is the developer who can create the technology to support the final pitch for the Hackathon. The best hackers also have knowledge and use of design and customer development best practices. As an added bonus, if he or she can hustle —get outside of the building and talk with customers — that is a very big advantage.\n\nThe designer is responsible for user experience and overall feeling of the final pitch. If you want to win, the few slides that you present need to feel smooth and have an incredible user experience. They need to be beautiful and feel like end-to-end product.\n\nThere are plenty of companies sponsoring the Hackathons. These companies hold different challenges in addition to the general competition with the aim to find innovative use-cases for the company solutions.\n\nThe whole competition may be crowded as it was also in the case of the TechCrunch Disrupt this year in Berlin. It’s often strategically wise to firstly aim for the company award, secondly for the total prize.\n\nIn our case we chose the SAP Hybris challenge as our main focus. In this way our competition dropped from 42 to 10 teams, thus we increased our chances of winning.\n\nDid you know that around 20% of teams in Hackathons do not even submit their projects for the evaluation?\n\nThe majority of the participants start with „hacking“ and prepare the pitch at the very last minute. It leads to a situation that they feel that the project is incomplete when the deadline approaches and they decide not to submit the pitch.\n\nBy preparing the pitch as the very first thing, you are ahead of the competition. You could go on the stage and present even if the deadline was cut in half.\n\nThe Hackathon is won based on your 60 or 120 seconds presentation of the project, not on the technology behind. The pitch makes the team winner or loser. Even you have have hacked something amazing, it will not matter if the presentation is not good enough.\n\nWe started from the end. We first designed our 60 seconds and we wrote down the words. Just after 2 hours into the Hackathon, the two of us could go and pitch our project.\n\nThe rest of the remaining time, “the Hustler” was rehearsing the pitch and talking to the sponsors while “the Hacker and Hipster” was building the solution.\n\nThis is the time to bring our prototype to life. Because there is only a minute to present to the jury and we have just few hours of building it, the solution should not be a completed product.\n\nWe build an MVP built for sole purpose of supporting the pitch. In order to build this MVP, we distributed the tasks among the team according to our skills and everyone had a concrete responsibility to fulfill.\n\nWhile we were building our MVP, we were at the same time in touch with the people from the company challenge — SAP. They were the people who would decide on the winner. Therefore, we tried to talk to them as much as possible collecting feedback and improving the MVP and the pitch according to the feedback we received.\n\nEverything we did for 24 hours was to win the company challenge, the win of the main prize took as by surprise.\n\nEveryone for us had this motivation and the strive to win, and I believe it had been an important factor."
    },
    {
        "url": "https://medium.com/@adrianbarwicki/the-path-to-supply-chain-transparency-with-origintrail-dc25cbd67a03?source=user_profile---------14----------------",
        "title": "The path to Supply Chain Transparency with OriginTrail",
        "text": "The path to Supply Chain Transparency with OriginTrail\n\nYou can ask yourself now does the distributor know that the factory used good quality materials? How can the consumer know for sure that the materials used were not mined using slavery? You could ask the distributor, but who does he ask? This is called a missing transparency and this is one of the biggest problems of Supply Chain.\n\nWith the globalization of trade there is also an increasing complexity in supply chains. This, in turn, increases the amount of information asymmetry — such that information is unevenly distributed among participating stakeholders within a supply chain.\n\nLet’s put the information asymmetry in the context of our store owner example. The store owner knows certain things about the computer you just bought, but he doesn’t know the same things the distributor knows, who in turn does not know what the manufacturer knows. They all might be reluctant to share what they know as well.\n\nWhen participating stakeholders have misaligned incentives, such as the case in which participating stakeholders are different companies, there is no incentive to provide complete information which contributes further to information asymmetry.\n\nAs a result, end-buyers of products have no economical way of authenticating what they are purchasing, which creates ideal conditions for moral hazard and fraudulent behaviour.\n\n​\n\nBoth information asymmetry and missing transparency can be basically brought down to just a few root causes:\n\nHow do we solve them?\n\nThere needs to be some kind of compensation between supply chain data producers and data consumers. A system that would enable data providers to share their information and receive payments for it, and data consumers to pay for access to certain data.\n\nAnother option would be big retailers (like Wal-Mart) demanding transparency and enforcing on their suppliers a certain system granting the transparency and data sharing. A lot of suppliers want to work with big retailers, so the retailers would easily find a manufacturer who will comply to their demands. Companies with transparency will be preferred over others that don’t.\n\nHow to prove a statement is true without actually presenting a proof\n\nIf I am a manufacturer, how do I prove to retailers that I have enough raw materials to produce a product without revealing how much raw materials I have or where did I purchase them and for how much?\n\nWe need a method by which one party (e.g. manufacturer) can prove to another party (e.g. retailer) that a given information is true, without conveying any information apart from the fact that the statement is indeed true.\n\nZero Knowledge Proof is a mechanism providing a way to check that private information matching is provable without revealing the information itself.\n\nGlobal protocol in which supply chain data is stored and shared between users\n\nA protocol is a set of rules in which the way data is stored and shared is written. You can compare it with language. Grammar and definitions of words determine the way in which we communicate. Analogously, we need a set of rules in which supply chain data is stored and shared between users. Without these rules it would be impossible for users to trust or even read the data, much like it is impossible for a native Chinese to communicate in Chinese with an English speaker. You can hear them talking, but you do not know what they are saying.\n\nOriginTrail is the first ever protocol for supply chains based on blockchain.\n\nAssuming this project delivers on the roadmap, for the first time ever, we will see a transparent Supply Chain. With OriginTrail, applications will emerge in the near future for product authentication, product journey visibility, supply chain compliance assurance, customs, audit and regulations process optimalisation.\n\nImagine that at each stage of the chain, a new rule will apply: The only acceptable products are those with a clear, comprehensive provenance. For the end-customers, it will result in authenticity and a certified origin of products.\n\nValue for stakeholders in the Supply Chain\n\nFirms acting as stakeholders in the Supply Chain will be able to mitigate supply chain sustainability risks, leading to competitive advantages in the marketplace. Firms face a number of supply-side risks including slave labor, product contamination, and environmental damage at supplier locations. Building a transparent supply chain will proactively ensure consumers that the firm is achieving high levels of sustainable performance.\n\nDid you like the content? Leave your thoughts in the comments."
    },
    {
        "url": "https://medium.com/@adrianbarwicki/from-idea-to-1000-beta-signups-in-1-month-79f5dae8e74f?source=user_profile---------15----------------",
        "title": "From Idea to 1000 Beta Signups in 1 Month – Adrian Barwicki –",
        "text": "We failed miserably in 2 startups before starting VQ-Marketplace — a solution that enables entrepreneurs to build a Sharing Economy Marketplace. In both cases, we used certain methodologies and built a product for months before we took it to market and started ‘selling’ it at scale.\n\nWe thought that a well planned and complete user experience together with a top-notch design were critical requirements before launch.\n\nWith VQ-Marketplace, we do things differently especially since this platform is more complex than any other tool we had built before. VQ-Marketplace is a solution that allows entrepreneurs and startups to Very Quickly start their own Sharing Economy Marketplace.\n\nAdrian’s domain expertise in this area (he worked with and consulted startups and companies) was a huge advantage, as it gave us a very clear vision of what VQ-Marketplace would do, how it would be different, and the value it would generate to specific personas (we are indeed the best personas for our current business: We live and breathe Sharing Economy and are frequent user of some Sharing Economy Marketplaces!).\n\nFrom day one, we planned to release the smallest and simplest viable version of the tool, collect feedback in a private beta, while quickly improving it with small continuous changes. Here is part 1 of the journey on how we are making that happen…\n\nIn this article, we will share how we:\n\nOnce we had defined the vision and feature-set of the tool, our engineers set off working on the ‘base technology’ — in other words, the core functionality required to make VQ-Marketplace work and allow to build a simple sharing economy marketplace. This meant building the ability to set up a marketplace with a very limited functionality of inserting listings and allowing people sending requests for it — it is still available here at https://talentwand.vqmarketplace.com.\n\nWe made a decision to not be too concerned about company name or incorporation at this point. To us, these were just distractions that could be tackled at a later stage.\n\nFrom previous projects, we had learned that waiting to finish the product and then releasing was a bad idea. Collecting feedback so late would lead to big changes or potentially spending a long time moving in the completely wrong direction.\n\nWe also wanted to make sure that from the very beginning we find a customer for the solution. Besides the reason stated above, the really cool thing about it was that we ensured the viability of the business model behind and secured the funds for the development of the product.\n\nWithin 2 weeks after this decision was made, our team found a customer for the solution. The trade-off was that we listened to every customizing request and provided an unbeatable support for the project. At this stage, our engineers started working on the product — the admin dashboard and storefront of the sharing economy marketplace and were delivering parts of the software every few days.\n\nKnowing that our vision of VQ-Marketplace was possible, we realized we had to clearly define the minimum requirements for each feature and be aware that every special request from the custom project is configurable in a way that the product can be viable also for other clients. Since VQ-Marketplace is a complex cloud solution allowing to build Sharing Economy marketplaces, we focused on building only an MVP — a ‘Minimum Viable Product’. In other words, the bare minimum required for someone to use it and get value out of it. Ani put her Product Management skills to put together a detailed outline document of what each feature would do and the acceptance tests each had to fulfill before it would be released.\n\nAt this point, we knew we had to get organized. We chose VQ-Marketplace as a name — with VQ standing for “Very Quick”, as it allows for a quick setup of a Sharing Economy Marketplace, and our founder personally funded the company. Our first expenses were the tools required to get organized — Jira, Hipchat and Google Apps (for Business).\n\nIt’s interesting to point out that it was only at this point that we chose the product and company name, purchased a domain and set up a legal entity. From our previous experience, we realized it was easy to lose focus and waste time by working on these things too early on.\n\nWe learned that spending 1000’s of euros on promotion without proper testing is just a waste of money. A series of mistakes that cost us lots of money over a period of 2 years to our business and personal accounts ensure that you learn it the hard way!\n\nChantal started experimenting with different content marketing strategies. Ani reached out to entrepreneurs hubs. We were testing on-line and off-line marketing technics.\n\nWe were testing the response from an audience in Berlin, Stuttgart, Prague, Warsaw, Gdansk, Austria, and Hungary. We were making a short Facebook advertisement, we were changing the audiences every few days. We tried to make personal posts linking to our business. Adrian was giving talks to students interested in starting a startup.\n\nIt gave us incredible insights about how to price out the solution for building Sharing Economy Marketplace, in what way should we market it, how should we even start telling about it.\n\nLooking back at our experience we have identified 8 main takeaways:\n\nThe beta registration is ongoing and you can get an access to this link: https://vqmarketplace.com. After our Beta ends, we will release an update how the things turn out to be and hopefully how we transformed VQ-Marketplace into a viable business.\n\nI’d love to hear about your own experiences — simply comment below if you have any stories to share."
    },
    {
        "url": "https://medium.com/@adrianbarwicki/single-node-cassandra-cluster-and-nodejs-client-demo-setup-on-ubuntu-14-04-aws-acd209ca80ed?source=user_profile---------16----------------",
        "title": "Single-Node Cassandra Cluster and NodeJS client — demo setup on Ubuntu 14.04 (AWS)",
        "text": "Cassandra, or Apache Cassandra, is a highly scalable open source NoSQL database system being the right choice when you need scalability and high availability without compromising performance.\n\nWith this short article I will guide you step-by-step to get started with the Cassandra Database, including:\n\nAll right. Let’s spin up an EC2-Instance on AWS.\n\nGo to the AWS console -> EC2 and Launch an Instance. In this tutorial, we use Ubuntu Image for the Instance.\n\nIn the security group section, we need to open the some following ports for inbound communication that are used by Cassandra Database.\n\nOnce your instance is up and running, connect to it. In order to setup JVM, download Cassandra and install it, I found the following tutorial very helpful: https://www.digitalocean.com/community/tutorials/how-to-install-cassandra-and-run-a-single-node-cluster-on-ubuntu-14-04.\n\nIn the next step you want to setup the authentification strategy for Cassandra before you accept any traffic to it.\n\nOut of the box, Cassandra provides two authentification modes: AllowAllAuthenticator and PasswordAuthenticator.\n\n\n\nAllowAllAuthenticator performs no checks and is the default authentifator .\n\nPasswordAuthenticator relies on username/password pairs to authenticate users. It keeps usernames and hashed passwords in system_auth.credentials table.\n\nWe want to switch from AllowAllAuthenticator to PasswordAuthenticator.\n\nand change the authenticator option to PasswordAuthenticator. By default, the authenticator option is set to AllowAllAuthenticator.\n\nFor more detailed information, refer to http://docs.datastax.com/en/cassandra/2.1/cassandra/security/security_config_native_authenticate_t.html.\n\nNow, we will setup a different user. We access the cqlsh-console with the default Cassandra username and password: cassandra.\n\nFor details concerning creating new users (or roles) refer to: http://docs.datastax.com/en/cql/3.3/cql/cql_reference/cqlCreateUser.html\n\nOnce we setup the authentification and users, we need to also be able to access the Cassandra database. Currently we can only do it from the machine it runs on.\n\nFirstly, we need to find out the private IP of our EC2-Instance. You will find it in the your AWS-Dashboard, by going to EC2 -> running instances and clicking on your instance. Private IP will be visible in the description tab.\n\nNow open the /etc/cassandra/cassandra.yaml file again, and overwrite the following properties:\n\nOk, now we can create our sample nodeJS application.\n\nWe use the cassandra-driver npm package.\n\nNote that we use here the public IP of the EC2-Instance, not the private IP that we used before in the Cassandra config.\n\nFinally we can setup the first keyspace and table.\n\nIn this tutorial we setup a single-node Cassandra cluster. If you would like to see learn to work with multi-nodes clusters, check out https://oliverveits.wordpress.com/2016/12/08/cassandra-hello-world-example/."
    }
]