[
    {
        "url": "https://medium.com/@udemeudofia01/the-need-for-good-sleep-369b8c2db46d?source=user_profile---------1----------------",
        "title": "The Need for Good Sleep – Udeme Udofia –",
        "text": "Interestingly, I have to write about sleep. I have actually spent the last two months of my life not having more than five (5) hours of daily sleep.\n\nIt seemed like I was more productive, yes I was. But on the other hand, I became more aggressive, easily frustrated and suffered more.\n\nAfter discussing my frustration with a friend, he actually told me a story which led to the root cause of my predicament. And what was the root cause? Inadequate sleep time.\n\nSleep is very important for the body to function efficiently and effectively.\n\nI would focus majorly on the symptoms of lack of sleep and the effects of good sleep.\n\nThere are basic things that happen that points to the fact that someone is not having enough sleep. Some of these symptoms are:\n\nGood sleep comes with several benefits to the human system. Here are few highlights:"
    },
    {
        "url": "https://medium.com/@udemeudofia01/why-am-i-stuck-df59d0ac7cb6?source=user_profile---------2----------------",
        "title": "Why Am I Stuck? – Udeme Udofia –",
        "text": "Many people in life seem to be stuck. Ironically, these set of persons have detailed knowledge of what to do to make their lives better.\n\nThe question now is: “Why are they stuck?”.\n\nBasically, having an idea without working on the idea is wasted knowledge.\n\nIn the world today, there are people full of ideas but lacking the necessary bulldozers to move to the next level, which is quite frustrating.\n\nPeople tend to move with the ideology that the necessary bulldozers are external and never internal; meaning the reason behind them being stuck are totally out of their control. I tend to differ from this philosophy as I believe that the reason why anyone is stuck is the person. Highlighted below are some of the points to buttress this statement."
    },
    {
        "url": "https://medium.com/@udemeudofia01/will-ai-take-away-our-jobs-303640b57325?source=user_profile---------3----------------",
        "title": "Will AI Take Away Our Jobs? – Udeme Udofia –",
        "text": "In July 2017, a survey was done by Quartz, sampling peoples’ opinions about artificial intelligence, including about their perceptions of job loss to AI and robots.\n\n“People were anxious; 90% of responders thought that up to half of jobs would be lost to automation within five years. That’s a lot, more than most of the studies conclude, include studies conducted by Oxford University and McKinsey Global Institute. But, paradoxically, we found that everyone thought it was going to happen to someone else. In our survey, 91% don’t think there’s any risk to their job and 94% don’t think they’ll be working for an AI boss — but 48% think they’ll have an AI employee (all within five years).” — Quartz\n\nThis question has been one of the most reoccurring ones in recent times. This is actually as a result of the rise of AI and the revolution that will come with that. This post may be a bit late as AI is actively in use in the world today, but it is still necessary that I post it.\n\nIn almost all the Data Science Meetups, AI Summit and ML Classes, there is always this one question that scares people and that is:\n\nIn this post, I will try to sample different opinions regarding this issue, and try to put a safe landing for easy understanding.\n\nHere are some of the opinions on this matter;\n\nHe continued his post thus; Machines and computers don’t actually perform jobs: instead they automate tasks. Except in extreme cases, we can’t roll in a robot and show an employee the door. Instead, we can use the new technology to hollow out and change the jobs that people perform. Even experts spend most of their time doing mundane repetitive tasks, like reviewing lab results, drafting simple contracts, filling out paperwork, etc.\n\nHe concluded on this note: “Simply put, AI will automate administration and help augment it, but it has yet to provide the potential to replace human judgement.”\n\nA direct impact is a robot displacing you and taking your job. Another direct impact is you starting to use AI tools to increase your productivity or moving to a new job. An indirect impact has nothing to do with you or your job specifically. An example of an indirect impact is when a new firm using AI or developing a substitute product grows and puts the company you work for out of business. In such a case, you’re fully employed right up until the moment you are suddenly disrupted, seemingly out of nowhere.\n\n“The invasion of AI into our world has its positive and negative effects. Get yourself set and be ready to take full advantage of this move.”"
    },
    {
        "url": "https://medium.com/@udemeudofia01/basic-overview-of-convolutional-neural-network-cnn-4fcc7dbb4f17?source=user_profile---------4----------------",
        "title": "Basic Overview of Convolutional Neural Network (CNN)",
        "text": "Convolutional Neural Network is a class of deep neural network that is used for Computer Vision or analyzing visual imagery.\n\nComputers read images as pixels and it is expressed as matrix (NxNx3) — (height by width by depth). Images makes use of three channels (rgb), so that is why we have a depth of 3.\n\nThe Convolutional Layer makes use of a set of learnable filters. A filter is used to detect the presence of specific features or patterns present in the original image (input). It is usually expressed as a matrix (MxMx3), with a smaller dimension but the same depth as the input file.\n\nThis filter is convolved (slided) across the width and height of the input file, and a dot product is computed to give an activation map.\n\nDifferent filters which detect different features are convolved on the input file and a set of activation maps is outputted which is passed to the next layer in the CNN.\n\nThere is a formular which is used in determining the dimension of the activation maps:\n\nActivation function is a node that is put at the end of or in between Neural Networks. They help to decide if the neuron would fire or not.\n\nWe have different types of activation functions just as the figure above, but for this post, my focus will be on Rectified Linear Unit (ReLU).\n\nReLU function is the most widely used activation function in neural networks today. One of the greatest advantage ReLU has over other activation functions is that it does not activate all neurons at the same time. From the image for ReLU function above, we’ll notice that it converts all negative inputs to zero and the neuron does not get activated. This makes it very computational efficient as few neurons are activated per time. It does not saturate at the positive region. In practice, ReLU converges six times faster than tanh and sigmoid activation functions.\n\nSome disadvantage ReLU presents is that it is saturated at the negative region, meaning that the gradient at that region is zero. With the gradient equal to zero, during back propagation all the weights will not be updated, to fix this, we use Leaky ReLU. Also, ReLU functions are not zero-centered. This means that for it to get to its optimal point, it will have to use a zig-zag path which may be longer.\n\nThe Pooling layer can be seen between Convolution layers in a CNN architecture. This layer basically reduces the amount of parameters and computation in the network, controlling overfitting by progressively reducing the spatial size of the network.\n\nThere are two operations in this layer; Average pooling and Maximum pooling. Only Max-pooling will be discussed in this post.\n\nMax-pooling, like the name states; will take out only the maximum from a pool. This is actually done with the use of filters sliding through the input; and at every stride, the maximum parameter is taken out and the rest is dropped. This actually down-samples the network.\n\nUnlike the convolution layer, the pooling layer does not alter the depth of the network, the depth dimension remains unchanged.\n\nFormular for the output after Max-pooling:\n\nIn this layer, the neurons have complete connection to all the activations from the previous layers. Their activations can hence be computed with a matrix multiplication followed by a bias offset. This is the last phase for a CNN network.\n\nThe Convolutional Neural Network is actually made up of hidden layers and fully-connected layer(s)."
    },
    {
        "url": "https://medium.com/my-2017-journey/2017-my-year-of-great-lessons-7f0ce5796097?source=user_profile---------5----------------",
        "title": "2017, My Year of Great Lessons – My 2017 Journey –",
        "text": "The year 2017 has really been amazing. For many it has really been a great year. The testimonies we have heard this year from many people prove that the year had been wonderful. Also for many it has actually been a year of struggle and hard times and I can witness to this fact as a result of the number of beggars with their different story lines on the street of Lagos. But for me I can’t really say the category I fall into but I leave that to you to decide.\n\nI began the year very optimistic just like the way everyone begins his/her year. I had a whole lot to accomplish and to an extent I had plans on how to go about it and so I was to an extent sure that it was going to end well. This great optimism actually had to meet with life and life happened……….\n\nSome of the plans I had for this year include:\n\n· By the end of the first quarter, I would have settled down, gotten my apartment and began pushing for a career in Software Development.\n\nDid I actually accomplish this???? NO.\n\n· Finishing at least one book every week throughout the year.\n\nI actually ran with this vision for the first two months and then I lost it and began struggling. But I am glad I still finished two books in the last two months of the year.\n\nWith the above points, it will be right to say that 2017 was my year of failure. But really was it? I keep answering myself “maybe, but not necessarily”. So I finally decided to tag “2017, My Year of Great Lessons”. And here are some of the lessons I learnt;\n\nI began the year with the mindset that I wasn’t going to stay beyond a month with my parents, though I ended up doing six months with them.\n\nThis mindset kept my focus away from things that were happening at my current location then and I ended up being less effective and productive. This blew me into frustration and depression.\n\nIn as much as you have plans for your next location, pay great attention to your current location because there are lessons that are to be learnt which may be useful when you progress to your next location.\n\n2. Comfort will never get you the desired result(s).\n\nStarting and ending your day in a place of comfort might not give you the necessary drive you need to get that which you actually want. I recall how a friend told me that he had to be leaving the comfort of his bed to be sleeping on the bare ground just to wake up in time to complete the tasks he needed to complete.\n\nWhile I was still with my family, I started trying to do a whole lot so as to get my desired results. Whenever I reached a tough point, I will add more effort to overcome but most times the effort was not enough. And whenever things became really difficult, I would remind myself that there was no need to kill myself and that mum’s food and a place to lay the head meant there could be another day to try again. And that is how I will just stop going the extra mile.\n\nSix months down the line when I left my place of comfort to a strange city, I understood this second lesson better.\n\n3. Be kind, you do not know who your next family is.\n\nThis might not really make sense till you actually move to a place that you have no relatives. This was my experience when I moved to this strange city. Thanks to God a friend came to my rescue and gave me a place to lay my big head and that is where I spent the last six months of 2017.\n\nThe question that came to my mind was “What if I was not kind to this guy, what would have happened?”. I cannot recall if I was kind to him during my service year, but I know if I wasn’t, he wouldn’t have taken me in.\n\nThis happens to be the most important lesson for me in the year 2017. Family in this regard is not necessarily people in your bloodline but people who happen to play the role of family to you. I have been blessed beyond measure by families and that has really kept me going. This did not just remind me that we still have nice people in our great nation, Nigeria, but it also taught me a lesson to try my best to be family to whoever I come across. It can really go a long way.\n\n5. Do not die with it, learn to share.\n\nThere’s a popular saying that “problem shared is problem half-solved”. I would like to put it this way, “issues shared is suicide aborted”. I never really loved sharing issues because I had a mindset that there are already to many problems in this world, so there is no need adding yours. So I bottled up most of my issues and never shared. As a result of this, I would drift into depression many times, never satisfied, never encouraged and never motivated which resulted in me just waking up without a definite purpose and going to bed at night full of pains and regrets.\n\nAll of this ended the moment I started sharing my issues. Not necessarily that they helped in solving them, but there is this burden that just goes once an issue is shared.\n\nShout out to those that have always and will always listen, you saved my life on many occasions.\n\nSometimes I ask myself “how did I end up losing sight of my goals?”. I recently learnt that running a vision without taking out time to assess yourself on a daily, monthly and yearly basis could actually lead to you losing track of the vision.\n\nThis is one of the things I really want to set out to do for the rest of my life. I came out with a plan of writing down the following to help me align my visions and goals properly;\n\no Life lessons learnt in the day, month, and year.\n\no Technical skills acquired during the day, month, and year.\n\no How far and how close to vision fulfillment.\n\no Things to be grateful for in the course of the day, month, and year.\n\n7. You may not know what you really want, but by trying things you will definitely get to know what you do not want.\n\nThere is this great fear of doing what you feel you may not like. Feeling is different from fact. Give it a try, put your best at opportunities that come your way. You may not like it but at the end you will know this is not what you want to do. And by elimination method, you narrow it down to things you actually want and will enjoy doing.\n\nI took a deeper look at myself and folks I have come across in life and all I could say was “I am privileged”. There are definitely a lot of other people who could do just as I can and even better but they do not have such opportunity.\n\nI love the way Malcolm Gladwell puts it in his book Outliers The Story of Success: “In Outliers, I want to convince you that these kinds of personal explanations of success don’t work. People don’t rise from nothing. We do owe something to parentage and patronage. The people who stand before kings may look like they did it all by themselves. But in fact they are invariably the beneficiaries of hidden advantages and extraordinary opportunities and cultural legacies that allow them to learn and work hard and make sense of the world in ways others cannot. It makes a difference where and when we grew up. The culture we belong to and the legacies passed down by our forebears shape the patterns of our achievement in ways we cannot begin to imagine.”\n\n9. The little you do matters, keep at it.\n\nEver since I moved away from family, I kept receiving calls from friends, colleagues, and even strange people who told me how those things I regarded little meant a whole lot to them. And I was wowed because to me these things did not matter.\n\nIn that regard, I learnt the things we think don’t matter actually mean a lot so keep doing those little things.\n\nI have been encouraged severally by people I once encouraged and with the exact words I used. And I am like, how did you recall those words and the response is, “those words actually sank in”. This made me more conscious of what I say to people because it has a way of sticking.\n\nImagine a world where all our utterances are words of encourage and edification, then we would be preparing for a world full of possibilities.\n\n11. Never abuse relationships, value them.\n\nThis year came with a better understanding of why relationships should be valued. I have had a couple of friends share with me how their relationships almost took life away from them because it was not valued by the other person. I also thought deep and discovered there was a time I was in a relationship I never valued and this led to pain, depression and bitterness for the other person. This is not a good thing to do as it could actually push the affected person away from any form of relationships that would come in the future.\n\nWe all know that we need discipline to get what we really want. The question is why is it that even with this knowledge we find it hard to get our desired results?\n\nThe fact is that the mechanism of discipline is relative and you need to know what works for you.\n\nDiscipline for me is actually paying the price. I have done a lot of online courses but I never was able to meet up with my deadlines probably because I was not disciplined enough and maybe cos it was free. I decided to pay for a course which actually cost more than 50% of my stipend, and I knew I was in for it. Anytime I recall the price I paid, I just had to stand up and push on with the course. For me, that price has actually kept me disciplined and I have been doing much better since then.\n\nSo find what works for you and stick with that.\n\n13. Keep reading, Keep listening and Keep learning.\n\nCurrently, no man in the 21st century can stay relevant without the above three things.\n\nBy reading we can easily push through the hurdles of five years in five days. The wisdom in books is more than enough. All you need is to start and keep reading.\n\nWise men talk less but listen more; there is more wisdom in listening than talking. Most times the best you can do is to listen and that alone changes everything. Keep listening.\n\nThis year has taught me that no matter what, just keep learning.\n\nJust as futurist and philosopher Alvin Toffler once wrote: “The illiterate of the 21st century will not be those who cannot read and write, but those who cannot learn, unlearn and relearn.”\n\n14. Learn to appreciate yourself.\n\nOne of the best feelings I have had this year is as a result of growing a beard. It felt so good like I won a lottery. This even made me appreciate myself the more. Elnathan John also shared this same feeling, check out his tweet.\n\nLooking back at how far you have come and appreciating yourself is necessary. It keeps you motivated and optimistic that you can even more.\n\n15. Failure is necessary for success.\n\nFive months into the year, I had made a lot of job applications and was waiting for feedback. In about ninety percent of the applications, all I got was a regret mail (me and my friends choose to call it love letter). The funny thing about the love letters was that it was back-to-back. I woke up every morning consecutively for three days to these love letters. It became too much till I gradually started believing that I was a failure. I called my friend and I asked him if he knows that I am a failure, though he argued, but at that point in my life I thought I was. The important thing in these failures was that at every stage, I learnt how to put up a better CV, what matters in a cover letter and how to present myself during interviews.\n\nMy failure series was actually preparing me for my success. I have had like three offers since then.\n\nI really hated that feeling of actually growing old because I am among the people that would want to stay forever young.\n\nI actually understood that I was growing older when mum started calling to inform me on certain happenings at home and what I think can be done about that. It felt so weird and brought me to the consciousness that I was actually growing older. For the first time mum actually reminded me of marriage on my birthday, though jokingly but I quite understood that there is more behind the scenes.\n\n17. Live with the end in view.\n\n2017 came with an awareness that what necessarily matters is not really the now, but the tomorrow. I had to start thinking of five-year plan for my life, planning for my parents’ retirement, planning for my wife and kids. Most times, when thinking of these things I end up laughing but I know that is the way to go.\n\nBenjamin Hardy expantiated more on it with his article: “Why you should be planning for 2019, not 2018”.\n\nFew weeks to the end of the year, two of my closest friends say I do not talk to them anymore. This was quite strange to me as I never really though I stopped communicating. The truth is I was trying to focus on certain things and unconsciously I left them out. I really felt bad.\n\nCommunication is key, it has a way of keeping the next person up and moving. Just a little “Hi, hope you are good” is enough. I know I am not too good at this but I will try. You should too.\n\nThe year 2017 went so fast, rough and tough for me. Most of the times I would mumble about my expectations and my failures without actually being grateful. I got too blinded with my objectives that I never considered being grateful for life generally. Thanks to friends who kept on reminding me on the necessity of being grateful. And looking back at the year, I have seen there is so much to be thankful for.\n\n20. In all of these, you need God.\n\nThere is so much to be done and there will always be so much. Friends, the truth of the matter is that all of these cannot be effectively done without the God factor. We all need Him in our lives.\n\nJust in case your relationship with Him is wrong, try to amend your ways and be at peace with Him as you will be needing Him to effectively conquer your 2018.\n\nTo my personality of the year, Benjamin P. Hardy, thank you for being such an inspiration. I really appreciate your efforts, your passion and your drive. You have really been great for me all-year round.\n\nAlso, I really want to give a BIG SHOUT OUT to all my friends, colleagues, business partners and everyone who I came across this year, thank you for making 2017 exceptional for me and I look forward to doing better in 2018.\n\nThank you Jeremiah Nzere for inspiring this post.\n\nN/B: This is actually my first public post, so please share your critics and comments, it will be greatly appreciated."
    }
]