[
    {
        "url": "https://medium.com/intuitionmachine/the-3-essential-ingredients-of-intelligence-where-mathematics-breaks-down-be636eae2607?source=tag_archive---------0----------------", 
        "text": "There are 3 essential ingredients that are needed to understand intelligence and unfortunately present day mathematics has trouble tackling. Mathematics are tools that enhance our reasoning processes. Mathematics is a human language that we employ to derive understanding of reality. However, this language are not all powerful and does have limitations. We explore some of these limitations here with respect to areas important to AI.\n\nAlthough mathematics tends to get developed way ahead of its time, there are many times that the application of a different kind of mathematics to a new domain leads to breakthroughs. Richard Feynman, for example, employed century-old path integrals mathematics to gain new insight on developing Quantum Electrodynamics. There are however plenty of limitations in mathematics and this article addresses those limitations with respect to our ability to comprehend essential ingredients of cognition.\n\nThe “Quasi-empiricism” of math is not a new idea. Mathematics is a human language that we employ to describe our reality. Quoted from the Wikipedia article [WIKI-1]:\n\nThe first ingredient is the notion of time.\n\nTime is a difficult concept to grasp. I guess the easiest way to handle it is just do what Einstein did. Just treat it as another dimension.\n\nMost physics is invariant in time. Meaning, you can move forward or backward in time and the physics are identical. However, at the macro-world we don’t see it that way, time exists because entropy exists. The arrow of time follows that of increasing entropy.\n\nIn fact, there’s really no notion of memory without having to consider the existence of time.\n\nMost mathematics don’t have a concept of memory. Memory is the equivalent of having state and almost all mathematics involves functional constructs that are stateless. Functional programming follows a single assignment rule where once any variable is set, it remains set to that state, never changing. It is this constraint that makes the use of functional programming something that is easily parallelizable. It is a convenient constraint that allows our mathematics to be analyzable.\n\nWe cannot, however, avoid time, because that’s where the dynamics come from. The only context that mathematics is helpful in dynamics is in the context where there is no memory exits. Introduce memory or introduce state, then all bets are off! The best that mathematics can do is to quantify the boundaries of computation and not predict its final behavior (see: https://en.wikipedia.org/wiki/Halting_problem) [WIKI-2].\n\nThe only dynamics that is analyzable by math are equilibrium states. We can only make statements about states that are in equilibrium. What happens in between, that is computation, can only be, at best, be simulated. Equilibrium is the state when we assume that time is at infinity. An unrealistic assumption, but an assumption that is brought about by convenience.\n\nThere is also the notion of asynchrony that is such a beast in complexity. That is, when different parallel processes are not in lockstep synchrony. All our digital circuitry require lockstep synchrony in the form of a common clock that drives behavior. The biological brain does not have a common clock, it works in a regime of asynchrony.\n\nThe second ingredient is the notion of collective emergent behavior.\n\nRobert Robert Sapolsky has a short lecture on Youtube [SAP] (“Thinking about emergence and chaos”) that brings about the point about bottom-up behavior (Special thanks to Felix Hovsepian for pointing put this video). He says that “most of the stuff that he and his peers do is reductive stuff that is very limited.”\n\nIntelligence comes from the emergent behavior that arises from the collective behavior of millions or billions of interacting components. This is the very essence of the concept of Connectionist AI. The components themselves do not have to be constructed in a complex manner and can be very simple and in fact be all uniform. Artificial Neural Networks and Deep Learning spring from this very idea of deriving intelligence from simple components called ‘neurons’. It is important to remind oneself that the neurons in ANN are a cartoonish version of a biological neuron. However, it is not the precise construction of the neuron that is important, but rather it is the collective behavior that is important.\n\nThat is why the reasoning that ANN and DL should be rejected because they are not biologically plausible is a very bad argument. It is entirely conceivable that intelligence can be arrived with very different kinds of ‘neurons’. That’s because, there’s some fundamental capability that a neuron performs (i.e. information dynamics, meaning computation, memory, and signaling) that is all that is needed, however, the connectivity is where intelligence emerges.\n\nThe third ingredient is the notion of meta-level reasoning.\n\nThis is the most difficult to grasp idea and it may, in fact, be the reason why ‘consciousness’ exists. We can understand the idea of building up ideas by the composition of more primitive ideas. We can understand this because that is how language is constructed. That is, from letters to syllables to words to sentences to paragraphs etc.\n\nWe also know of meta-level reasoning. It’s one of those ideas that’s hard to explain to novice programmers, but it exists in many programming languages. That is, you have programs that operate on the building blocks of the language itself. It leads to very expressive and short source code. Experienced programmers have no difficulty working at the meta-level. However, these kinds of system are extremely difficult to debug.\n\nHowever, it doesn’t stop with just one level of meta-reasoning. You could have meta-meta level constructs ad infinitum. I’ve encountered this idea in the wild in the modeling language UML. There’s a concept of meta-metamodels, here’s the definition:\n\nWhich, it just occurs to me, is the most universal definition of “Generalization”.\n\nThis lecture by James Crutchfield on “The Complexity of Simplicity” gives a very good sense of the enormous gap that we have between our math its ability to analyze complex systems:\n\nI’ve received the wrong impression with this article that I’m implying that mathematics is not needed. On the contrary, it is absolutely necessary. However, I am also banging the table for those who can’t see that present day mathematics has its limitations. There are many who continue to stick to 18th-century Bayesian logic and corresponding mathematics and have an unsubstantiated belief that it is actually even going to work in this new domain.\n\nThere are plenty of times where I see researchers attempt to cast DL systems in terms of ‘equivalent’ Bayesian networks in the hope that placing a round peg into a square hole will actually work. Well, it’ll work if the round peg’s diameter is smaller than the whole width of the square. But it is obvious that it wouldn’t be a great fit. There is absolutely no evidence that the reductionist logic is going to work in a domain of collective emergent behavior. If you approached a room of statistical physicists about using Bayesian inference, then you likely will be thrown out of the room in ridicule. Let’s all get real folks!", 
        "title": "The 3 Traits of AI where Math Hits its Limits – Intuition Machine –"
    }, 
    {
        "url": "https://medium.com/@maciej.matyka/nauczanie-maszynowe-jest-zabawne-fc9af0080cda?source=tag_archive---------1----------------", 
        "text": "Na przykład, jeden z algorytmów jest algorytmem klasyfikacji. Może on podzielić dane na różne grupy. Ten sam algorytm klasyfikacji użyty do rozpoznawania pisma pisanego ręcznie może również zostać użyty do wydzilenia części emaili jako spamu bez zmiany jednej linijki kodu. Ten sam algorytm, ale trenowany innym zbiorem danych w wyniku dostarcza inną logikę klasyfikacji zbiorów.\n\nTo się nazywa nauczaniem z nadzorem. Wiedziałeś za ile sprzedałeś każdy dom do tej pory, parafrazując, znałeś odpowiedź do postawionego problemu i mogłeś wykonać krok wstecz z tego punktu, aby znaleźć logikę.\n\nPowróćmy do oryginalnego przykładu z agencją nieruchomości. Co, jeśli nie znsz ceny sprzedaży dla każdego z domów? Nawet, jeśli jedyne co znasz to wielkość, położenie i inne podobne informacje dla każdego z domów, okazuje się, że z omawianymi algorytmami możesz ciągle zrobić naprawdę ciekawe rzeczy. Ten proces nazywamy nauczaniem bez nadzoru.\n\nTo jest trochę tak jakby ktoś dał Ci ciąg liczb na kartce papieru i powiedział “Nie wiem dokładnie co te liczby oznaczają, ale może uda Ci się to odgadnąć jeśli jest tu jakiś wzorzec, albo są one pogrupowane, albo coś w tym stylu — powodzenia!”.\n\nNasze ludzkie mózgi potrafią przystosować się do dowolnej sytuacji i nauczyć się jak sobie z nią poradzić bez podanych wyraźnych i ścisłych instrukcji. Jeśli sprzedajesz domy przez dłuższy czas, będziesz miał instynktowne “przeczucie” co do ceny kolejnych nieruchomości, najlepszej strategii sprzedaży domu, pomysłu jaki klient będzie odpowiedni itp. Celem badań nad silną sztuczną inteligencją jest przeprowadzenie podobnego rozumiwania z użyciem komputerów.\n\nJeśli potrafisz zmniejszyć ten średni błąd do 0 modyfikując wagi, Twoja funkcja będzie idealna. To by znaczyło, że w każdym przypadku, Twoja funkcja idealnie szacuje cenę domu w oparciu o dane wejściowe. W takim razie, osiągnęliśmy nasz cel — obniżyliśmy średni błąd tak jak to tylko możliwe próbując różnych wag.\n\nKiedy używasz bibliotek do nauczania maszynowego, aby rozwiązać prawdziwy problem, wszystko to zostanie dla Ciebie zrobione. Ale ciągle jest to naprawdę pożyteczne, aby wiedzieć co dzieje się “za kulisami”.\n\nKedy zobaczysz jak prosto nauczanie maszynowe może być zastosowane do problemów, które wyglądają na naprawdę trudne (jak rozpoznawanie pisma odręcznego), możesz mieć wrażenie, że możesz użyć nauczania maszynowego do rozwiązania dowolnego problemu i uzyskać odpowiedź tak długo jak masz wystarczającą ilość danych. Po prostu dostarczasz dane i oglądasz jak komputer w sposób magiczny rozpoznaje równanie które dopasowuje się do danych!", 
        "title": "Nauczanie maszynowe jest zabawne! – Maciej Matyka –"
    }, 
    {
        "url": "https://medium.com/whirldata/identifying-objects-in-image-thinking-of-this-idea-c9bba2a7d3fb?source=tag_archive---------2----------------", 
        "text": "Extracting objects will be easy now. We started building platform for understanding objects from an Image.\n\nVery soon we’ll come with an API (Free) to extract the objects in image.\n\nCurrently it takes (~)6 to 7 seconds to predict in local environment. We are trying to reduce this response time to 1 to 2 seconds.\n\nSee the example", 
        "title": "Identifying objects in image — Thinking of this idea"
    }
]