[
    {
        "url": "https://medium.com/@michel.herszak/the-realm-of-artificial-intelligence-has-been-defined-and-portrayed-within-the-media-since-its-45c59a58a4a4?source=tag_archive---------0----------------", 
        "text": "The realm of Artificial Intelligence has been defined and portrayed within the media since its conception as inherently fascinating, from the earliest of television programmes to today’s blockbusters such as Ex-Machina. And whilst today we look to the most well-known working examples of AI, such as Japan’s robot assistant that can recognise emotion and IBM’s Watson who went head to head with a human in a quiz show and reigned victorious, there has remained a divide between mere machine learning, and truly delivering artificial intelligence.\n\nDespite Artificial Intelligence being regarded as the stuff of science fiction, and securing the limelight in the public’s consciousness, in actuality the most influential of the AI of today can be seen within a drastically different realm: that of Web development. And this is where our understudy steps in: Deep Learning.\n\nDeep Learning is the understated arm of machine learning, yet it is both inherently and increasingly vital to the advancement of AI within complex, demanding and advanced web development projects that truly change the way in which people live.\n\nDeep Learning is helping companies take massive strides forward within the world of AI upon projects that had previously hit immoveable roadblocks, often serving as a vital missing link between mere machine learning and truly delivering AI.\n\nToday, this powerful approach to machine learning can be seen in action within realms such as computer vision, bioinformatics and audio recognition, and is employed by arguably the world’s most powerful company, Google, in their revolutionary AI project: Google Brain. Within everyday consumer use Deep Learning has also delivered the speech recognition system in Android devices as well as Photo search in Google+ and video recommendations in YouTube.\n\nAnother company — Facebook — is one of the Valley’s most invested when it comes to building out artificial intelligence technology to help its products think and act like humans. It’s a competitive endeavour because companies like Google, IBM, Uber and Baidu are not the only ones racing Facebook to scoop up deep learning experts, the rare minds capable of building this type of software.\n\nMost notably amongst the many selling features of Deep Learning is the way in which it achieves unsupervised or semi-supervised feature learning that are effectively taught through ever more efficient algorithms. A perfect example of this in action is the way in which Deep Learning removed the need for a room of manual clickers at Google who would scan an endless amount of Google Map images for numbers. Where previously they were required to differentiate between the numbers of actual addresses, and other number settings, perhaps within the phone number of an advert or even within graffiti tags, thereafter a small number of newly graduated machines could handle the task with ease through cutting-edge algorithms. And it doesn’t end there. Where once Google translate was the stuff of many an internet joke, today its accuracy is surpassing all expectation as Deep Learning gets to work with its flexible and powerfully employed delivery of ever more efficient algorithms.\n\nDeep Learning: It has rid the world’s most powerful company of a room full of weary clickers and replaced them with trained machines. It has brought (accurate) speech recognition to our Smartphones. And it has the potential to deliver upon the most complex and demanding of web development projects.\n\nSo, if you’re ready to partner with a web developer who can truly harness the potential of deep learning then let’s connect.\n\nWant to know about the way in which I work? Great, you can get started with an overview of just how I approach a project right here.", 
        "title": "Deep learning and Web Development – Michel Herszak –"
    }
]