[
    {
        "url": "https://medium.com/emergent-future/why-deep-learning-matters-and-whats-next-for-artificial-intelligence-5c629993dc4?source=tag_archive---------0----------------", 
        "text": "Why Deep Learning Matters and What’s Next for Artificial Intelligence\n\nIt’s almost impossible to escape the impact frontier technologies are having on everyday life.\n\nAt the core of this impact are the advancements of artificial intelligence, machine learning, and deep learning.\n\nThese change agents are ushering in a revolution that will fundamentally alter the way we live, work, and communicate akin to the industrial revolution — more specifically, AI is the new industrial revolution.\n\nThe most exciting and promising of these frontier technologies is the advancements happening in the deep learning space.\n\nWhile still nascent, it’s deep learning percolating into your smartphone, driving advancements in healthcare, creating efficiencies in the power grid, improving agricultural yields, and helping us find solutions to climate change.\n\nJust this year a handful of high-profile experiments came into the spotlight, including Microsoft Tay, Google’s DeepMind AlphaGo, and Facebook M and highlight the versatility of deep learning and the application of AI.\n\nFor instance, Google DeepMind has been used to master the game of Go, cut their data center energy bills by reducing power consumption by 15%, and even working with NHS to fight blindness.\n\n“Deep Learning is an amazing tool that is helping numerous groups create exciting AI applications,” Andrew Ng says, Chief Scientist at Baidu and chairman/co-founder of Coursera. “It is helping us build self-driving cars, accurate speech recognition, computers that can understand images, and much more.”\n\nThese experiments all rely on a technique known as deep learning, which attempts to mimic the layers of neurons in the brain’s neocortex. This idea — to create an artificial neural network by simulating how the brain works — has been around since the 1950s in one form or another.\n\nDeep learning is a subset of a subset of artificial intelligence, which encompasses most logic and rule-based systems designed to solve problems. Within AI, you have machine learning, which uses a suite of algorithms to go through data to make and improve the decision making process. And, within machine learning you come to deep learning, which can make sense of data using multiple layers of abstraction.\n\nDuring the training process, a deep neural network learns to discover useful patterns in the digital representation of data, like sounds and images. In particular, this is why we’re seeing more advancements for image recognition, machine translation, and natural language processing come from deep learning.\n\nOne example of deep learning in the wild is how Facebook can automatically organize photos, identify faces, and suggest which friends to tag. Or, how Google can programmatically translate 103 languages with extreme accuracy.\n\nIt’s been more than a half-century since the science behind deep learning was discovered, but why is it just now starting to transform the world?\n\nThe answer lies in two major shifts: an abundance of digital data and access to powerful GPUs.\n\nTogether, we are now capable of teaching computers to read, see, and hear simply by throwing enough data and compute at the problem.\n\nThere’s a special kind of irony reserved for all of these new breakthroughs that are really just the same breakthrough: deep neural networks.\n\nThe basic concept of deep learning reach back to the 1950s, but were largely ignored till the 1980s and 90s. What’s changed, however, is the context of abundant computation and data.\n\nWe now have access to, essentially, unlimited computational power thanks to Moore’s law and the cloud. On the other side, we’re creating more image, video, audio, and text data everyday than before due to the proliferation of smartphones and cheap sensors.\n\n“This is deep learning’s Cambrian explosion,” Frank Chen says, partner at the Andreessen Horowitz.\n\nFour years ago, Google had just two deep learning projects. Today, the search giant is infusing deep learning into everything it touches: Search, Gmail, Maps, translation, YouTube, their self-driving cars, and more.\n\n“We will move from mobile first to an AI first world,” Google’s CEO, Sundar Pichai said earlier this year.\n\nIn a very real sense, we’re teaching machines to teach themselves.\n\n“AI is the new electricity,” Ng says. “Just as 100 years ago electricity transformed industry after industry, AI will now do the same.”\n\nDespite the breakthroughs, deep learning algorithms still they can’t reason the way humans do. That could change soon, though.\n\nYann LeCun, Director of AI Research at Facebook and Professor at NYU, says deep learning combined with reasoning and planning is one area of research making promising advances right now, he says. Solving this in the next five years isn’t out the realm of possibilities.\n\n“To enable deep learning systems to reason, we need to modify them so that they don’t produce a single output, say the interpretation of an image, the translation of a sentence, etc., but can produce a whole set of alternative outputs. e.g the various ways a sentence can be translated,“ LeCun says.\n\nYet, despite plentiful data, and abundant computing power, deep learning is still very hard.\n\nOne bottleneck is the lack of developers trained to use these deep learning techniques. Machine learning is already a highly specialized domain, and those with the knowledge to train deep learning models and deploy them into production are even more select.\n\nFor instance, Google can’t recruit enough developers with vast deep learning experience. Their solution is to simply teach their developers to use these techniques instead.\n\nOr, when Facebook’s engineers struggled to take advantage of machine learning, they created an internal tool for visualizing machine and deep learning workflows, called FBLearner Flow.\n\nBut, where does that leave the other 99% of developers that don’t work at one of these top tech company?\n\nVery few people in the world know how to use these tools.\n\n“Machine learning is a complicated field,” S. Somasegar says, venture partner at Madrona Venture Group and the former head of Microsoft’s Developer Division. “If you look up the Wikipedia page on deep learning, you’ll see 18 subcategories underneath Deep Neural Network Architectures with names such as Convolutional Neural Networks, Spike-and-Slab RBMs, and LTSM-related differentiable memory structures.”\n\n“These are not topics that a typical software developer will immediately understand.”\n\nYet, the number of companies that want to process unstructured data, like images or text, is rapidly increasing. The trend will continue, primarily because deep learning techniques are delivering impressive results.\n\nThat’s why it’s important for the people capable of training neural nets are also able to share their work with as many people as possible. In essence, democratizing access to machine intelligence algorithms, tools, and techniques.\n\nGPUs on-demand and running in the cloud, eliminate the manual work required for teams and organizations to experiment with cutting-edge, deep learning algorithms and models, which allows them to get started for a fraction of the cost.\n\n“Deep learning has proven to be remarkably powerful, but it is far from plug-n-play,” Oren Etzioni says, CEO of the Allen Institute for Artificial Intelligence. “That’s where Algorithmia’s technology comes in — to accelerate and streamline the use of deep learning.”\n\nWhile GPUs were originally used to accelerate graphics and video games, more recently they’ve found new life powering AI and deep learning tasks, like natural language understanding, and image recognition.\n\n“We’ve had to build a lot of the technology and configure all of the components required to get GPUs to work with these deep learning frameworks in the cloud,” Kenny Daniel says, Algorithmia founder and CTO. “The GPU was never designed to be shared in a cloud service like this.”\n\nHosting deep learning models in the cloud can be especially challenging due to complex hardware and software dependencies. While using GPUs in the cloud are still nascent, they’re essential for making deep learning tasks performant.\n\n“For anybody trying to go down the road of deploying their deep learning model into a production environment, they’re going to run into problems pretty quickly,” Daniel says. “Using GPUs inside of containers is a challenge. There are driver issues, system dependencies, and configuration challenges. It’s a new space that’s not well-explored, yet. There’s not a lot of people out there trying to run multiple GPU jobs inside a Docker container.”\n\n“We’re dealing with the coordination needed between the cloud providers, the hardware, and the dependencies to intelligently schedule work and share GPUs, so that users don’t have to.”\n\nMost commercial deep learning products use “supervised learning” to achieve their objective.\n\nFor instance, in order to recognize a cat in a photo, a neural net will need to be trained with a set of labeled data. This tells the algorithm that there is a “cat” represented in this image, or there is not a “cat” in this photo. If you throw enough images at the neural network, it will, indeed, learn to identify a “cat” in an image.\n\nProducing large, labelled datasets is an achilles heel for most deep learning projects, however.\n\n“Unsupervised learning,” on the other hand, is how deep learning works and enables us to discover new patterns and insights by approaching problems with little or no idea what our results should look like.\n\nIn 2012, Google and Stanford let a neural net loose on 10 million YouTube stills. Without any human interaction, the neural net learned to identify cat faces from the YouTube stills, effectively identifying patterns in the data and teaching itself what parts of the images might be relevant.\n\nThe important distinction between supervised and unsupervised learning is that there is no feedback loop with unsupervised learning. Meaning, there’s no human there correcting mistakes or scoring the results.\n\nThere’s a bit of a gotcha here: we don’t really know how deep learning works. Nobody can actually program a computer to do these things specifically. We feed massive amounts of data into deep neural nets, sit back, and let the algorithms learn to recognize various patterns contained within.\n\n“You essentially have software writing software,” says Jen-Hsun Huang, CEO of GPU leader NVIDIA says.\n\nWhen we master unsupervised learning, we’ll have machines that will unlock aspects about our world previously out of our reach.\n\n“In computer vision, we get tantalizing glimpses of what the deep networks are actually doing,” Peter Norvig, research director at Google says. “We can identify line recognizers at one level, then, say, eye and nose recognizers at a higher level, followed by face recognizers above that and finally whole person recognizers.”\n\nIn other areas of research, Norvig says, it has been hard to understand what the neural networks are doing.\n\n“In speech recognition, computer vision object recognition, the game of Go, and other fields, the difference has been dramatic,” Norvig says. “Error rates go down when you use deep learning, and both these fields have undergone a complete transformation in the last few years. Essentially all the teams have chosen deep learning, because it just works.”\n\nIn 1950, Alan Turing wrote “We can only see a short distance ahead, but we can see plenty there that needs to be done.” Turing’s words hold true.\n\n“In the next decade, AI will transform society,” Ng says. “It will change what we do vs what we get computers to do for us.”\n\n“Deep learning has already helped AI make tremendous progress,” Ng says, “but the best is still to come!”", 
        "title": "Why Deep Learning Matters and What’s Next for Artificial Intelligence"
    }, 
    {
        "url": "https://blog.getrevue.co/the-most-read-ai-vr-articles-on-revue-c93768dbc114?source=tag_archive---------1----------------", 
        "text": "We thought we will continue with the tech theme and write up an article that resembles a digest. Talk about eating our own dog food and all! A while back, we created a piece on the most popular AI & VR digests on Revue. Since we have a growing community that is becoming more and more engaged with those topics, we thought it would be cool to see which pieces have sparked the most interest throughout various digests. So, let’s take a look!\n\nThis piece was featured in the Wild Week In AI. This is not really an article on it’s own, it’s more of a “playground” that presents a neutral network for you to fiddle with. If you open it, you’ll see a system with a choice of different data sets, features & hidden layers that you can adjust so you can properly try it out. Also, underneath you’ll be able to find instructions about what you can do with this nifty tool! Last but not least, you can even re-purpose it since it’s open sourced on GitHub.\n\nThis article was featured in Azeem Azhar’s newsletter- The Exponential View. If you’re not familiar with him, he knows a lot about tech and he has a massive following. Naturally, we thought that he must have one of the most clicked links since he’s such a skilled curator. This is one of them. The piece is about the significant technological advances that have been made in the field of AI. To be more specific, this article is discussing the event of a computers becoming better at playing Go and being able to predict next moves, which until recently wasn’t considered possible.\n\nThis piece has been one of the most clicked ones in Nathan Benaich’s newsletter. It starts off by discussing how Google has changed since its launch all those years ago. The author mentions the mission that Google has when it comes to information-“to organize the world’s information and make it universally accessible and useful”. The great thing about this article is that it talks about how Google has incorporated VR & AI into their products to build a different, better future. It’s all about how those specific products are solving different problems from our daily lives faster & more efficiently because of the big technological advances that already exist these days.\n\nWith everything amazing that is happening in the field of AI it was about time that self-driving cars made their way to the open roads. And guess who made this possible- Google, of course! Well, it’s not like you’ll randomly see Google self-driving cars next to you in a traffic jam at least in the next year or so. But Google made a prototype of this car and worked on a project to test out how this vehicle will perform in the real world. Ironically enough, the little machine got stopped by a police officer for driving too slow. Even though there has been research that many of those self-navigating cars can be a reason for road accidents, Google is set to disprove this by improving their product.\n\nThis article has been part of Peter Rojas’s newsletter VR Links. It is about how virtual Reality hardware, like a VR headset e.g. , can be one of the most exciting gadgets out there, especially for enthusiasts. This is becoming a lot more popular. The best news is, that most of all, it’s becoming more accessible. But the main focus here is on what went wrong with Google Glass and why Oculus Rift can and probably will be very different. Maybe one of the most important takeaways here is that VR is all about experiences. That being said, the article also touches upon how smartphones fit into the VR environment. For example, Google’s Project Tango just might be a massive game changer.", 
        "title": "The most read AI & VR articles on –"
    }, 
    {
        "url": "https://medium.com/ai-finance-start-ups-life/future-of-work-e3ffdbb1fa05?source=tag_archive---------2----------------", 
        "text": "“A double shot espresso for John”, the barista at Starbucks calls out your name while you are reading your email on your phone. “Should I review Solar City’s account one more time before I head down there?” “I still have several hours before the noon meeting” Then, a notification comes up. Upon tapping on it, a neighborhood map is displayed with all the accounts. While some of them are familiar customers, a lot of them, marked with “Gold Star”, are not. These are the accounts that your other sales team members have been laboring to close in the last month. “I have done deals with these guys before. They know me. I have several hours now. What if I just pay them a visit before the afternoon meeting? I am sure that will help” Then, you tab on the account and dial….\n\nCarl, your CEO, was scheduled to make a presentation to the board in Q2. He sent you an email suggesting that he himself, Joe ( VP of Marketing ), and yourself ( VP of Sales ) should work together on the slides in April in New York, where the headquarter office is based. Eager to get started on preparing for the meeting, you tab on the “suggested records” button. Your sales data for the past quarter — Opportunities, Contracts, Email exchanges — are neatly displayed. “I’d better start planning for the trip to New York. “Last time I booked the flight late, and it has costed me an extra thousand dollars!”, you pondered. Scrolling beyond the sales documents, you tab on the “plan your travel” action. There, you enter the itinerary information — travel dates, preferred hotel and airline, and the information goes straight to the travel system, and a thousand dollars saved!\n\nYou are reviewing the email from Danaher, a customer at the final stage of discussion. You notice that there will be a demo meeting next month. Darwin, your sales engineer, is preparing for a technical presentation for that meeting. Launching an SMS session with Darwin, you want to work with him to ensure that everything is on track. Unlike any other chat session, there is a bot also listening in. To give Darwin more information about the deal, you order the bot to fetch the contracts which were just exchanged with Danaher’s legal. After Darwin replied, you ask the bot to fetch the opportunities. The chat continues…\n\nIs this vision — getting to the right information at the right time, while you work — too far fetched?\n\nFor us at SmarterMe, the answer is no. In fact, we believe this is the future of work. And the future is already here!\n\nThanks to advances in AI and Deep Learning, SmarterMe is realizing this vision now. And customers are reaping the benefits and are becoming extremely productive. In my next blog post, I will reveal the technologies that are powering the vision. Stay tuned!", 
        "title": "Future of Work – AI, Finance, Start-ups, Social –"
    }, 
    {
        "url": "https://medium.com/@mslavescu/community-is-key-and-i-see-it-the-only-way-to-collect-and-analyze-useful-data-effectively-53bc35e09130?source=tag_archive---------3----------------", 
        "text": "Join me in revolutionizing this approach, through simplifying the collection and analysis of data in such a way that a lot of people will be able to do it themselves and share the research/code/data/results in an open way through open source:", 
        "title": "Community is key! And I see it the only way to collect and analyze useful data effectively"
    }
]