[
    {
        "url": "https://medium.com/@luxtella/in-1969-when-mankind-landed-on-the-moon-many-people-expected-2001-will-be-space-odyssey-but-we-b8b21efba758?source=tag_archive---------0----------------", 
        "text": "In 1969, when mankind landed on the moon, many people expected 2001 will be space odyssey, but we know it’s far future. AI is same.\n\nAll human did is just to put deep stack of artificial neural network and train the network with labeled data. voila! speech recognition and image classification works much better than traditional alogorithm for some reasons. That’s all. If you are interested in, study Coursera machine learning, Udacity Deep learning, Stanford Conv image net and Natural language process classes. It’s easier compared to rocket science, machanical engineering or graduated-level Physics. There is not any magic.\n\nWe don’t have any clue how AGI can be implemented like we don’t have any clue how interstellar spaceship can be implemented.", 
        "title": "In 1969, when mankind landed on the moon, many people expected 2001 will be space odyssey, but we…"
    }, 
    {
        "url": "https://medium.com/@kristinekburnett/data-science-deep-learning-in-python-22221c1b182e?source=tag_archive---------1----------------", 
        "text": "This course will get you started in building your FIRST artificial neural network using deep learning techniques. Following my previous course on logistic regression, we take this basic building block, and build full-on non-linear neural networks right out of the gate using Python and Numpy. All the materials for this course are FREE.\n\nWe extend the previous binary classification model to multiple classes using the softmax function, and we derive the very important training method called “backpropagation” using first principles. I show you how to code backpropagation in Numpy, first “the slow way”, and then “the fast way” using Numpy features.\n\nNext, we implement a neural network using Google’s new TensorFlow library.\n\nYou should take this course if you are interested in starting your journey toward becoming a master at deep learning, or if you are interested in machine learning and data science in general. We go beyond basic models like logistic regression and linear regression and I show you something that automatically learns features.\n\nThis course provides you with many practical examples so that you can really see how deep learning can be used on anything. Throughout the course, we’ll do a course project, which will show you how to predict user actions on a website given user data like whether or not that user is on a mobile device, the number of products they viewed, how long they stayed on your site, whether or not they are a returning visitor, and what time of day they visited.\n\nAnother project at the end of the course shows you how you can use deep learning for facial expression recognition. Imagine being able to predict someone’s emotions just based on a picture!\n\nAfter getting your feet wet with the fundamentals, I provide a brief overview of some of the newest developments in neural networks — slightly modified architectures and what they are used for.\n\nIf you already know about softmax and backpropagation, and you want to skip over the theory and speed things up using more advanced techniques along with GPU-optimization, check out my follow-up course on this topic, Data Science: Practical Deep Learning Concepts in Theano and TensorFlow.\n\nI have other courses that cover more advanced topics, such as Convolutional Neural Networks, Restricted Boltzmann Machines, Autoencoders, and more! But you want to be very comfortable with the material in this course before moving on to more advanced subjects.\n\nAll the code for this course can be downloaded from my github: /lazyprogrammer/machine_learning_examples\n\nMake sure you always “git pull” so you have the latest version!\n\nHARD PREREQUISITES / KNOWLEDGE YOU ARE ASSUMED TO HAVE:\n\nTIPS (for getting through the course):", 
        "title": "Data Science: Deep Learning in Python – Kristine K Burnett –"
    }
]