[
    {
        "url": "https://medium.com/the-mission/up-to-speed-on-deep-learning-june-update-bb0f17ccaf0b?source=tag_archive---------0----------------", 
        "text": "At the end of April, we published an article on getting up to speed on deep learning, which included 20+ resources to catch up on rapid advancements in the field. Much has happened since then, so we thought we’d pull together a few of the excellent resources that have emerged this month in June. As always, this list is not comprehensive, so let us know if there’s something we should add, or if you’re interested in discussing this area further.\n\nGenerative models by OpenAI. The team at OpenAI share five new projects that enhance or use generative models, a branch of unsupervised machine learning techniques:\n\nFacebook introduces DeepText, its deep learning engine that understands textual content on Facebook with near-human accuracy and at a speed of several thousand posts per second, in more than 20 languages.\n\nGoogle DeepMind learns to play Montezuma’s Revenge via intrinsic motivation techniques (video). The game requires forward planning. Read the paper, Unifying Count-Based Exploration and Intrinsic Motivation, here.\n\nNVIDIA announces its GPU Ventures Program in which it “provides marketing, operational, financial and other support to young ambitious companies founding their businesses around NVIDIA technologies.” They plan to make $500K to $5M investments in these startups. Consider applying if you’re working on a deep learning startup.\n\nDARPA announces its Data-Driven Discovery of Models program, which is intended to help non-experts build their own models using automated tools that facilitate data science. In effect, leveraging machine learning for machine learning.\n\nNeural Network Architectures by Eugenio Culurciello. The history of neural network design over the past few years to help us better craft neural network architectures in the future.", 
        "title": "Up to Speed on Deep Learning: June Update – The Mission –"
    }, 
    {
        "url": "https://medium.com/emergent-future/flying-cars-understanding-ai-and-machine-learning-wwdc-news-and-more-38eb94e3d3ff?source=tag_archive---------1----------------", 
        "text": "You Might Have Heard: Larry Page has a secret flying-car factory.\n\nNot only that, but he’s invested over $100M into the flying-car startup Zee.Aero, and is also an investor in the competing firm, Kitty Hawk.\n\nFlying cars have always been a part of our collective imagination, for better or worse, but for flying cars to become a reality they need to be able to fly autonomously.\n\n“With ultralight composites and better battery tech we may actually be drawing near a basic functional design,” TechCrunch writes. “In a few decades it may seem absurd that we drove our own cars for a century, with the dead from traffic accidents totaling in the millions.”\n\nThis video presentation by a16z Deal and Research head Frank Chen, walks through the basics of AI, deep learning, and machine learning, explaining how we got here, why now, and what the next breakthrough is.\n\nEvery company is now a data company, capable of using machine learning in the cloud to deploy intelligent apps at scale, thanks to three machine learning trends: data flywheels, the algorithm economy, and cloud-hosted intelligence.\n\nDespite playing catchup to Google and Microsoft, Facebook wants to dominate in AI and machine learning. They’ve tripled their investment in processing power for research, and hired up more than 150 people.\n\nMeanwhile, a patent for “Face Detection Using Machine Learning” was just granted. 😳\n\nPLUS: A few considerations when setting up deep learning hardware.\n\nThe big news from Apple WWDC this year is that they’re opening up Siri to app developers in an effort to keep pace with Amazon, Google, Facebook, and Microsoft, all of which are betting that voice commands and chatbots will be one of the next big computing paradigms.\n\nHomeKit, the Apple Internet of Things platform, got a big updateand a dedicated app to control all the devices in your home, andfeatures access to connected cameras from the lock screen, geofencing, automation, Siri commands, and Apple Watch support.\n\nOne More Thing: Apple added facial and object recognition to the iPhone and iPad.\n\nThe computer vision tech runs natively on the device, and doesn’t require you to upload all the images to the cloud. With the Photos app, you can now recognize faces and objects across your photo library to help you to find a specific photo with ease.\n\nIn addition, the app has a new feature called Memories, which bundles photos according to events and places.\n\nPLUS: The 13 biggest announcements from Apple WWDC 2016\n\nThe VR headset from HTC started shipping last week in 24 countries, with delivery in two to three days. Head to a Microsoft, GameStop, and Micro Center store for a demo before plopping down $799.\n\nBut, should you buy an HTC Vive right now?\n\nStill unsure? Here’s an HTC Vive vs Oculus Rift comparison.\n\ntl;dr \n\nThe Rift has better sound and ergonomics; The Vive has better controllers and smoother tracking of head and hand motions.\n\n“Both of these devices are good enough to deliver a great VR experience to millions of people. This is the beginning of something big.”\n\nPLUS: VR rollercoasters are coming, and they look amazing.\n\nALSO: Augmented reality startup Blippar unveils its “visual browser,” an app for recognizing real-world objects using machine learning.", 
        "title": "Flying Cars, Understanding AI and Machine Learning, WWDC News, and More"
    }, 
    {
        "url": "https://medium.com/binaryloom/how-nvidia-supports-deep-learning-5c0b7ac1f760?source=tag_archive---------2----------------", 
        "text": "Artificial Intelligence is now revered as a second greatest invention by mankind after the invention of fire. The advent of AI has not been without its detractors. A good number of people hold reservations since they fear AI will be a bane to their jobs. These people should appreciate that AI is being used, is here to stay, and they should learn to use and control the technology for the overall good.\n\nDeep learning is the heart of AI. It refers to the use of a profound neural network modeled on the human brain. These digital neural networks are designed to mimic the learning processes of the human brain.\n\nThe learning process takes place within half a dozen layers of neurons beginning with the firing of a specific set of neurons. By taking note of the results of a learning task, the brain will use feedback in subsequent trials to adjust the activated neurons. The neural network will effectively identify certain unique features. With reference to images, the intermediate layers of the neural network will identify features such as the edges and other distinctive features that enable us to recognize the image.\n\nWe have seen heavy investment in the AI technology by large technology companies like Google and Facebook. These tech companies are using the technology to automate their offerings as well as their workings. As a result, they have revolutionized the way computers are used to achieve different tasks that include image recognition and transcription of speech to text.\n\nThe opportunities for deep learning and further investment in AI are immense based on the potential of the technology to leverage on other technologies effectively increasing their power. Opportunities also exist in the amount of data required to feed into AI to help solve challenges across the board in different industry sectors.\n\nPresently, the race is on as the large enterprises seek to establish themselves in deep learning by acquiring leading startups in the sector. Some of the leading enterprises in the deep learning space such as NVIDIA the inventor of GPU are championing worldwide efforts to support startups. NVIDIA have a global program to provide support to startups driving innovation in AI and data science.\n\nGlobally, startups are harnessing deep learning for its features such as accuracy and superhuman speed in applications such as fraud detection, self-driving cars, and radiology, according to Kimberly Powell, the senior director of industry business development at NVIDIA. Their endeavor is to support the innovative startups that are blazing the trail in AI and revolutionizing the way we live and work.\n\nThe Inception Program designed by NVIDIA is aimed at providing the startups with access to the latest GPU hardware alongside technical training and access to engineering teams and deep learning experts. NVIDIA is also providing investment for the startups to give them first mover advantage in the development and deployment of products and services.\n\nA good example of the alliances created the NVIDIA program is that with NYU in the development of autonomous driving technology. The alliance has brought together NYU researchers and NVIDIA engineers who have crafted the Drive PX2 chips.\n\nThe team is working together to expand the existent NVIDIA learning system to include all aspects of autonomous driving. Under development and evaluation are the need to eliminate hand programmed rules and procedures such as finding lane markings. It will help to avoid the generation of an almost infinite number of rules such as if, then, else statements from the random events that may occur on the road. The random occurrence of events on the road is nearly impractical to code.\n\nDeep learning is yet to reach the point of truly enabling AI as it has been envisioned. The challenge lies in the fact that deep learning is just utilizing thousands of neurons and millions of connections. Compare this to the human brain on which deep learning modeling, the brain has billions of neurons and trillions of connections.\n\nDespite these shortcomings, deep learning is quite useful since it is achieving much of what enterprises require of it. It is helping to address numerous challenges in the development of technology useful to the society and business world.", 
        "title": "How NVIDIA supports deep learning – Binaryloom –"
    }
]