[
    {
        "url": "https://medium.com/@georgikadrev/busting-the-a-i-pocalypse-myth-we-are-just-scared-from-ourselves-3c34973a4333?source=tag_archive---------0----------------", 
        "text": "As a person who is actively involved in A.I. since my years in high-school till nowadays as a CEO of an image recognition company, I feel personally responsible to bust the frenzy and the myths about A.I.’s potential to endanger humanity, more than any other kind of progress.\n\nFirst and foremost, machines can’t have their own motivation — there are no inherent instincts and emotions to drive such motivation. In human terms it’s ambiguous to distinguish between intelligence, emotional intelligence, and emotions. For machines, though they can simulate emotions to certain extent, and only if said so in advance, it’s not the case.\n\nRelated to that, machines don’t have the survival instinct and the will to dominate, just because they don’t feel and experience neither negative nor positive emotions. They can of course strictly follow the rules, process huge amounts of data and predict and estimate quite well, as clearly shown in the AlphaGo vs. Lee Se-dol matches earlier this month. But it’s not the kind of intelligence interfered with the emotions and the internal motivation that a person has. (Have you ever seen the AlphaGo being happy? What about its creators, or this look on Lee Se-dol’s face after the 4th match?)\n\nHowever, we as people are so used to those instincts that we perceive them as inherent for everything that shows signs of “intelligence”. And the really scary part is actually our own projection as a human kind— the fact that the people are not the strongest or the biggest among other species, but due to their higher intelligence has managed to dominate and take advantage of other species, and more often then never in a really terrible way.\n\nThe computer and its software, as anything else created by us, is just a tool. It’s our responsibility how to use it. And the automation that the so called A.I. can bring could be really useful even for things like early terrorism prevention or saving thousands of hours for manual work on annotating images, among plethora of other use-cases.\n\nIn conclusion I’d like to give you some good food for thought by sharing a personal insight I had a few years ago:\n\nI was in rage about some silly things I can’t even remember when suddenly something written on the stone wall (of a hermit’s cave that I entered a few minutes later) really struck me — “Oh, merciful Lord, please protect my heart from all evil!”. Some may think this means to protect myself from the “bad” people and situations out there. But it really means to protect my own heart from feeling hatred and willingness to misbehave toward others. Only then we are safe and there’s no need to worry about our own shadow :)", 
        "title": "Busting the A.I.pocalypse myth — we are just scared from… ourselves"
    }, 
    {
        "url": "https://medium.com/@gauravchak/finance-has-always-been-fintech-531ab9eeab4d?source=tag_archive---------1----------------", 
        "text": "Every successful company in finance is really a tech company now.\n\nOn the trading side, be it a trading focused bank like Goldman Sachs or the “best hedge fund ever”, Renaissance Technologies, every successful trading company has set up processes that makes the highly intimidating task of risk-taking systematic and dependable.\n\nDo you feel scared when you have to invest? Do you feel have to pick out a few stocks while you really have no idea which ones will do well? I do. RenTec does too, Warren Buffett does too and so does George Soros. The difference is that, they all have a system, which has worked for them. They have all setup processes that are dependable and can be automated to a large extent. Technology is at the core of the success of these firms.\n\nI think of finance as this massively interconnected network of brains and data and systems. The brains and formulae that we have developed over the years are great, but they are all trying to find approximate idealized solutions under a lot of assumptions to the data that our systems have brought to our attention. If we had built different systems we would have come up with different assumptions and different formulae.\n\nIn my humble opinion, the utopian future of finance-as-a-utility is a world of Deep Learning driven investment management, where the “brain” is massive. It is highly interconnected and it has a strict focus on eliminating overfitting.\n\nWell, is anyone using Deep Learning in Trading right now? Yes, Absolutely yes. However, Deep Learning and systematic robo-advising taking over the world of investing are the “what”s and not the “why”. The “why” in FinTech is that technology and data-science has brought method to core aspects of our life like health, education, agriculture. It is simply not possible that a core aspect like investing continues to be something where we all have to literally start from scratch. Investing needs to be a science, a utility and not a competition. We need to make it happen.", 
        "title": "#Finance has always been #FinTech – Gaurav Chakravorty –"
    }, 
    {
        "url": "https://medium.com/@ooohiroyukiooo/google-launches-new-machine-learning-platform-29480ea01300?source=tag_archive---------2----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "Google Launches New Machine Learning Platform – Hiroyuki Takayama –"
    }, 
    {
        "url": "https://medium.com/@Kilblaan123/artificial-intelligence-deep-learning-technology-dad7959903d5?source=tag_archive---------3----------------", 
        "text": "Artificial intelligence (AI) is defined as intelligence exhibited by machines or software. Nvidia Corp. designs graphics processing units for the gaming market, and chip unit systems for the mobile computing and automotive markets. It claims to be at the center of virtual reality, AI and self-driving cars.\n\nDeep learning (DL) is a method of recognizing objects and more recently being able to act based on what an algorithm recognizes. Thus DL qualifies as machine learning, a form of AI.\n\nIn yet one more story on technological advance, this article quotes Nvidia’s CEO, Jen-Hsun Huang, who says in the past two years Nvidia was talking with 100 companies. Industries included advertising, energy, cars, finance, and medicine. Today Mr. Huang says Nvidia is talking to about bout DL with about 3,500 companies.\n\nIt may well be the findings of Oxford University professors Carl Frey and Michael Osborne set out in their 2013 paper “The Future of Employment: How Susceptible Are Jobs to Computerization” (http://goo.gl/C2HA0I). It may also be that the timing they suggested for 47% U.S. job losses to technology by 2033 may be wrong. It may happen sooner than that. For sure that seems to be likely for many of the 752 types of U.S. jobs categorized by Drs. Frey and Osborne in their paper.\n\nRead “One stat shows how artificial intelligence is exploding into the world” at Business Insider — http://goo.gl/GlwxB8\n\nRead our March 23 “Business Transition & Valuation Review” newsletter at http://goo.gl/oUhjBy. Its free. Register at http://goo.gl/s76gpm to receive it in your inbox. Never miss a Post.", 
        "title": "Artificial Intelligence — Deep Learning — Technology"
    }
]