[
    {
        "url": "https://medium.com/digitally-cognizant/do-think-and-learn-framework-for-intelligent-process-automation-by-matt-smith-8e4c7c86ddd8?source=tag_archive---------0----------------", 
        "text": "The business ecosystem of process-automation technologies and the terminology, acronyms, and jargon surrounding it are evolving so quickly that it’s as if technology is outpacing most organizations’ capabilities to make sense of everything.\n\nLet’s not forget the speed of newer products on the scene making the possibilities of automation technologies even harder to visualize.\n\nLet me give you an example. While many companies struggle to embrace the term “robotic process automation” (thinking that robotic must mean physical devices rather than virtual or software-delivered versions), along comes a litany of other technologies and terms–autonomics, cognitive systems, artificial intelligence, natural language processing, emotional recognition, machine learning,\n\n deep learning, intelligent APIs, and neural networks.\n\nWhile the cognitive technology solutions market is projected to exceed $40 billion by the year 2020 (per IDC’s ICT Market Outlook on October 2015 webcast, by Crawford Del Prete), is there a less complex view to understand the potential value of automation?\n\nAt Cognizant, we recognized the need for our client’s to have an “easier to have discussion” view of the automation ecosystem market and break it down into three horizons:\n\nThe ecosystem incorporates automation platforms, tools, and vendors along with their complimentary technologies, or what we call innovation multipliers.\n\nOur current market analysis of the automation ecosystem includes more than 300 individual companies across these horizons. We track and follow these companies as they rapidly respond to the ever changing environment.\n\nWe developed a Intelligent Process Automation framework as well as complimentary solutions that span the “do, think, and learn” continuum. They encompass: automation ideation, center-of-excellence enablement, automation integration, and industry-specific as-a-service.\n\nIntelligent Process Automation is a true differentiator for leaders of shared services, transformation and innovation, outsourcing, and operational areas such as: human resources, finance, supply chain, and support services.\n\nExperience has taught us that in this fast-evolving Automation market, even more important than the technology tools themselves, it is essential to have a mature, established framework to guide the development and delivery of these advanced services.\n\nI would be open to talk to you about how your company can benefit from the possibilities across the Automation Ecosystem. Feel free to drop me a note.\n\nOpinions expressed in this blog are of the author and may not represent Cognizant’s point of view.\n\nMatt leads the Automation Venture for Cognizant’s Emerging Business Accelerator organization. His responsibilities include automation strategy, enablment and market communications. In this…", 
        "title": "Do, Think, and Learn: Framework for Intelligent Process Automation, by Matt Smith"
    }
]