[
    {
        "url": "https://medium.com/@lelayf/installing-mxnet-for-r-on-yosemite-291470055980?source=tag_archive---------0----------------", 
        "text": "In case you missed it, the amazing group of committers behind the dmlc project just released mxnet to run deep learning experiments. For reminders this is the same crowd that maintains the excellent xgboost, a favorite among Kaggle competitors.\n\nIntegrating mxnet in your data science practice should be pretty straightforward as there are wrappers for Python, Julia, C++ and R. Most of the research I do in the context of my Cross Gradient data science practice is based on the R statistical environment. This is fantastic news for R users as it means we can finally use a powerful package to efficiently train deep neural networks or LSTMs on multiple GPUs, all in R. Therefore, I will present my installation procedure of the mxnet wrapper for R compiled with OpenMP support for multi-core parallelism, in a somewhat vanilla Mac OS X Yosemite environment.\n\nDon’t you have it already ? Try typing “git” in a Terminal, if you don’t have it you will be prompted to install it through Developer Tools.\n\nI use a somewhat recent version of R and RStudio. The entire installation will be done using R on the command line so we can safely ignore RStudio for the entire procedure. Spinning a Terminal and issuing the R command :\n\nMake sure you have the most recent version of Rcpp, in my case I had an older version that gave me problems compiling the mxnet package. Upgrading and installing are performed with the same command in R, in this case it pulled version 0.12.1 :\n\nThe compilation of Rcpp initially failed for me because X11 libraries couldn’t be located where they were expected. If it is the case for you too, exit R. Some users suggest creating a symbolic link (sudo ln -s /usr/X11 /opt/X11) to fix this, others suggest installing the latest version of XQuartz, which does that too. I personally when the XQuartz route because I know I will need it for other software (Inkscape for instance). So download XQuartz and install it, after a while it prompts you saying it won’t be the default X11 window manager until you logout and log back in. This is fine and you do not need to log out at this point as all the expected libraries are in /opt/X11. Now go back in R and try again installing Rcpp, just like before. If it completes you’re good to go.\n\nIf you haven’t done so already, Homebrew comes very handy to manage hundreds (thousands?) of third-party packages on your Mac. Here is the classic one-liner to install it from a Terminal prompt :\n\nNow let’s make sure our C++ compiler supports OpenMP to enable parallelization in mxnet. On my old Mac Pro this provided a huge performance boost for xgboost by allowing me to parallelize training on 16 hyper-threads. I am shamelessly assuming it remains true for mxnet.\n\nOpen up a Terminal and use Homebrew to install OpenMP support for the clang compiler that comes by default with Yosemite. We also take this opportunity to install pkg-config.\n\nFor some reason compiling R packages can sometimes require a fortran library, this is one of these times. Download it from here and install using the wizard.\n\nThe R package will essentially rely on the mxnet library to execute parallelized code. A github search through the repository shows that the Rcpp code itself does not contain any parallelization directives. Therefore we have to build this library first.\n\nFrom there you can go in the cloned directory :\n\nNow edit the config.mk with your favorite text editor and change it so that :\n\nNow that you have libmxnet.so built you can build and install the R package.\n\n[update 2015–11–14] The installation procedure has evolved a bit to use a “rpkg” target in the main Makefile and improved package dependencies handling, making those instructions clearly redundant with official docs.\n\nAssuming you are still in the mxnet directory, edit the package Makevars file :\n\nAdd a path allowing linking to fortran libraries. The last line should look like :\n\nNow go one level above the mxnet directory, launch R on the command line and start the installation of the R mxnet package from its sources :\n\nIf all is well, your package should install properly, now ready to be used !\n\nAt this point you should have a functional library and the bench demo should work fine.\n\n[update 2015–11–14] The problem previously mentioned with demos has been fixed.\n\nThe package comes with a basic neural net demo that requires the MNIST dataset. You can go get them at Yann LeCun’s website :\n\nDecompress them in a “data” folder in your R working directory and launch the demo :\n\nIn my next post I will present the creation of a Docker image to perform this setup on the latest version of RStudio Server on Ubuntu trusty, stay tuned !", 
        "title": "Installing mxnet for R on Yosemite – François Le Lay –"
    }, 
    {
        "url": "https://medium.com/@babeeni20/ideas-for-upcycling-baby-smocked-onesies-part-2-f88becd3ff74?source=tag_archive---------1----------------", 
        "text": "Have you got enough of basic baby smocked onesies? Would you like to try something new for those clothes instead of left them in plastic box for storage like forever. In the first part, I introduced two first ideas for upcycling baby smocked onesies which are adding tutus and adding ruffles. Here in this part, I will share more things to do with baby smocked onesies. Keep following!\n\nNormally, baby smocked onesies have small smocked patterns right under the neck, in the middle of the chest. Therefore, in some bare plain places on the garments, you totally can do some simple embroidery in. For example, you can search for some animals’ shapes on the internet, print them onto papers, after cutting and getting the paper shapes, apply them on the bare places on the smocked clothing, draw the line then do simple running stitches or back stitches following the drawn lines. Now you got new looks for your kids’ baby smocked onesies. Some things are livelier, more interesting and more attractive than the old baby smocked onesies.", 
        "title": "Ideas for upcycling baby smocked onesies (part 3) – babeeni20 –"
    }, 
    {
        "url": "https://medium.com/@babeeni20/ideas-for-upcycling-baby-smocked-onesies-part-4-91f35622222a?source=tag_archive---------2----------------", 
        "text": "Another idea for upcycling used baby smocked onesies that you can make baby bibs from the fabrics of them. If cleverly, you can make bibs or even hand applique bibs for your children which can be used and washed normally like trading bibs. If you are not that much clever, then you can make some spare one-time use bibs for necessarily. Bandana bib is recommended in this case because its triangle shape is easy to create. You just need to adjust the garment around your child’s neck for measurement, draw triangle on the garment and make two triangle pieces of fabrics. Now sew two pieces together, set button on one peak and a button hole in another one, then now you have a complete spare one-time use bib.\n\nSummarily, trying simple embroideriy and making baby bibs are two more ideas for upcycling baby smocked onesies. Along with the first two ideas, they are all simple but useful I personally think. Of course there are still some things to do with upcycling baby smocked onesies. If you are interested, then feel free to wait for the next part.", 
        "title": "Ideas for upcycling baby smocked onesies (part 4) – babeeni20 –"
    }, 
    {
        "url": "https://medium.com/@babeeni20/ideas-for-upcycling-baby-smocked-onesies-part-2-5bfc66b48d0a?source=tag_archive---------3----------------", 
        "text": "There is another interesting idea that you can add ruffles on shoulders and at the waist of the baby smocked onesie. Remember to choose colors of ruffles which can mix well with the baby smocked clothing. For the ruffles, you can buy in some craft shops, or you can do it yourself. Steps to create a ruffle are not hard at all. First of all, you need to have a long plate of cotton fabric. From a head of the plate, put the needle at the middle and sew sparse running stitches along the length to another head. Tie of the thread securely then you will have a perfect ruffle to add on used baby smocked onesie for decorating.\n\nIn shorts, I have suggested the first two ideas for upcycling baby smocked onesies. For more tips, please wait for the next part. In case you are interested in baby smocked onesies and want to see more, you can visit our website at babeeni.com.", 
        "title": "Ideas for upcycling baby smocked onesies (part 2) – babeeni20 –"
    }
]