[
    {
        "url": "https://labs.beeva.com/para-qu%C3%A9-usan-las-empresas-las-gpus-3cd4ea2a25c6?source=tag_archive---------0----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "¿Para qué usan las empresas las GPUs? –"
    }, 
    {
        "url": "https://blog.keyreply.com/why-is-summarization-a-superpower-b0ecfb4cf246?source=tag_archive---------1----------------", 
        "text": "Back in school, you probably remember when your teacher told you to read a book and write a summary of what happened. The beauty of summaries lies in the distillation of the most important points in a text or situation, and as a child, helped you to figure out what was superfluous, and what was imperative to good understanding of topics and concepts.\n\nAs you grew up, you probably told people who are “long-winded” to get to the point, and asked a friend to give you a quick update on what happened since you last met; now, you read TL;DRs on Reddit, and your boss asks you for summary minutes of a meeting. You ask your colleague in support what the most recurring issues from customers are, and the sales manager holds an all-hands meeting to report on the top-level metrics for the quarter. Everywhere, summaries are being made and reported, whether at work or in life.\n\nAnother key aspect of summaries is that, other than the main points being surfaced, they were also shorter and easier to interpret. Hence, summaries also help in better understanding, and the end product of summaries tend to be a lot more palatable than trawling through long texts. For example, probably explains the popularity of book abstracts, where the central ideas of a book are quickly expressed, and a ton of time is saved.\n\nTime savings in today’s world is a wonderful effect of summarization. With the endless deluge of more information to process, having a summary of everything relevant to you will boost your productivity endlessly. Having a summary generated automatically will be even more brilliant.\n\nWhen we built the first version of a Slack summary bot, called Slack Digest, in 2015, we had no idea that it would have the potential that it would go on to have. We began to uncover that in a stream of conversations, day after day, it’s easy for people to lose track of what they were supposed to do, and what was said that could be relevant to them. We dug into the minds of the advocates of the product — and it became apparent that information overload was a truest problem of this age.\n\nBeyond chat conversations, customers also told us about being overloaded by collaboration, tickets, timezones, issues, articles to read, meetings, emails, and other streams of information they had to deal with.\n\nSince then, we’ve ripped into a large corpus of summarization research, experimented, implemented and optimized research for production. We’ve applied it on chat, tickets, and other unstructured text data, and are continuously testing its efficacy for helping users efficiently absorb data.\n\nRecent advances in machine/deep learning and GPUs also made for a beautiful playground for us to test hypotheses and produce interesting results for the corpora of community chat and anonymized customer support tickets our partners wanted us to analyze.\n\nTo most, summarization isn’t an obvious problem to solve. If you thought so, you’d not be the only one. Now, the benefits of automatic summarization in the areas we work with are sufficiently clear:\n\nAs our experimentation progresses, the ability to tailor summaries and recommendations to your role and your interests will equip you with skills and time that you can use to expend on worthier tasks (than rummaging around for disparate sources of information).\n\nImagine requesting to know about the status of your business or department: The digest will tell you the progress of projects, what you need to focus on, and where the gaps of work are that you may consider — all in a snap, whether you prefer reading it, or hearing your favorite assistant read it to you on the way to work.\n\nEvery long document that passes your hands comes with a summary that informs you of its contents and implications to you. Everything you needed to know would be distilled down to the shortest possible form, for you to make the right decisions.\n\nWhen you sit in a meeting, a objective summary of the proceedings will be generated, and will automatically add a list of tasks to your calendar and start a workflow on your workstation, ready for you to start working on.\n\nThe far-reaching possibilities of summarization are wide indeed, and we’ll be here to push its boundaries at Digest.AI.", 
        "title": "Why is summarization a superpower? –"
    }
]