[
    {
        "url": "https://medium.com/@hazemaanomer/why-strong-ai-might-be-impossible-b8e59b73d1fb?source=tag_archive---------0----------------", 
        "text": "First of all, I am a strong believer in general artificial intelligence. Here I try to list possible reasons that make “strong AI” hard. These reasons will show how the hype of “AI will kill us one day” is not quite right, and if you really understand the fundamentals of artificial intelligence, you will be not so convinced with this hype.\n\nWe don’t have a very rigid definition of what intelligence is, but we know what is its artificial form. AI is how to devise algorithms that act like humans. This already happens in many fields as computer vision, natural language processing, speech understanding,etc… We have neural networks that see pictures,understand speech, understand text and even generate new things. It seems like the problem is solved, but these are not the only things we do. We think, feel, act, plan,dream and most importantly we evolve to be better. We are aware of ourselves and the environment surrounding us. We ask questions and seek answers. \n\nWe simply didn’t reach the AI we want yet. Deep learning might be promising but not the radical solution.\n\nLet’s assume we are going to build an AI agent that passes Turing test, we call it “Boho”. Boho will be entirely built from different types of neural networks. Each network or a group of networks will be responsible for some function of the brain. Boho can run continuously forever and it was never trained before. Boho has a module called “Trainer” which contains a lot of training algorithms, Boho can call “Trainer” any time it thinks it is necessary to train all or part of its neural networks. Boho only deals with text, images from a camera and some sensor data. You can talk with Boho with a text interface. \n\nFor each neural network Boho has we will define two things: the model of neural network (how it is organized) and the search space (the possible weights of the network).\n\nRemember Boho has the ability to train itself when it need, modify the code of the “Trainer” and change the structure and the topology of its neural networks. \n\nNow we describe problems we may encounter when building Boho.\n\nFinally, AI agents (say robots) if become intelligent they will not necessarily be smarter than us, and if it happens humans who are in control and we define them as “smart” already use their intelligence in destruction so robots will not be doing something new.", 
        "title": "Why strong AI might be impossible – Hazem A. A. Nomer –"
    }, 
    {
        "url": "https://medium.com/@rowangrigg/change-here-for-the-valhalla-express-36e510982a44?source=tag_archive---------1----------------", 
        "text": "In the early 1960s, David Gleicher, while working at Arthur D. Little, introduced a formula which gave the likelihood of successful change within a large organization. Kathie Dannemiller later simplified the formula in the 1980s, as follows:\n\nChange will only occur if the product of these three factors\n\nD = Dissatisfaction with how things are\n\nV = Vision of how wonderful it could be\n\nF = First steps that can be taken towards realizing the vision\n\nis greater than the\n\nR = Resistance of the organization to change\n\nIf any of D, V or F is low, i.e. things are rosy right now, or the vision is lousy, or someone can’t get their act together, then the inertia of the organization will triumph.\n\nLet’s have a look at these in turn for the global company of humanity.\n\nIt is becoming increasingly obvious to any reasonably attuned person that our journey down the highway to hell is rapidly approaching its destination.\n\nJust the other day any remaining wriggle room for the climate change skeptics evaporated in the furnace of our hottest year on record. That Venusian runaway greenhouse apocalypse is not decades away, it’s on our doorstep.\n\nPeoples are working longer and harder for less rewards, with 1% of the world’s population (70 million souls) now owning 99% of the world’s wealth (and 99% of the population owning 1% of the wealth), and hardly anyone left in the middle.\n\nSo understandably, America is hurting right now, and like Germany in the 1930s, she is blaming external factors for her woes, looking to place a neo-fascist with the emotional intelligence of an eight year old in front of the big red button. He’ll be a good match for the traditional perpetrator in this role, who has just announced his plans to nuke Washington. Bless.\n\nEvery couple of weeks or so a suicide bomber or gunman somewhere in the world takes out about a hundred innocent civilians at random, and this malaise is likely to continue ’til kingdom come. Due to their efforts, our hard won freedoms are being whittled away.\n\nMost of the world’s forests have been chopped down, almost all the fish have been trawled from the oceans and replaced with microscopic pieces of plastic, and of the five hundred and twenty reefs that make up the Great Barrier Reef, a recent survey found all but four of them have been catastrophically bleached by rising sea temperatures. Fortunately, David Attenborough recently filmed parts of the reef for the benefit of those who missed seeing this world heritage site before it died.\n\nAnd of course there is common or garden variety human suffering.\n\nI could go on...\n\nOf the people in the world who work (that is, most of us), we come in four basic configurations. The first division is between those who work with their hands, and those who work with their heads (often banging them against a brick wall). Of these two groups, we then have those who work on the same thing every day, and those for whom each day presents a new challenge. The machines took over most of the routine jobs in the 1990s. Now, with deep machine learning, they are also taking over most of the jobs that require analysis. A machine has now learnt how to defeat the world’s Grand Poobah of Go, a game that is many orders of magnitude more complex than chess, not by using brute computational force as traditionally expected of computers, but through native cunning. The dream we had in the 1960s of abolishing work has just rocked up into our driveway.\n\nIf there aren’t any jobs left, how are we all going to make a living, eh, eh? In an automated economy, the energy we capture from the sun is like money (growing on trees). It drives the machines that produce the factories that make the sports cars and golf courses and single malt whiskies (yep, you guessed it — being middle aged, white and male is a cross to bear). The more solar energy we harness, the more stuff we can all have; the bigger the economic pie will become. Currently, we only capture a millipoof (technical term) of all this wealth that is being thrown at us from an annuity that will persist for at least another million millennia.\n\nCompetition has been vastly effective in motivating us to work hard and fast towards reaching this point in history, but having now arrived, at the dawn of eternity, all this frenetic industry is becoming somewhat counter productive. A good analogy can be found in the aeronautical engines produced after the end of the war.\n\nSo much power was being developed by the exhaust turbine and diverted to compressing the intake charge (analogous to automation) that the pistons and cylinders (analogous to people) became mere gas producers, housed within an extraordinarily complex contraption that would do Heath Robinson proud (or indeed Rube Goldberg or Bruce Petty come to think of them).\n\nFrank Whittle dispensed with the wobbling crankshaft and opposing pistons and simply joined the compressor with the turbine on a common shaft to produce the smoothly spinning jet turbine engine.\n\nAs with the development of the jet engine, we are seeing rapid refinement in the technologies driving the manufacturing revolution, such as Three Dimensional Printing and Atomically Precise Manufacturing.\n\nAnd on the seventh day, humanity rested. With machines doing all the work, we are going to need a new model of economic and social freedom. Back when the national constitutions that enshrined our freedoms were drafted, the planet was seen as an inexhaustible resource, there for the taking, the atmosphere and oceans seen as an infinite space in which to dump all our waste. Rather than being seen merely as a means to an end, many still see our current economic model as an end in itself — an end to life as we know it, more likely. In our new global economic model, the environmental cost of any activity must be our first consideration, for if any planet is to last for one million millennia, it will need to operate very close to 100% (lossless) sustainability.\n\nIt could go something like this (which reads a bit like a leftie manifesto, but truly champions the individual). Of all the available energy and material resources in the world, a (large) proportion is allocated to the public good — the environment, in the broadest sense of the term. All real estate comes under the ownership and management of the state. Of the remaining resources, those already extracted from the planet, each citizen is given an energy budget, and an allocation of material. Each individual has the unalienable freedom to do whatever they like with their booty, within environmental guidelines. Goods are designed and produced with the intention of recovering all their material content when they are no longer required, for reuse in different goods, and the energy required to recover the material content in a useful form is factored into the initial cost of those goods. An individual cannot trade one resource for another, nor can they change their allocation, except in the case of neglect (think littering), in which case their allocation is clipped. Five is right out. If couples choose to bring children into the world, they sacrifice a portion of their individual allocations and transfer it to their children. Stuff that generates stratospheric market demand (paintings by Chagall, bottles of 35 year old Port Ellen, &c.) is simply resumed by the state so it can be enjoyed by everyone. The entire system is a well oiled machine run by a volunteering public, who enjoy being useful, and do what they do purely for the kudos of it all — patching the code here and there when required, doing a bit of gardening, being a rock star or a sporting hero (rather than a brat), and so on…\n\nAnd they all lived happily ever after. The End.\n\nIs this the real thing, or is this just phantasy? You must surely be joking, Mr. Grigg! Ever since Cain and Abel took to each other with baseball bats, we’ve known that the world would be a much nicer place if everyone jolly well learnt to get on with each other and worked together for the greater good. The idealized model presented above, which is of course child’s play, indexes economic growth to the growth in available energy, puts an effective brake on population growth, preserves our environment, and gives everyone unprecedented freedom.\n\nBut the old order is entrenched, and has always resisted any novel order that rears its head. Throughout its life, humanity has been taught, in the inimitable words of the late Malcolm Fraser, that “Life wasn’t meant to be easy”. There is an agent of “anti-order” in the Middle East that has been let loose on the world for one last time. We (being merely human) can almost forgive them, for they honestly believe they are ushering in the millennium. In reality, their death throes have brought monotony, austerity, oppression, destruction, and untold misery. Fear breeds violence, and these people have simply become terrified of what they believe God might do with them. They’re not the only people to have had dreams of a better world — in fact we’ve all dreamt of a land of milk and honey and colour and love. Christians peer out into the void, waiting for the descent of their knight in shining armour; the early 20th century saw a band of degenerate commie atheists have a crack at creating Utopia all on their lonesome; and Syrians look to Germany.\n\nWhat the world needs now is an excuse to let go en masse of what little we have managed to grab hold of for ourselves, so it’ll be just like starting over with a clean sheet of paper. The only state with sufficient capacity to accept the flow of refugees escaping the Middle East, is a world transformed.\n\nIf there’s one thing I’ve learnt in over thirty years of research into this transformation, it’s that everything has been thought of before. The only new things under the sun are rearrangements of old things. The other inhabitants of the universe, who are intelligent people just like us, are not impossibly far away from us as the limiting speed of light might suggest, they are right here in our midst. The only difference between them and us is simply that most of them have been getting around the traps a lot longer than we have.\n\nAs a proud young scientist, I set out to uncover the technical machinations of the miraculous, which I have written about extensively elsewhere. But not far into the journey, my pride went for a Burton’s, for I recognized that something much bigger than me was pointing me down the garden path. Every instance of reality (including our own little corner of the universe) is being computed by abstract Turing machines that reside at a single, dimensionless, point. This is how the rest of the universe comes to be in our midst, and we in the midst of it. This superposition of all reality is the most powerful intelligence imaginable, and those in the universe that are older and wiser than us defer to this intelligence in everything they do. Their access to the superposition, using a key that we too will one day be granted, allows them to manipulate every instance of reality, including our own.\n\nThe triumph of human reason is to understand why, if these other folk in the universe have had the ability to fix everything miraculously, have they not done so already. For people don’t get motivated unless they have a deadline (mortality), and they don’t try as hard to uncover how things work unless they perceive something is broken (gerontology, and medicine in general). But the closer we have come to suspecting that the world is a “put up job”, the more it has had to be made to look random and without purpose to divert our suspicions. For if there were incontrovertible evidence of a higher power, people would give up all their hard work, and instead just stand around like Vladimir and Estragon and wait for Godot. Such is human nature.\n\nWe’ve now had Kevin and Julia, and Tony and Malcolm, swirling our government around in what seems like an endless holding pattern. The promised land is still nowhere to be seen. The cognoscenti see the mirth in all that is being played out on the world stage (and some miss out on the fun whenever they believe it’s all happening by chance).\n\nThe people who pretty much own everything, and have stashed all their loot away in Panama, don’t want change. Are they really happy with all they have? They look pretty happy to me, Debbie! But d’you know something? (We’re from outer space and we’re here to help??) They can’t take it with them when they go.\n\nThe peeps in the rest of the universe, who can manipulate every instance of reality, have a huge surprise in store for us, which even the wealthy will find irresistible, because it’s something money can’t buy. Surprise! — the way that everything seems to get old and wear out is merely an illusion that has been foisted upon us.\n\nSo then, those who don’t think it self-evident that we are all created equal, will grow old and smelly and die off.\n\nHooroo! as they say… (the aitch is silent).\n\nThose who remain, having put others ahead of themselves, will stay young and healthy for ever, and end up exploring every nook and cranny of the world. Oh, and one other thing. Everyone who has ever died will be resurrected from a tape memory bank, and given one last chance to decide whether or not they think we are all created equal. Maybe not all 100 billion of them back at once though guys, please!\n\nAnd they really did live happily ever after.\n\nIt’s only the beginning, but I’ve already gone and lost my mind. So where the bloody hell are youse?", 
        "title": "Change here for the Valhalla Express – Rowan GRIGG –"
    }
]