[
    {
        "url": "https://medium.com/@VALOUR/the-future-of-deep-strategy-analytics-in-commodities-trading-8302a09bc59c?source=tag_archive---------0----------------", 
        "text": "Commodity prices have fallen to deep multi-year lows. Uncertainties in the political and economic landscapes, heterogeneous tax, regulatory obligations and ownership laws across different jurisdictions, cross-border movement of data and privacy concerns are pressuring the industry to adapt in order to thrive. The number and diversity of the parties involved in the commodity trading value chain — sometimes technophobic and often operating in silos — hamper the wider adoption of innovations regardless of their nature, incremental or disruptive. The onset and rise of the digital revolution and artificial intelligence (AI) — the next frontier for innovation, effectiveness and performance — hold much promise for corporates. As a result, the banking industry has started pouring time and resources into devising new solutions for corporate demands. Fully integrated and predictive digital frameworks will bring a substantial competitive-edge to all industry players at every stage of the value chain.\n\nDeep Strategy Analytics (DSA) is at the confluence of the digitalization of trading operations, big data and AI. DSA will revolutionize human decision-making, minimize risks, and unearth valuable insights that would otherwise remain hidden, especially when supplemented by management input based on context-specific knowledge. It will integrally facilitate the improvement and optimization of business rules for automated handling of any transaction and other record-based activities. To date, there is no instrument that allows for fully integrated DSA all along the commodity trading value chain. DSA will no doubt disrupt the industry and become a remarkable asset for leading companies to outperform their peers. DSA is still embryonic and amalgamates diverse technologies, techniques and methodologies. Its building blocks — big data, deep learning, the Internet of Things (IoT), blockchain and smart contracts — are set to transmute the commodity trading industry. Big data are datasets whose size are beyond the ability of classic database software tools to capture, store, manage, and analyze. Data alone are worthless. The aggregation and fast processing of consolidated operational, transactional and financial data by self-adaptive predictive models — via deep learning algorithms — will bring a resilient competitive edge to those controlling the entire data flow. Deep learning moves beyond classic computing to create systems that can autonomously learn to perceive and model the “world” on their own. Soon, intelligent agents will deliver dynamic and contextual actions and interfaces. Timely access to data is key and IoT enables it. IoT is ubiquitous sensing and it is changing the world. IoT refers to connected static or mobile objects that have embedded sensors and the ability to send and exchange data over wireless networks. Communications and process technology advancements continue to enable more data collection than ever before from an ever increasing number of sensors monitoring almost anything, anywhere, anytime. The fast analysis and exploitation of IoT data with deep learning algorithms will provide the commodities industry with instant information and real-world knowledge. In addition to pure analytics, DSA can alleviate the growing pressure from consumers and regulatory authorities in different jurisdictions for improved reporting, transparency, and dissemination of data. Blockchain technology is possibly part of the solution. A blockchain — sometimes referred to as a “distributed ledger” — is an electronic, distributed record of all digital transactions of a given asset, real or virtual, within a given public or private network. Of particular interest is its ability to trail, at any given time, every single action, transaction and attributes; such as origination, proof and transfer of ownership, provenance, quality, grading and location of goods. It can bring trust, consistency and transparency to the movement of physical commodities in a supply chain. All digital traces are also visible to any involved parties throughout the lifecycle of the trade. Some major players are now exploring how to use blockchain and enable smart contracts. A smart contract is a computerized transaction protocol that executes the terms of a contract either from human-to-machine or from machine-to-machine.\n\nCertainly, DSA requires a high degree of interoperability in commodity trading workflows to perform at its best. The fragmentation in the industry, the deficiency of global standards, and the self-defeating conservatism of some stakeholders will delay, but surely not stop, the implementation of DSA. The need to capture, aggregate, concentrate and exploit every piece of information, knowledge and data along the value chain is strong. The future of DSA is to develop a unique and intelligible framework that will empower those with instant access to large amounts of data and information from different feeds, providing true competitive and economic insights.\n\nA slightly shorter version of this article was first published in L’AGEFI’s magazine Commodities, Special Edition, March 2016, p.28.", 
        "title": "The Future of Deep Strategy Analytics in Commodities Trading"
    }
]