[
    {
        "url": "https://medium.com/@kaveri_53280/ll-bean-to-gather-data-with-blockchain-506be44c3b0e?source=user_profile---------1----------------",
        "title": "LL Bean to gather data with blockchain – Icecream Labs –",
        "text": "With an attempt to test the combination of blockchain and Internet of Things, LL Bean plans to integrate sensors in coats and boots. The Internet of Things sensors embedded in the coats and boots will collect data and send it to a blockchain system. The data will help analyze a lot of factors related to temperature and movement, and information on how many times the user washes and wears the clothes.\n\nLoomia — the smart technology startup will supply small squares of fabric containing flexible circuits and a device with near-field communications connectivity.\n\nThe clothes and boots powered by Loomia technology are expected to be available for sale later this year.\n\nLL Bean views this technology as a better way to source information from the customers without the use of surveys, product reviews and other traditional methods. They feel this would give them unbiased and clear data on their products and would also help them plan their future merchandising and marketing accordingly."
    },
    {
        "url": "https://medium.com/@kaveri_53280/noobs-guide-on-information-theory-of-convolution-neural-nets-b4e419530b06?source=user_profile---------2----------------",
        "title": "Noob’s guide on Information Theory of Convolution Neural Nets",
        "text": "Machine Learning has been around for a while now and we are all aware of its impact in solving everyday problems. Initially, it was about solving simple problems of statistics, but it has grown much beyond that and can now solve even bigger problems like image recognition.But have you ever wondered about the pace at which this transition has occurred. It has now reached a point where it can actually distinguish a cat from a dog. In this series, we will explore the nature of such networks, and how to manipulate information represented through the network to solve some of the toughest problems around image recognition.\n\nLet’s start from the scratch. Let’s say we have input vectors — specifications of a house, and outputs like the price of the house. For let’s not worry much about the details and just visualize this as though we have information described in a set of concepts(kitchen size, number of floors, location) and we need to represent information pertinent to another set of concepts (price of house, architecture quality etc). This is basically conversion from one conceptual representation to another conceptual representation. Now think how a human would have solved it ?\n\nHe (say Alex) would probably have a mathematical way to convert this from one conceptual representation to another through some ‘if-else’ condition to start off. If he (say Bob) was slightly smarter, he would have converted input concepts into some intermediary scores like simplicity, floor quality, noise in the neighbourhood, etc. And he would also cleverly map these scores to the corresponding final output, say price of the house. If you see what has changed from noob real estate agent(Alex) to a slightly smarter real estate agent (Bob) is that he mapped input-output information flow in detail. In other words, he changed the framework in which he thought he could best represent the underlying architecture.\n\nSo the difference between Alex and Bob’s thought process was that Bob could figure out that secondary concepts are easy to calculate and he can combine them to represent the final desired output whereas Alex tried to write an entire ‘if-else’ logic for each one of the input variables and mapped it with each one of the output variables. Bob in a way represented the same mapping in a more systematic way by breaking them into smaller concepts and just had to remember fewer concepts. Meanwhile, Alex had to remember how every input is connected to every output without breaking it into smaller concepts. So the big lesson here is that the framework of thinking is everything.\n\nThis is what most researchers have realized. Every researcher has the same problem, let’s say cat vs dog image. They too have to convert information from one conceptual representation (pixels) to another conceptual representation (is-cat is True/False).They also have almost the same computational power(memory, complexity etc), hence the only way to solve this problem is to introduce the framework of thinking that decodes inputs with minimum resources and converts it from one form to another. You would’ve already heard about a lot of ‘frameworks of thinking’. When people say Convolutional Networks, it simply means — it is a framework of representing a particular mapping function. Most statistical models that predict house prices are also just mapping functions. They all try to best predict a universal mapping function from input to output\n\nCNN(Convolution Neural Networks) are a form of functions that uses some concepts around images — like positional invariance. That means the network can re-use the same sub mapping function from the bottom part of the image to the top part of the image. This essentially reduces the number of parameters in which the Universal Mapping function can be represented. This is why CNNs are cone shaped. Here we move from concepts that are space oriented (pixels) to concepts that are space independent (cat-or-not, has-face). That’s it. It’s that simple. Information is smartly converted from one form to another.\n\nRecent advancements in Neuroscience has essentially said the same thing regarding how we decode the information in the visual cortex. We first decode lines, then decode objects like boxes, circles, curves etc, then decode them into faces, headphones etc.\n\nA lot of Machine Learning/Deep Learning/AI technologies have very simple conceptual frameworks but the reason behind it solving mammoth problems lies in the complexity that arises from a whole lot of simple-conceptual-frameworks that are attached end-to-end. It is so complex that we can’t really predict whether these networks can solve any kind of problem. Yet, we have been implementing them on a day to day basis based on some sort of assumption. It’s very similar to the human brain. We know its underlying structure and framework. We discovered it half a century ago. Yet, we’ve not been able to decipher this complex world and we are still unsure as to when we’ll reach such an understanding."
    },
    {
        "url": "https://medium.com/@kaveri_53280/ai-to-take-care-of-the-trolls-d10fd32462dc?source=user_profile---------3----------------",
        "title": "AI to take care of the trolls – Icecream Labs –",
        "text": "With AI, people may have to think twice before re-tweeting trolls.\n\nThe rise of social media has led to an increase in hate speech. While many AI platforms have tried to tackle the issue, it still remains a challenge for social media channels. While the challenge still remains big, some private companies are taking a shot at anti-hate bots to clean up a few social platforms.\n\nA new campaign launched recently called “We counter hate” aims to keep a check on hate speech. Re-tweets from hate speech is converted into donations for an organisation countering hate, called ‘Life After Hate’. They have teamed up with Spredfast to train AI to identify Twitter trolls. Once the AI detects the hateful speech, a human moderator steps in with the right response.\n\nMachine learning analyzes thousands of tweets and identifies hateful ones in seconds. Enterprise level AI platforms for natural language processing and image recognition APIs review and interpret tweets in real time. Spredfast, the intelligent social listening platform then classifies it into streams of hate speech. These streams are fed into machines to understand human languages and learn better."
    },
    {
        "url": "https://medium.com/@kaveri_53280/voice-assistants-weigh-in-on-super-bowl-f2736ab8fa5e?source=user_profile---------4----------------",
        "title": "Voice Assistants weigh in on Super Bowl – Icecream Labs –",
        "text": "Leading up to the 52nd Super Bowl, quite a lot has changed since the first game. A movie ticket was priced at $1.25 in 1967 and color TV just started gaining popularity. Today the big game can be streamed on our handsets and pocket computers, and voice assistants powered by Artificial Intelligence, are there to give us the latest updates.\n\nThe three voice assistants are following their own fun approach on predicting who wins the game. While Apple Siri was playing it straight, Google powered AI had its set of multiple responses for the same question. Google’s voice assistant was also accompanied by crowd cheer. When Amazon’s Alexa was asked “Who will win the Super Bowl?” it responded in a more human friendly manner with pauses and coughs making Super Bowl conversations more fun. The Super Bowl ads with voice assistants have also become quite popular. Cardi B is the voice of Alexa for Amazon’s Super Bowl ad."
    },
    {
        "url": "https://medium.com/@kaveri_53280/mits-intelligent-quest-for-ai-moonshots-ddd6624ef10e?source=user_profile---------5----------------",
        "title": "MIT’s Intelligent Quest for AI moonshots – Icecream Labs –",
        "text": "The institute’s Intelligent Quest initiative is to leverage AI reseach for two main categories it considers game changing. The plan is divided into two categories — “Core” and “The Bridge”.\n\nReverse-engineering human intelligence (Core) will give new insights into developing new algorithms and tools, which can be applied to different disciplines. They believe that understanding the brain becomes easier with new computer science techniques. It is very closely linked to cognitive science, computer science and near science.\n\nThe Bridge provides access to AI and ML tools across various disciplines. Research from both MIT and other schools will be made available for this. The idea is to build machine intelligence the way the human brain works. The blanket partnerships the school has had in the past includes MIT-IBM Watson AI lab.\n\nArtificial Intelligence has always been a focus for MIT and the institute has been researching the space since the late 50s"
    },
    {
        "url": "https://medium.com/@kaveri_53280/blockchain-the-retail-advantage-9cffea26e04c?source=user_profile---------6----------------",
        "title": "Blockchain — the retail advantage – Icecream Labs –",
        "text": "While there is much spoken about blockchain, cryptocurrency and its effects on the supply chain, what’s also relevant is its impact on retail. Cryptocurrency has a larger potential to address certain problems in retail commerce.\n\nRetail is among the first industries who’ve benefited from blockchain technology. It ensures the authenticity of products, blocking availability of counterfeit products. Blockchain also helps locate stolen items and protects customers and retailers from any kind of fraudulent transactions. For the second hand market of luxury goods, blockchain becomes a good means of authenticating their products. Adoption of blockchain can help the second hand goods market garner more trust from customers by reducing the no:of counterfeit products.\n\nFor a vendor to sell a designer product, he has to produce a cryptographically signed digital asset issued by the original retailer. Blockchain adds digital cash to a customer’s wallet that can be used to make a purchase.\n\nBlockchain also impacts supply chain and makes it more transparent. In today’s times, consumers are increasingly concerned about the quality of the food and the sources from where they procure food. Blockchain technology allows transparent recording and takes care of all other compliance. There are companies running such systems to promote environmentally sustainable production and social good.\n\nRecently in China, Blockchain technology helped in fighting the fake goods market.\n\nOnce something is stored in the blockchain, it cannot be changed, and so this makes the blockchain a proof of existence.\n\nA database of the information that needs to be stored is pegged to the blockchain by encrypted signatures that can be validated against a transaction.\n\nRetail shops can also benefit from the blockchain by using it as a tracking system for inventory, and also using it to audit information on customer transactions.\n\nThe ownership and transfer of blockchain currencies, connected to a particular outlet can indicate the health of a store."
    },
    {
        "url": "https://medium.com/@kaveri_53280/humanoid-robot-to-build-the-first-martian-habitat-d93c6399a159?source=user_profile---------7----------------",
        "title": "Humanoid Robot to build the first Martian habitat – Icecream Labs –",
        "text": "How can we imagine civilization on Mars without specialists to take up the task and help humans. Justin — the humanoid bot developed by the German space agency DLR is being groomed to build the first human habitat in Mars. With the new AI upgrades, Justin can think like human beings. Justin can perform complex tasks without being programmed in advance. With computer vision and object recognition Justin can do cleaning, inspecting equipments, and carrying objects.\n\nRecently, Justin fixed a faulty solar paner in a Munich lab, and did it within minutes, taking directions from an astronaut at the International Space Station. Justin weighs 440 pounds and can generate a 3D view of surroundings with the hi-def cameras and sensors embedded in the head. The humanoid bot works on a R2D2-style data interface that can sync up to computers, and other data centres."
    },
    {
        "url": "https://medium.com/@kaveri_53280/alibaba-moves-into-smart-homes-with-its-new-iot-project-35fc576ac6e3?source=user_profile---------8----------------",
        "title": "Alibaba moves into smart homes with its new IoT project",
        "text": "Alibaba’s AI labs is working on an IoT project to bring more intelligence into homes. The Chinese E-commerce giant in an alliance with Taiwanese chipmaker MediaTek would develop a uniform connectivity protocol for consumers to control their home devices through a single portal.\n\nThe coverage area of the Bluetooth can be extended with Mesh networking.\n\nThis enables devices to exchange data from multiple devices within the vicinity. Alibaba said it would be the first vendor in China to avail Bluetooth mesh technology on a large scale. The new solution will automatically pair with Alibaba’s voice-assist product, Tmall Genie equivalent to Google Home or Amazon Echo.\n\nAlibaba’s head of A.I. Labs Miffy Chan said: “Bluetooth mesh technology has the advantages of being open, low-cost, high-efficiency, and it supports the majority of Bluetooth devices in the market. Pushing for a unified connectivity standard will cut down risks and costs for smarthome manufacturers."
    },
    {
        "url": "https://medium.com/@kaveri_53280/googles-automl-to-train-your-own-ai-tools-without-coding-fbe5b09eb479?source=user_profile---------9----------------",
        "title": "Google’s AutoML to train your own AI tools without coding",
        "text": "The company’s Cloud Auto ML lets you create your image recognition tool by just dragging and dropping. Google is taking it’s AI-easy approach a step further with CloudAutoML — a tool that lets users train their ML algorithms from scratch, without writing a single line of code.\n\nIt was announced at Google’s I/O conference last year. AutoML will help solve the big problem of making AI less painful to code. It offers users a simple graphical interface to train their own machine learning model. For now, the service is limited to image recognition allowing users to drag and drop a set of pictures leaving the rest to the software, to pick out recurrent items.\n\nIn a blog post, Google’s chief scientist of cloud AI, Fei-Fei Li, said: “Currently, only a handful of businesses in the world have access to the talent and budgets needed to fully appreciate the advancements of ML and AI. There’s a very limited number of people that can create advanced machine learning models.\n\nWhile Google has offered pre-trained machine learning models via APIs that perform specific tasks, there’s still a long road ahead if we want to bring AI to everyone.”"
    },
    {
        "url": "https://medium.com/@kaveri_53280/work-out-and-get-rewarded-4dce3ad4426a?source=user_profile---------10----------------",
        "title": "Work out and get rewarded – Icecream Labs –",
        "text": "What if someone told you that you can earn a crypto for working out?\n\nWork outs will no more be monotonous with this reward based app Sweatcoin that has risen to the top of the App Store. The startup has around 5 million users, and has been gaining more popularity for their unique way of getting people to sweat it out. With more than two million weekly users, Sweatcoin is the fastest-growing fitness app, only second to Google’s Arts & Culture app.\n\nOnce you signs up, you can link your smartphone’s health and fitness data and GPS location to the app. The app rewards the user with a monetary “sweat value” according to body movements and no:of steps taken in a day.\n\nThe user gets rewarded .95 in “sweatcoins” for every 1000 steps recorded.\n\nThese coins can be later traded for fitness gear, gift cards, and other offerings.\n\nBut it isn’t so easy to get those sweatcoins, the app only tracks steps taken outside, so you won’t be rewarded for walking on a treadmill at the gym. But the idea is still great. Who doesn’t like to get fit, and also get paid for it?"
    },
    {
        "url": "https://medium.com/@kaveri_53280/g-commerce-disrupts-the-gifting-industry-da5f733d8346?source=user_profile---------11----------------",
        "title": "G-Commerce disrupts the gifting industry – Icecream Labs –",
        "text": "Gifting isn’t the same as it used to be. Thanks to last minute gifting. This has led to a massive change in the gifting industry, with Loop Commerce.\n\nLoop Commerce is disrupting the $200 — $300 billion gifting market with their understanding of gifting commerce — changing the gift buying and receiving experience for customers. Loop Commerce have reasons to believe that all consumers have different mindsets while they shop and so the experience can’t be the same.\n\nThe platform takes care of virtual gifting by making all products easily giftable. Gift recipients can unbox their gifts virtually through a beautiful experience online. They can also exchange their gift with something else. One of the main issues retailers face is a decrease in the number of transactions per customer that results in lesser sales. Professor Dan Ariely, expert in Behavioral Economics works closely with Loopcommerce, a lot of studies on consumer psychology and behavioral economics confirm that gifting is an emotional process.\n\nLoop Commerce data suggests that around 40% of the gifts are purchased on the day of the occasion or the day before, since a lot of people forget to buy gifts. Many retailers don’t take this last minute gifting habit into consideration , which leads to customer drop off. Some of the largest retailers are slowly adopting Loop’s solution. Implementing G-Commerce can help retailers increase customer satisfaction and double conversions."
    },
    {
        "url": "https://medium.com/@kaveri_53280/quality-training-data-set-can-impact-ml-models-b27c18ea963d?source=user_profile---------12----------------",
        "title": "Quality training data set can impact ML models – Icecream Labs –",
        "text": "Machine Learning is growing at a fast pace and a lot of data scientists are now focusing on results driven by real world insights and applications. Datasets help Machine Learning models to ‘learn’ more. Trained data trains the ML program in building a particular type of model. It is then passed through raw/real data that it hasn’t been trained on with the test dataset.\n\nTest data set is the data on which the program was trained with the training dataset. Both test and training data set will align with representative population samples. This results in better outcomes that are universally accepted for the said sample.\n\nYou need to do the right assessments and get answers to the following questions on quantity of data :\n\nWhether it is to build or test the model, data is integral. You need to follow an approach to split dataset into two portions. There are two kinds of splits that can be done — time based or random. Not all datasets follow the same approach. For some, you need two different kinds of samples — clustered and stratified.\n\nA small pilot test can help validate your model.\n\nA lot of data scientists have solved problems in the past producing training datasets for different modeling requirements. Applied Machine learning problems make it easier to obtain the right set of data. By going through studies, problems similar to yours, you can use the data for more effective models.\n\nThe ML algorithms learn from the data you feed it. So the input data should be of good quality to ensure the learning algorithms are of good quality. The GIGO(Garbage In Garbage Out) approach becomes really integral for machine learning.\n\nYou need a subject matter expert to run through the data to check quality. The person will be able to determine if the sample is independent and evenly distributed.\n\nOnce the clean data is processed, you can transform it based on your objectives for ML training. The right kind of transformation can be determined by your algorithm functions and domain expertise. This can then be applied to power the training dataset. This step helps make the data ready of analysis."
    },
    {
        "url": "https://medium.com/@kaveri_53280/smart-ring-to-change-musical-notes-89ab472f674e?source=user_profile---------13----------------",
        "title": "Smart ring to change musical notes – Icecream Labs –",
        "text": "A lot of cool stuff was part of the showcase at this year’s CES 2018.\n\nAmong those, the one that caught our attention was this smart ring. It is to be worn while playing a MIDI keyboard. Your hand and finger movements can change the vibration and intensity of the musical notes.\n\nEnhancia’s MIDI Ring controller built by a team from France, impacts the sound of musical notes. The integrated sensors in the ring picks up your hand gestures and sends it back to a hub plugged into your keyboard. You can also modulate the volume with basic hand movements.\n\nThe Enhancia team plans to show up on Kickstarter by March. They are still working on the pricing of the product, and are preparing to launch soon. This new ring can revolutionize music, and give you better control of your musical instrument.\n\nMusicians can definitely benefit from this controller ring on their fingers."
    },
    {
        "url": "https://medium.com/@kaveri_53280/deep-belief-networks-all-you-need-to-know-cb708774ee3a?source=user_profile---------14----------------",
        "title": "Deep Belief Networks — all you need to know – Icecream Labs –",
        "text": "With the advancement of machine learning and the advent of deep learning, several tools and graphical representations were introduced to co relate the huge chunks of data. Deep Belief Networks are a graphical representation which are essentially generative in nature i.e. it generates all possible values which can be generated for the case at hand. It is an amalgamation of probability and statistics with machine learning and neural networks. Deep Belief Networks consist of multiple layers with values, wherein there exists a relation between the layers but not the values. The main aim is to help the system classify the data into different categories.\n\nThe First Generation Neural Networks used Perceptrons which identified a particular object or anything else by taking into consideration oits “weight” or pre-fed properties. However the Perceptrons could only be effective at a more basic level and not in advance technology. To solve these issues, the Second Generation of Neural Networks saw the introduction of the concept of Backpropagation in which the received output is compared with the desired output and the error value is reduced to zero. Support Vector Machines created and understood more test cases by referring to previously input test cases. Next came directed acyclic graphs called belief networks which helped in solving problems related to inference and learning problems. This was followed by Deep Belief Networks which helped to create unbiased values to be stored in leaf nodes.\n\nDeep Belief Networks are composed of unsupervised networks like RBMs. In this the invisible layer of each sub network is the visble layer of the next. The hidden or invisible layers are not connected to each other and are conditionally independent. The probability of a joint configuration network over both visible and hidden layers depends on the joint configuration network’s energy compared with the energy of all other joint configuration networks.\n\nThe first step is to train a layer of properties which can obtain the input signals from the pixels directly. The next step is to treat the values of this layer as pixels and learn the features of the previously obtained features in a second hidden layer. Every time another layer of properties or features is added to the belief network, there will be an improvement in the lower bound on the log probability of the training dataset.\n\nMATLAB can easily represent visible layer, hidden layers and weights as matrices and execute algorithms efficiently. Hence, we choose MATLAB to implement DBN. These handwritten digits of MNIST9 are then used to perform calculations in order to compare the performance against other classifiers. The MNIST9 can be described as a database of handwritten digits. There are 60,000 training examples and 10,000 testing examples of digits. The handwritten digits are from 0 to 9 and are available in various shapes and positions for each and every image. Each of them is normalized and centered in 28x28 pixels and are labeled. The methods to decide how often these weights are updated are — mini batch,onlie and full-batch. Online learning takes the longest computation time because its updates weights after each training data instance. Full-batch goes through the training data and updates weights, however, it is not advisable to use it for big datasets. Mini-batch divides a dataset into smaller bits of data and performs the learning operation for every chunk. This method takes less computation time. Hence, we use mini-batch learning for implementation.\n\nAn important thing to keep in mind is that implementing a Deep Belief Network demands training each layer of RBM. For this purpose, the units and parameters are first initialized. It is followed by two phases in Contrastive Divergence algorithm — positive and negative. In the positive phase, the binary states of the hidden layers can be obtained by calculating the probabilities of weights and visible units. Since it is increases the probability of the training dataset, it is called positive phase. The negative phase decreases the probability of samples generated by the model. The greedy learning algorithm is used to train the entire Deep Belief Network. The greedy learning algorithm trains one RBM at a time and until all the RBMs have been taught."
    },
    {
        "url": "https://medium.com/@kaveri_53280/time-machine-to-capture-those-best-moments-396d6e3c6c7c?source=user_profile---------15----------------",
        "title": "Time Machine to capture those special moments – Icecream Labs –",
        "text": "A lot of times we do miss those unexpected moments like a baby’s first steps. What if there’s an answer to such problems?\n\nRoader’s Time Machine camera rewinds time and records the best moments. This is possible with the camera’s feature that constantly records, so when a big moment happens you can capture the previous 10 seconds that’s already recorded in ready mode.\n\nWhen you hit the capture button, the camera captures the previous 10 seconds and records for the next 10 seconds, and so in total the user has around 20 seconds of video. The video is recorded in two threads and it transfers automatically to your smartphone via Bluetooth.\n\nThe makers were inspired by the idea of video buffer, where a video is recorded ahead of when it is needed, in this case the buffer is used to store 10 seconds of video temporarily.\n\nThe camera will be launched by the company at CES 2018, the big tech trade show is Las Vegas."
    },
    {
        "url": "https://medium.com/@kaveri_53280/the-first-pc-with-alexa-f50bd31ebb11?source=user_profile---------16----------------",
        "title": "The first PC with Alexa – Icecream Labs –",
        "text": "HP Pavilion Wave will be the first PC to integrate with Alexa to do a lot of day to day tasks. Alexa has around 25,000 skills and can play music, control smart home devices and do many such tasks. The PC runs on Windows 10 and so the Pavilion Wave can speak to Microsoft’s AI assistant Cortana. The other brands that are planning to bring Alexa into Windows 10 laptops and desktops are Lenovo, Asus and Acer. A colourful LED on the front of the Pavilion Wave lights up to give alerts on whether Alexa is listening and recording a command. Alexa in personal computers can also show visuals in response to requests. Other additional features may be added soon.\n\nBrands now realize that a voice interface can make daily tasks much easier.\n\nA lot of Alexa’s features may not be present in the HP Pavilion. Messaging and calling, security camera feeds, and access to Spotify, Pandora, Tune In won’t be available in the initial launch. Recently Amazon also released the Mobile Accessory Kit to bring the AI assistant to more wearable devices. Brands like Bose, Jabra, and iHome have already started using the Alexa Voice service extension."
    },
    {
        "url": "https://medium.com/@kaveri_53280/smarter-way-to-fold-clothes-78e77d75e8a2?source=user_profile---------17----------------",
        "title": "Smarter way to fold clothes – Icecream Labs –",
        "text": "The German appliance manufacturing giant BSH has partnered with FoldiMate to bring laundry-folding robot to market.\n\nLast year, FoldiMate was able to achieve a good foothold in the Consumer Electronics segment. This time the company is back with a partnership with BSH for their new device.\n\nWith this, we can say without doubt that the robot folding days will soon become a reality.\n\nCurrently, this is not the only robot folding technology, Seven Dreamers is working with Panasonic on the laundroid which aims to launch a laundry folding machine for the masses. Laundroid is backed by $90 million in capital and the founders are Henry Kravis and George Roberts.\n\nThe two devices are different in terms of pricing.\n\nHeadquartered in Munich, BSH is the second largest appliance manufacturing company in the world, second to the leader Whirlpool"
    },
    {
        "url": "https://medium.com/@kaveri_53280/food-industry-to-benefit-from-ar-and-vr-92665e2d2e2d?source=user_profile---------18----------------",
        "title": "Food Industry to benefit from AR and VR – Icecream Labs –",
        "text": "More and more F&B businesses are realizing the potential of AR and VR to improve sales and revenues. Businesses are willing to invest in three main areas — human resources, food products, and customer experiences, and they are continuing to explore more possibilities to boost processes.\n\nChanging customer experience with interactive marketing has helped brands scale. Events like the Museum of Icecream and 29 rooms have convinced many brands in apportioning ad dollars to sponsorships and experiences. AR & VR has helped improve consumer interest by activating all senses. F&B events have gained a lot from VR experiences. Creating shareable content and augmenting the physical world has been the focus of AR in experiential marketing. Keeping visual experience at the core of it all, brands have realized the value of AR & VR to educate and incite customers. This drives interest and purchase decision.\n\nWhen the product content extends beyond its physical place, and becomes more interactive and engaging, it can influence customers. AR bridges the gap between customer, product and product content. Visual interactions on top of products helps connect the visual world with the real one seamlessly. Technology can be used to educate consumers on different aspects of products like — the nutritional information, product composition and so on.\n\nBrands like Walmart and Kraft have experimented with AR backed summer sweepstakes to sell more Kraft products. Nestle used a character from the movie Rio for an AR game. More brands are adapting to new and improved methods of reaching out to their customer base in unique and interactive ways."
    },
    {
        "url": "https://medium.com/@kaveri_53280/jds-fully-automated-warehouse-e570e30d928d?source=user_profile---------19----------------",
        "title": "JD’s fully automated warehouse – Icecream Labs –",
        "text": "Yes, you heard it right!\n\nImagine “ordered” to “shipped” all taken care of by robots. Lots of robots. Well, this is a reality at JD’s warehouse, that functions without human intervention. JD is Alibaba’s biggest rival and is using it’s all automated warehouse to secure a much needed competitive edge. Robots take care of the warehousing bit, from scanning of items when an order is placed, packing the items and placing it in trucks. The scanned items are bubble wrapped, and boxed and sorted as per location, all by robots doing it faster. The final output, the boxes are placed in the trucks and taken for delivery.\n\nAvoiding human intervention makes the process faster and seamless. And with the e-commerce boom, its the right time to automate logistics to ensure customer satisfaction. The first step to achieve this is automated warehousing that can take care of the increasing consumer demand. JD has around 335 warehouses, including fulfillment centers, small warehouses and cold chain facilities."
    },
    {
        "url": "https://medium.com/@kaveri_53280/future-retail-predictions-731ed013fb?source=user_profile---------20----------------",
        "title": "Future retail predictions – Icecream Labs –",
        "text": "As 2018 is fast approaching, there’s this question in the minds of both retailers and tech enthusiasts “What’s the next big thing in retail?”\n\nWhile there were many technology trends that caught the eyes of top decision makers, the following are the ones that stood out :\n\nReal time demand for products, AI powered conversational commerce, chat, voice assistants and personalized shopping experience via subscriptions and services.\n\nThe real time demand for products saw an increasing trend in 2017. This shows the growing adoption of same day delivery. This has also led to a jump in demand for international products which points to the importance of improving cross border delivery.\n\nAI powered conversational interfaces can answer questions, and work as human chat support with voice-based shopping. Imagine walking into a store and just using your voice to ask the store app to get your product, and not just that, if the app also has the feature to tell you where exactly the product is on the store map. How convenient would that be?\n\nSince the way users shop is changing on a daily basis, the way shopping is done also must change accordingly. Curating boxes of personally picked items can improve shopping experience and convert more customers.\n\nAutonomous vehicles are already being test driven to meet the growing consumer demand for real time delivery. This can help boost retail traffic in urban areas."
    },
    {
        "url": "https://medium.com/@kaveri_53280/three-new-photography-apps-by-google-5f00e5cf8405?source=user_profile---------21----------------",
        "title": "Three new photography apps by Google – Icecream Labs –",
        "text": "As part of a new series of dubbed photography experiments, Google is launching three new photo apps. The apps are to test out experimental features and user response to it, and so it is available on both Android and iOS App Store. Storyboard, Selfissimo and Scrubbies are the all new photo apps by Google. Storyboard converts videos into single page comic layouts. It is more of an art inspired photo effect app.\n\nThe second app Selfissimo, as the name suggests is an app designed for the best selfies. The app acts like an automated selfie photographer that creates black and white selfie photos, and finally giving you a complete sheet of such photos.\n\nThe apps are based on a number of technologies — object recognition, stylization algorithms, efficient image encoding and decoding technologies.\n\nGoogle considers this as the first of the many appsperiments they may conduct in future as well.\n\nGoogle has launched similar apps before, earlier they developed MotionStills for Live Videos to improve a user’s visual experience. This app is based on Live Photo editing technology."
    },
    {
        "url": "https://medium.com/@kaveri_53280/microsoft-simplygon-cloud-3d-object-optimization-6d0e57d54bf5?source=user_profile---------22----------------",
        "title": "Microsoft Simplygon Cloud 3D object optimization – Icecream Labs –",
        "text": "Microsoft acquired Simplygon — the 3D optimization service. With the launch of Simplygon Cloud, we are seeing the impact of that acquisition. The company believes that Simplygon Cloud will help game developers integrate the tool into their workflows making content more user friendly with AR and VR platforms. The tool works to reduce polygon complexity for 3D objects making it easier to render in times of high demand for resources.\n\nLast week Google announced PolyAPI that makes it easier for game developers to import 3D assets.\n\nAs the name suggests, what Microsoft is now doing is sending this capability to the cloud, to ensure asset delivery across specced platforms with unique cloud-based 3D pipelines for object libraries.\n\nSimplygon stands out when compared to its competitors because of its ease of reducing complexity, supporting game devs in minimizing high detail 3D objects and allowing Simplygon to minimize them for different platforms. This gives developers the advantage of not rebuilding objects as compute capabilites increase over time."
    },
    {
        "url": "https://medium.com/@kaveri_53280/chinas-popular-newsapp-toutiao-43a3a8048a46?source=user_profile---------23----------------",
        "title": "China’s popular newsapp Toutiao – Icecream Labs –",
        "text": "A Beijing based tech company Bytedance owns one of the most addictive apps in China. The app Toutiao has an active user base of 120 million, and the average time spent per day inside the platform is 74 minutes. Recently the company was in the news for its US$800 million purchase of Musical.ly the video based social app. This was to expand the company’s footprint abroad.\n\nBytedance is now focusing on regions with similar content consumption habits. The independent content platform challenges other players Tencent Tian Tian and Tencent News, both being news based platforms by Tencent. Bytedance is one of the earliest companies to use algorithms to recommend content.\n\nThe app uses machine learning for in-app behaviour based customized newsfeeds. The biggest advantage is that their technology is language independent and can plug in big data from any part of the world."
    },
    {
        "url": "https://medium.com/@kaveri_53280/starbucks-hi-tech-roastery-in-shanghai-95cb867416c7?source=user_profile---------24----------------",
        "title": "Starbucks hi-tech roastery in Shanghai – Icecream Labs –",
        "text": "Starbucks opens its biggest and most hi-tech store ever in China tomorrow. It is said that Starbucks Shanghai roastery is the size of a soccer field, with over two floors. They have partnered with Alibaba to make the store visits interactive.\n\nIf the visitors have Alibaba’s Taobao app installed on their smartphones, as soon as they walk in they’ll see a map of the huge store. Alternatively, they can also scan through the starbucks menu. The visitors can also point to different sections in the store and see what’s happening in real time in an animated form on their phones. These AI explainer animations are applicable for the teas as well. Shanghai Starbucks is also giving Alibaba users a Starbucks roastery photo filter that can be used and shared across social channels.\n\nCustomers can also use the app to pay for their bill via Alibaba’s Alipay or Tencent’s messaging app WeChat. With over 27,000 locations worldwide, 3,000 are in China alone, out of which 600 are in Shanghai."
    },
    {
        "url": "https://medium.com/@kaveri_53280/google-home-multitasking-feature-42a73b5e7a7b?source=user_profile---------25----------------",
        "title": "Google Home multitasking feature – Icecream Labs –",
        "text": "The smart speaker got a little smarter this week with the new multitasking feature. It makes it possible to do two different actions at the same time. Since the Pixel 2 a few months back, Google has been talking about Routines. This is already supported by Alexa and Siri for a while.Tying a bunch of actions to a particular command. But this time, its something different.\n\nYou can now simply ask the device to perform two things at a time. But this doesn’t mean you can keep adding to the number of tasks. The device understands two tasks at a time, but you need to ensure that they are not clubbed in the same sentence. This new feature comes in as the company readies Home Max — a premium addition that will release sometime soon. Google has done quite a good job by enhancing Echo’s skill set with this feature. You can now get your device to change the temperature and play music at the same time."
    },
    {
        "url": "https://medium.com/@kaveri_53280/datally-by-google-to-control-data-usage-b026016e3431?source=user_profile---------26----------------",
        "title": "Datally by Google to control data usage – Icecream Labs –",
        "text": "Now you can get more on your top up credit by controlling your device’s data usage. With the help of granular control, users can monitor data usage on their phone and cut usage as they wish. As part of a pilot test, Around 500,000 users in the Philippines could save 30 percent of their data plan using the app.\n\nThis apps harps on the fact that most smartphone users have prepaid sim cards in Southeast Asia. Datally gives updates on how much data each app consumes. The app also alerts users when they are near a public WiFi point.\n\nGoogle’s Next Billion Users initiative will also include India based payment service called Tez, a storage saver app, and a data light version of YouTube"
    },
    {
        "url": "https://medium.com/@kaveri_53280/aws-launches-guardduty-1fdb36ebbe5c?source=user_profile---------27----------------",
        "title": "AWS launches GuardDuty – Icecream Labs –",
        "text": "Amazon’s AWS division launched GuardDuty for threat detection today. GuardDuty is to tackle with potential security threats that the company users may face. The threat detection service identifies threats with Machine learning, and recommends solutions to solve the issue.\n\nThis service can be enabled with a simple click. All the user data streams are watched closely by the service and it hints at any possible security issue, including AWS CloudTrail logs, DNS logs and similar sources, it helps monitor API usage and scans for unusual AWS account usage.\n\nGuardDuty recognizes issues, categorizes it into different levels and returns detailed data and suggestions on how to tackle the issue. These alerts can be directly pushed to third party services like Splunk, Sumo Logic and PagerDuty, as well as tools like JIRA, SeriveNow and Slack.\n\nIn the keynote address AWS team said that the reason behind most security errors is misconfigurations. And among many other feature functionalities, GuardDuty keeps a check on this too. The company believes that a lot of these issues can be sorted by keeping humans away from data."
    },
    {
        "url": "https://medium.com/@kaveri_53280/apple-files-patent-for-foldable-iphone-e26559eb0dd6?source=user_profile---------28----------------",
        "title": "Apple files patent for foldable iPhone – Icecream Labs –",
        "text": "Imagine an iPhone that can be folded, allowing users to open and close it like a book. News is in that Apple has filed a patent for a foldable iPhone. It is said that Apple is working with LG for this new device.The device may come with a flexible display, as per Apple’s patent application.\n\nWith Samsung being one of Apple’s biggest rivals, there are reports that Apple may go with LG instead of Samsung. Apple filed the patent with US Patent and Trademark Office in 2014, and was granted the patent this month.\n\nThe foldable Apple production will start in 2020, while Samsung is expected to launch Galaxy X- its new smartphone with a foldable design. LG also plans to have its own foldable device, its first OLED production at its E5 plant in Gumi,in North Gyeongsang Province."
    },
    {
        "url": "https://medium.com/@kaveri_53280/e-commerce-sales-cross-1-5b-for-thanksgiving-f71380576c31?source=user_profile---------29----------------",
        "title": "E-commerce sales cross $1.5B for Thanksgiving – Icecream Labs –",
        "text": "Usually Black Friday, a day after Thanksgiving gets the maximum attention and is considered the start of the holiday season. With the E-commerce boom, this trend has changed a bit with the rise in Thanksgiving sales figures.\n\nAccording to Adobe, on 100 of the largest retailers, sales have risen by 16.8 percent year-on-year and around 2pm Pacific Time, around $1.52million has been spent in total.\n\nThe overall spend is up by 17.9 percent compared to 2016 and around $1 billion online spend for all the 22 days. This shows that there is increase in consumer faith, when it comes to E-commerce, but also emphasizes on the fact that early promotions have also played a good role in increasing overall sales.\n\nFigures suggest that Thanksgiving is slowly becoming yet another record-breaking shopping day. And following Thanksgiving day, we can expect Black Friday and Cyber Monday follow the trend and see a record spend. Smartphones and mobiles continue to play a strong role in E-commerce purchases. As per Adobe, around 46% traffic comes from smartphones. Smartphones usage have jumped by 15% compared to the previous years.\n\nSmartphones are still better used for browsing than buying. At present, smartphones account for 30.03% of overall sales, which is around 8% up from the previous year."
    },
    {
        "url": "https://medium.com/@kaveri_53280/holiday-sway-with-apple-37bbb0eed641?source=user_profile---------30----------------",
        "title": "Holiday sway with Apple – Icecream Labs –",
        "text": "Every year Apple comes up with a holiday ad, and this time around for thanksgiving Apple airs a new ad in the US with less emphasis on product features compared to the previously released ads. It’s more of a greeting card for thanksgiving.\n\nThe new ad called “Sway” is shot in the streets of Prague. Apple introduces the AirPods in this ad, with a woman playing “Palace” on her white iPhoneX.\n\nThe song takes the woman to an alternate reality, where she continues to dance with no one watching. That’s when her eyes fall on a man, she gives him the AirPod and they dance together.\n\nThis beautiful ad is sure to set the mood for the holidays.\n\nAnd what’s interesting is, the cast in the ad are a married couple in real life.\n\nYou can watch it here : https://www.youtube.com/watch?v=1lGHZ5NMHRY"
    },
    {
        "url": "https://medium.com/@kaveri_53280/apple-acquires-augmented-reality-startup-vrvana-c9f46ec97edf?source=user_profile---------31----------------",
        "title": "Apple acquires augmented reality startup Vrvana – Icecream Labs –",
        "text": "The augmented reality startup Vrvana is acquired by Apple, continuing efforts to release their own new and advanced headset in 2020. The Canada based startup is the maker of Totem headset, which has not been released yet. While Apple has not released an official statement on this acquisition, sources close to Apple have confirmed the news. It is also said that many employees from the startup have already joined Apple’s office in California.\n\nThe Apple — Vrvana deal is said to be of $30 million. Vrvana isn’t digitally active as well following the acquisition. Apple’s ambition to develop new, unique products harping on AR hardware, will thus be fulfilled after this. The VR startup has worked with Audi, Tesla, Valve in the past.\n\nTotum headset is the company’s extended reality device that works on both virtual reality and AR on a single device, thereby improving the experience\n\nThe VR based camera approach adopted by Vrvana is different from its competitors like Microsoft. The Hololens headset works on transparent, projection based displays.\n\nThe biggest advantage Totum has over other competitors is its ability to overlay fully opaque, true-color animations unlike the ghost-like projections which can’t really display the color black. The system of cameras also enable a technology 6DoF that can help track position in 3D space, tracking user hands with infrared cameras."
    },
    {
        "url": "https://medium.com/@kaveri_53280/amazon-echo-goes-red-for-a-cause-b69c1f0c7879?source=user_profile---------32----------------",
        "title": "Amazon Echo Goes Red For A Cause – Icecream Labs –",
        "text": "Amazon Echo Goes Red For A Cause\n\nEcho RED is part of the special limited edition of Amazon’s Echo with a part of the proceeds that’ll be used to support a cause. The fabric outer cover is in the colour red and $10 from the purchase price will go to the Global Fund, towards work fighting AIDS. RED’s official release date is scheduled for December 6th and will cost the same as the other Echo products.\n\nApple has been the other brand that has done something similar in the past, with a range of devices that support the same cause. Early this year, Apple had released a red iPhone.\n\nWhile the Amazon Echo product is going for the same price as the others in the series, the 50% discount when ordering any three second generation Echo devices will not be applicable for the RED Echo. The device also stands out compared to the existing devices, and will sure be eye-catching for those who wish to play with colours. Echo connects to Alexa, plays music, sets alarms, makes calls, asks questions and controls other smart home devices.\n\nEcho is available in a range of styles including fabric and wood veneers. Echo can hear you from any direction, with seven microphones, beamforming technology and noise cancellation.\n\nContributing to a good cause, and getting a smart speaker is not a bad idea and this would definitely be reason enough to get an Echo RED. It’s also available for pre-order in the US.\n\nApart from Apple, many other companies have also gone for RED for charitable purposes."
    },
    {
        "url": "https://medium.com/@kaveri_53280/alibaba-to-acquire-stake-in-sun-art-502ae97e39a1?source=user_profile---------33----------------",
        "title": "Alibaba to acquire stake in Sun Art – Icecream Labs –",
        "text": "The Internet giant is making its latest bet in China’s Sun Art for $2.9 billion. Sun Art Retail operates with around 400 hypermarkets. Alibaba is purchasing a 36% stake in the The Wal-Mart style hypermarket group. Alibaba’s New Retail vision will take life with this alliance, to leverage on the internet based approach and new technology.\n\nThis is to provide a seamless online and offline customer experience in the untapped Chinese market landscape. This will further shake up the $4 trillion retail market. Following the deal, Auchan Retail SA is also said to increase its stake in Sun Art to 36%.\n\nA move into physical commerce will help accelerate its main online business, convert millions of new shoppers and expand network in China. By connecting virtual and online worlds, they can boost online orders and amass large volumes of customer data.\n\nAlibaba is trying to adapt to a Hema model, combining restaurant, supermarket and fulfilment centre at a central location on its technology platform. RT Mart and Auchan are the leaders of China;s hypermarket business with around 15% share according to Euromonitor International. But the growth rate over the last three years is slower.\n\nBy acquiring control of web grocery store Fields HK and Shaghai Diqi Network Technology Co’s Xiahohehe e-commerce business in 2015, Sun Art to make inroads into e-commerce.\n\nAlibaba’s deal is to try and transform old retail. With this deal, Sun Art will get the required resources to expand into new markets. By transforming old school retail they’ll be able to manage inventory better and scale their business."
    },
    {
        "url": "https://medium.com/@kaveri_53280/singles-day-breaks-shopping-records-2a5221bbc29a?source=user_profile---------34----------------",
        "title": "Singles’ day breaks shopping records – Icecream Labs –",
        "text": "China’s Singles’ day saw a record shopping of US $25.3 billion. Singles’ day spends has seen a noteworthy rise since 2011, to a record high beating both Black Friday and Cyber Monday in the year 2012. The customer spend has risen by 50% since last year.\n\n‘Alipay, Alibaba’s mobile wallet app processed around 2,56,0000 transactions per second within the first 10 minutes of the shopping festival. In the next 24 hours, around 1.48 billion transactions were processed. Alibaba’s Singles’ day sales marked a 39% year-over-year increase in sales. This year, Singles’ day brought in $123 million in GMV. By upgrading their physical stores ahead of the festival, they were able to leverage on their growing presence and facilitate delivery.\n\nAround 1,30,000 tonnes of packaging waste was generated during the 24 hour shop fest last year, and this raises concern with less than 10 percent recycled.\n\nConsidering the current scenario, all marketplaces are at loggerheads to convert the most number of customers for the holidays. The Chinese shoppers are estimated to spend around US$ 1.2 trillion during the course of the year."
    },
    {
        "url": "https://medium.com/@kaveri_53280/lead-nurturing-is-one-of-the-most-important-aspects-of-e-commerce-1cc895f1e0cf?source=user_profile---------35----------------",
        "title": "Lead nurturing is one of the most important aspects of E-commerce.",
        "text": "Lead nurturing is one of the most important aspects of E-commerce. While a lot of retail brands focus on lead acquisition — getting people to the landing page from different sources, paid and organic. Not all understand the importance of nurturing a lead until conversion.\n\nThis is where catalogue quality comes into the picture. A weak catalogue will lead to a loss in qualified leads. Your consumer journey from the time he lands on the site, to the final check out depends highly on your catalogue quality. It is important not to lose your consumer at any stage of the conversion funnel. From the product list page to the final payment and checkout, you can nurture your lead by improving your catalogue quality. Products must be properly classified on your landing page, product attributes and images must be complete on your product list page, and the information provided on the product page should be clear and unambiguous.\n\nCatalogue monitoring helps track your catalogue’s health with proper product classification, ensuring product data completeness, avoiding duplication, and identification of any errors in your product information. Catalogue optimising can help personalize a customer’s journey through the conversion funnel, by customizing product titles as per the customer’s search keywords, replacing missing titles, enriching product information, customizing product descriptions, and replacing missing descriptions, and tags.\n\nMaintaining consistent catalogue health helps improve the conversion rate, by not losing out on qualified leads. Around 70% of leads coming through any channel are not all qualified leads, no matter which source they came from. Companies who properly nurture their leads see a 450% increase in qualified leads, and those who nurture and grow those customers see a 50% increase in sales.\n\nIcecream labs helps accelerate business growth with the help of AI and Machine Learning. To know more on how AI can impact your business you can get in touch on LinkedIn, or mail us — support@icecreamlabs.com"
    },
    {
        "url": "https://medium.com/@kaveri_53280/visual-intelligence-to-drive-value-for-businesses-c28bcbca636a?source=user_profile---------36----------------",
        "title": "Visual Intelligence to Drive Value for Businesses – Icecream Labs –",
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out."
    }
]