[
    {
        "url": "https://medium.com/@4quant/schwiizert%C3%BC%C3%BCtsch-learning-the-rules-to-a-language-without-rules-2b957a24edc8?source=tag_archive---------0----------------", 
        "text": "The dialect of German spoken in Switzerland has evolved quite independently of the standard German spoke in Germany (called high-German). Since it is a dialect and not an official language, it poses a challenge for foreigners to learn. It poses a unique challenge because while there are no official rules, there are correct and incorrect usages. Such unstructured problems is exactly where new analysis approaches such as Deep Learning have a huge potential. Basically text can be scanned through one letter at time as shown on the right and each letter can be mapped to a one-hot character vector. A network can then be trained to predict the next letter based on the previous letters and learn to ‘understand’ the language and its underlying rules.\n\nRecurrent Neural Networks in particular can show an amazing, or even alarming ability to learn new and complex tasks. An excellent introduction to the topic is provided by Andrej Karpathy. Basically the recurrent aspect of the network allows for the network to maintain a memory. This means it can go through arbitrarily long sequences and use all of the information for predicting the next value. For language this opens a huge range of possibilities since it means the system is capable of learning structure from existing texts.\n\nOne of the essential aspects of Deep Learning is the ability to train for thousands to million of iterations. The feedback from each step of the training is so minuscule that only the accumulated information from thousands such learnings allows the system to learn complex structure.\n\nNot much sense or structure, spelling or anything, basically a random text generator\n\nAn idea that ‘li’ is a nice ending, a few fun let combinations and some understanding of the role of capital letters.\n\nA much clearer understanding for the language and it is starting to look more like a strange dialect. A few fun things like d’ are already adopted\n\nA few more at least somewhat recognizable words and expressions, but still a long way to go.\n\nResembling even closer swiss german and for some the dialect is even clear. We see below how the following sentence is finished by various iterations of the network", 
        "title": "Schwiizertüütsch: Learning the rules to a language without rules"
    }, 
    {
        "url": "https://medium.com/emergent-future/artificial-intelligence-deep-learning-and-the-arms-race-to-control-tech-s-future-58bc06f7e10e?source=tag_archive---------1----------------", 
        "text": "Artificial Intelligence represents the next chapter of the Information Age, and Google, Microsoft, Amazon, IBM, and others are engaging in an arms race to control the platform that dictate tech’s future writes the New York Times. “The relationship between big companies and deep machine intelligence is just starting.”\n\nSo, what counts as artificially intelligent anyway? The Verge explains the difference between machine learning, deep learning, and neural networks, how they work, and why the future of AI is likely to be more subtle than you think. The next wave in technology isn’t about the technology, but rather the market that emerges from the technology.\n\nDeep learning is “a killer technology,” Nvidia’s CEO says in a Fortune article that covers all things AI, data centers, autonomous vehicles, and more. While AI is still in its infancy, the road to super intelligent apps and machines is starting to come into focus.\n\nWhen you’re ready to deeply learn more, this eBook will teach you how to use deep learning to solve problems related to image recognition, speech recognition, and natural language processing.\n\ntl;dr A Googler explains deep learning in just one minute\n\nDid you enjoy this? Consider joining Emergent Future, a weekly, hand-curated dispatch exploring technology through the lens of artificial intelligence, data science, and the shape of things to come. Emergent Future is powered by Algorithmia, an open marketplace for algorithms, enabling developers to create tomorrow’s smart applications today", 
        "title": "Artificial Intelligence, Deep Learning, and the Arms Race to Control Tech’s Future"
    }, 
    {
        "url": "https://medium.com/@ooohiroyukiooo/if-no-good-in-the-game-of-go-your-next-left-in-porker-s-humanity-game-with-ai-f4e73eef03bc?source=tag_archive---------2----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "If No Good in The Game of Go, Your Next Left in Porker’s Humanity “Game with AI”"
    }
]