[
    {
        "url": "https://engineering.huew.co/introducing-deep-learning-studio-d70d8694c05b?source=tag_archive---------0----------------", 
        "text": "Computer Science (or CS) is at the edge of a revolution; machine intelligence has dramatically improved over last few years and is poised to surpass human intelligence!\n\nWhat is artificial (or machine) intelligence?\n\nHumans are exceptionally better at executing several complex tasks. Take for example, recognizing a person you met 2 years back from a crowd of hundred people at a mall, or identifying a unique music genre from a song playing in the background. Machines (or software programs), however, lagged behind (until now!) in solving such complex problems. We became better at machine learning to solve computationally complex problems (traditional big-data or text mining). However, there was a large gap in these machines solving complex tasks where humans are significantly (and inherently) better at.\n\nThis gap is narrowing down at a fast rate, and machines are becoming as intelligent as human beings! Taking inspirations from the workings of human brain, computer programs are getting better every day in learning patterns and executing complex tasks. Machines can now look at millions of images and identify unique images consisting of a rare dog-breed, machines can now watch videos and interpret different objects and their interactions, machines can now listen to your speech and understand your mood and sentiment. We have entered the age of intelligent machines.\n\nAt the center of this revolution is the ability of CS researchers to build large-scale “deep neural networks” (DNNs). DNNs, in a nutshell, model the ability of human brain to solve complex problems. The past two years have seen exciting research outcomes that have helped CS researchers and engineers to build and apply DNNs to image, speech, video and text analytics; tasks at which machines lagged behind human intelligence. No more! Changing the landscape dramatically, DNNs are becoming better at mimicking neural-activities in human brain and bringing ultra-sophisticated intelligence to software programs.\n\nWhy is there so much buzz around artificial-intelligence (AI) now?\n\nThe buzz in AI is largely surrounding “deep learning”. Deep Learning is about learning multiple levels of representations and abstractions that help in making sense of data such as images, sound, and text. Deep learning arranges artificial neurons (each neuron stores some information) in a sequence of layers and enables these layers to collectively learn (or model) a classification or clustering task.\n\nThere are two key trends defining innovations in deep learning: (a) availability of huge amounts of data which makes it easier for software to learn by examples (learning can’t happen unless we tell machine what is ‘good’ and what is ‘bad’), and (b) advances in computation infrastructure which makes a reality for large-scale models to learn better and faster (what used to take months earlier now takes hours). These trends are making it possible for deep learning to truly define the future of computer industry.\n\nAs a result, analyzing rich media and big data comprising of images, videos, speech and text is no more about writing custom hand-written algorithms; we just need to unleash DNNs! DNNs automatically and accurately learn latent features (or representations) which empowers them distinguish between say breeds of different animals, or genres of music, or sentiments in speech, text data.\n\nWhy are we passionate about using “deep learning”?\n\nWe are excited about the growing scale of user-generated image (or photo), speech, video and text (collectively called “rich media”) data. This opens up tremendous opportunities for us to contribute and solve some of the pressing problems faced by today’s businesses. At Huew, our goal is to scale, simplify and manage rich media of businesses that crucially rely on the utility of images, videos, speech or text data. Let us see a real-world example and understand ‘why and how’ deep learning can help to solve business problems.\n\nLet us think about the need and scale of Internet-based marketplaces (buyer and seller platforms for second hand goods) to make sense out of streams of tens of thousands of photos coming onto their platforms every day. It is well-known that photos on product listings have tremendous impact on buyer experience, click-through-rate (CTR), buyer engagement and conversion ratios. However, most of these websites suffer from “photo pollution”; despite having an army of manual laborers to approve new listings, a significant fraction of photos ingested by their platforms have poor quality and irrelevant photos.\n\nFor instance, a significant fraction of these photos turn out to be stock photos, many times there is a repetition of photos within and across listings, and photos sometimes are uploaded under unintended categories. Such poor visual quality of listings adversely impacts experience of buyers and affects eventual conversions. Not to mention the problem of filtering huge amount of profane photos. A pool of manual labor can only do so much!\n\nUsing deep learning, we have made it possible for a machine to automatically and accurately identify a profane photo from an acceptable photo. We can now accurately classify a stock photo vs a user-generated photo. Furthermore, using models trained using deep learning, we can automatically categorize a photo among 100 different categories while filtering duplicate photos, without any manual intervention. We feel that the possibilities are endless. We have further applied deep learning to extract objects out of photos and show “visually similar” listings. We are truly excited about these capabilities of deep learning.\n\nWe have been building platforms, algorithms and products to innovate and apply deep learning based frameworks to various businesses. Our core platform makes it very easy to ingest large amount of image, speech and text data and run deep neural networks. We call this platform ‘deep learning studio’ (DLS). We have been using DLS to process vast amount of data from the Internet and apply GPU infrastructure on popular cloud-data-centers to learn large-scale DNNs. We have built several APIs on top of DLS that can be seamlessly invoked to utilize the machine-learning models learned underneath.\n\nWe believe that machine intelligence has got the Midas touch to transform industries, businesses and services that pervades every aspect of our daily activities. We believe that machine intelligence can enable societies to lead smarter, simpler and better lives. At Huew, we continuously push boundaries of technologies to solve complex real-world business problems and build superior quality machine intelligence.\n\nIn the next few posts, we will give insights on how we are training, validating and testing deep neural networks on DLS, specifically convolution neural networks, to solve classification and clustering problems for photo-analytics.", 
        "title": "Introducing Deep Learning Studio –"
    }
]