[
    {
        "url": "https://medium.com/@notarobot/deep-dream-images-are-currently-tripping-out-the-entire-internet-225476bc9116?source=tag_archive---------0----------------", 
        "text": "Google’s research into neural networks, or computer networks meant to mimic actual neurons, has produced some of the strangest images of all time.\n\nLayers upon layers of freaky looking dogs, birds, fish, cars, and weird Japanese temples have flooded the internet. These images, like the one below, are created using an advanced “neural network.” Google is currently doing research into computer programs modelling biological neurons, or the cells that make up your brain and spinal chord.\n\nThese psychedelic and sometimes disturbing images are the result of people running images through the neural network’s visual analytical processes. What does it have to do with actual dreaming? Not much, in truth. Deep Dream is more of a catchy nickname. So how does this wild software work?\n\nThe neural network uses what is known as “machine learning networks.” In this case, a computer is presented with a huge number of images, and told what the images are of. For example, the computer might be shown an image of a dog and then told that it is a dog. If you do this enough times, the computer will start to “learn” what a dog looks like. This is how image recognition software works.\n\nMachine learning is supposed to be able to allow a computer to recognize a dog when it sees one in an image. What happens, then, when you present the computer with an image that is not a dog, and then tell it that there is a dog? The computer will scan the image and try to find a dog anywhere it can. That is what we are seeing with these bizarre fractal images.\n\nGoogle’s deep dream is an attempt to visualize what a computer “sees” when it is scanning an image for dogs. That is why we see disembodies snouts everywhere we look in these images. Oh yeah, and did I mention it works with video as well? Take this one for a spin: Caution, NSFW language and possibly terrifying images.\n\nThis visualization represents the bleeding edge of technology and artificial intelligence, but can it also usher in a new wave in art and design? We’ve certainly never seen images like these before, and you can imagine how much more amazing they will start to look as people learn how to manipulate the software.\n\nReddit user /u/jnordberg used Deep Dream and some creative paint skills to create the header image using the process below:\n\nYou can see as he runs each image through the software that it becomes more and more distorted each time, to the point where in the last frame you can no longer read the word DREAM. This is because of the presence fractals. Fractals are images which are infinitely recursive, meaning they basically keep going deeper and deeper infinitely. Google fractal images for more examples.\n\nEach time he runs the image through the software, the deeper the fractals go, and the more insane the image begins to look.\n\nMany online users have also noticed a distinct similarity between Deep Dream images and those produced by artists suffering from mental illness or experiencing the symptoms of psychedelic drugs. Another reddit user pointed out the similarity between paintings by artist Louis Wain and these fractal images, suggesting that we might use computers to model mental illness.\n\nWhether used for art, compassion, or just plain trippy-ness, these images are sure to amaze, and so should the neural learning networks used to produce them.\n\nTo see more of these insane images and discover how to make one yourself using your own image, visit reddit.com/r/deepdream.", 
        "title": "“Deep Dream” Images are Currently Tripping Out the Entire Internet"
    }
]