[
    {
        "url": "https://medium.com/@camirosso/why-artificial-intelligence-is-the-next-revolution-ai-will-change-almost-every-aspect-of-our-15779294af11?source=tag_archive---------1----------------", 
        "text": "Throughout history, technological innovations have advanced and changed how people live, work and survive. First was the Agricultural Revolution, then Industrial Revolution, and now we are towards the end of the Digital Revolution. The Internet, mobile and smartphone industries are at the end of the technology adoption life cycle, having reached significant market penetration and maturity in developed nations.\n\nSo what comes next? Scientists, researchers and pioneering venture capital investors are on the edge of creating the next major epoch in history, the Artificial Intelligence Revolution (or AIR, as an acronym).\n\nThere are several factors contributing to the rise in advancements in Artificial Intelligence. It’s cheaper now to perform research on Artificial Neural Networks (ANNs) with the trends of decreasing costs of software development tools, greater availability of datasets and the rise of cloud computing infrastructure.\n\nIn the future, advancements in AI, namely in the deep learning aspect, will enable the creation of new jobs and industries. For example, I can envision the rise of consumer cloud-based Smart Assistants that will amalgamate, optimize and help you make decisions with Big Data input from your business, household, travel, entertainment and social media, all on your mobile device. The key to the success of the Smart Assistant is to have the best AI learning capabilities so that customization of the individual consumer’s preferences are learned, rather than hard-coded.\n\nFrom a business enterprise perspective, AI can help decrease manufacturing costs, increase quality control and improve customer service. AI and robotics go hand-in-hand. Improvements in AI will expand the role of robotics in manufacturing and quality control. With smarter robots, therein lies opportunity for disruption of the legal industry, document processing, package delivery, mail service, mortgage brokerage and insurance to name a few.\n\nIn addition to pioneering start-ups, technology behemoths such as Google, Microsoft, and Facebook are conducting research and publishing findings to the academic community with internal teams and dedicated AI resources.\n\nGoogle’s deep-learning software, AlphaGo, has made headlines recently by defeating world-class human players. Microsoft has recently announced new software that will open Minecraft into an AI testing ground for researchers. Facebook deploys AI to understand user interaction with the News Feed to produce article suggestions. Amazon currently deploys machine learning software to predict product pricing and forecasting recommendations in search.\n\nThe progress is breathtaking and the implications are far-reaching. From work to home, AI will impact our lives and herald the next revolution.", 
        "title": "Why Artificial Intelligence is the Next Revolution — AI Will Change Almost Every Aspect of Our…"
    }, 
    {
        "url": "https://medium.com/@ooohiroyukiooo/to-get-truly-smart-ai-might-need-to-play-more-video-games-52101e11b733?source=tag_archive---------2----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "To Get Truly Smart, AI Might Need to Play More Video Games"
    }
]