[
    {
        "url": "https://medium.com/@teamrework/the-ai-update-from-re-work-6aa6edd771a1?source=tag_archive---------0----------------", 
        "text": "The worlds of AI, Deep Learning and Machine Intelligence are rapidly evolving and it’s hard to keep up! To help you get up-to-date we’ve rounded up the latest must-see AI news, interviews and videos.\n\nRE•WORK blogs\n\nShould We Be Rethinking Unsupervised Learning?\n\nWe learnt more about use cases of unlabelled data from Roland Memisevic, University of Montreal, and Chief Scientist at Twenty Billion Neurons.\n\nMeet the Woman Behind the Personality of Microsoft’s AI Assistant ‘Cortana’\n\nDeborah Harrison believes people should come to expect civility, humor, transparency and kindness from interactions with AI, just as they expect the ability to update a calendar.\n\nDemocratising Deep Learning: Q&A With Prof. Neil Lawrence\n\nIt has taken 20 years to go from defeating Kasparov at Chess to Lee Sedol at Go, but what have the real advances been across this time?\n\nAI Acquisitions: The Evolving Deep Learning Landscape\n\nWith the exponential growth of the deep learning field, new companies are often funded and acquired extremely quickly. We take a look back at the huge successes of startups in the field, to gauge how the deep learning landscape is evolving.\n\nExploring AI & Machine Intelligence With Google, Facebook, MIT & More\n\nThis November, over 200 attendees will come together to explore the latest developments in machine intelligence.\n\nFurther afield\n\nIntel Buys Deep Learning Startup Nervana Systems\n\nThey acquired the startup for a reported $350million, bolstering the role of AI solutions within the company.\n\nOpenAI Wants to Teach Robots to Speak Like Redditors\n\nThe Elon Musk-backed company has partnered with NVIDIA to use the new DGX-1 supercomputer, and using data from Reddit to train it.\n\nGoogle and Microsoft Want Every Company to Scrutinize You with AI\n\nThe tech giants are eager to rent out their AI breakthroughs to other companies.\n\nMove Over Silicon: Machine Learning Boom Means We Need New Chips\n\nThe rise of artificial intelligence and impending end of Moore’s law means silicon chips are nearing the end of the line. What are the alternatives?\n\nWho Should Control Our Thinking Machines?\n\nGoogle’s Demis Hassabis on using artificial intelligence on everything from climate change to aging.\n\nRE•WORK interviewed deep learning expert Yoshua Bengio at the Deep Learning Summit in Boston, May 2016 (you can also view Yoshua’s presentation at the summit here)\n\nFollow us on Twitter and LinkedIn for more news and articles!\n\nView upcoming RE•WORK events here.", 
        "title": "The AI Update, from RE•WORK – RE•WORK –"
    }
]