[
    {
        "url": "https://humanizing.tech/what-comes-next-after-mobile-video-messaging-a43910ddd69d?source=tag_archive---------0----------------", 
        "text": "And what door will we need to walk through before we get there?\n\nMobile, video and messaging is so hot right now (insert blue steel reference here). But what comes after that? What’s the next quantum leap?\n\nWhat is video but seeing something through your eyes? Video is just a machine’s eyeballs that’s remembered in a brain and described to you later with exact precision.\n\nSo if you forget about what you carry in your hands and instead focus on why you do things you’ve always done, you’ll start to discover what’s already there.\n\nWhat if your messaging could appear in your field of view layered above your eyeballs? Then it’s simply augmented reality. It’s a heads up display to watch videos, play games, and message with friends and colleagues.\n\nhttp://www.magicleap.com (the homepage video is so stunning that I had to refresh multiple times and watch it again with sound).\n\nMany people’s vision is already so whacked out that they wear contacts. Put a chip in there and connect to it (in the beginning) via Bluetooth just like the Apple Watch did with the Apple phone. The phone is the everywhere connection device, but the contacts are thin layer above reality.\n\nOnce that comes, then you’ve combined computer vision with your own and the sheer volume of data that will be pumped into deep learning algorithms will begin the power the AI of the future.\n\nSiri and Google Now were the beginning. Give consumers a reason to talk into a microphone over and over again for only one reason: training data. Give consumers a reason to see through a computer’s eyes over and over again for only one reason: training data.\n\nAnd then, the exponential curve begins getting steeper and steeper. Until eventually you’re back to the 100-year vision. Talk to your ancestors, even after they’re dead, just like Superman did with his father to understand where he came from and what his purpose is.", 
        "title": "What Comes Next After Mobile, Video & Messaging? –"
    }
]