[
    {
        "url": "https://medium.com/@michael.fire/practical-text-analysis-using-deep-learning-5fb0744efdf9?source=tag_archive---------0----------------", 
        "text": "Deep Learning has become a household buzzword these days, and I have not stopped hearing about it. In the beginning, I thought it was another rebranding of Neural Network algorithms or a fad that will fade away in a year. But then I read Piotr Teterwak’s blog post on how Deep Learning can be easily utilized for various image analysis tasks. A powerful algorithm that is easy to use? Sounds intriguing. So I decided to give it a closer look. Maybe it will be a new hammer in my toolbox that can later assist me to tackle new sets of interesting problems.\n\nAfter getting up to speed on Deep Learning (see my recommended reading list at the end of this post), I decided to try Deep Learning on NLP problems. Several years ago, Professor Moshe Koppel gave a talk about how he and his colleagues succeeded in determining an author’s gender by analyzing his or her written texts. They also released a dataset containing 681,288 blog posts. I found it remarkable that one can infer various attributes about an author by analyzing the text, and I’ve been wanting to try it myself. Deep Learning sounded very versatile. So I decided to use it to infer a blogger’s personal attributes, such as age and gender, based on the blog posts.\n\nI needed a proper Deep Learning algorithm that can analyze text. In my readings, I came across two very interesting Deep Learning inspired tools for text analysis. The first tool was the Word2Vec algorithm invented by Thomas Mikolov et al. from Google, and the second tool was GloVe invented by Jeffrey Pennington et al. from Stanford University. Both of these representation learning algorithms seemed really useful for analyzing text. In the end, I chose to use Word2Vec. It takes a large text corpus as input and outputs a numeric vector representation for each word. The vectors are supposed to represent the semantic similarity between the words. I chose to use Word2Vec due to its outstanding Python implementation written by Radim Řehůřek, and because of an excellent tutorial that was written by Angela Chapman during her internship at Kaggle.\n\nNow that I settled on a large dataset and a deep learning inspired tool, the next step was to glue all the parts together. I wanted to create an end-to-end machine learning solution that takes a blogger’s posts as input and predicts the blogger’s gender and age with high accuracy. To make all the parts work together, I used GraphLab Create in the following manner.\n\nThe exciting part, I believe, is that the results obtained in this way are better than the known state-of-the-art algorithm for this problem. But I still need to perform additional tests to verify this conclusion.\n\nIf you want to try Deep Learning on text, take a look at my IPython notebook that describes in detail how to create a text classifier using Word2Vec and GraphLab Create. You can use it to create your own blogger gender and age classifier, or construct your own deep text classifiers for other NLP tasks.\n\nAs always, feel free to leave a comment with any questions or suggestions.\n\nAndrew Ng’s Deep Learning talk gives a nice overview of deep learning and what it can achieve using Deep Learning.\n\nThere are a lot of great videos and tutorials on neural networks. I watched Stephen Welch’s excellent Neural Networks Demystified videos.", 
        "title": "Practical Text Analysis using Deep Learning – Michael Fire –"
    }, 
    {
        "url": "https://medium.com/from-the-macroscope/data-in-focus-a-new-way-of-looking-at-water-5ec91fde5442?source=tag_archive---------1----------------", 
        "text": "As the world’s population approaches 10 billion people and chronic droughts and water shortages proliferate, water has become our most critical and contested resource. Although technological advances have helped alleviate the threat of shortages in oil and other commodities, a global water crisis could be disastrous. Already, 80 countries face water shortages, two billion people lack access to clean drinking water, and another billion cannot meet their most basic water needs, according to the World Bank. In developing countries, population growth is projected to drive demand 40 percent above sustainable levels by 2030.\n\nBeyond praying for rain, what can we do? Can technology help us measure, plan, and more effectively allocate precious water resources where they are needed most — especially for fresh drinking water and food production — before it’s too late? The short answer, we have discovered, is yes. Applying cutting-edge data science and deep learning technology to analyze the increasing amount of satellite imagery, we have developed potentially transformative technology to monitor surface water levels and fluctuations around the world.\n\nSuch advances can help communities, planners, and policymakers make more informed and sustainable decisions about how to use and save water resources, especially as population grows and water supplies shrink. Consider what’s at stake when it comes to food. Agriculture, which already accounts for 70 percent of global water consumption, will only intensify water demands as it strives to feed several billion more people. Water shortages could spell food shortages — a loss of up to 350 million metric tons per year of crops (more than the entire US output), the International Food Policy Research Institute (IFPRI) estimates.\n\nTo prepare for water crises, we need rich, accurate data. Using an innovative blend of satellite imagery, deep learning, and data science, Orbital Insight has developed a method for monitoring fresh-water supplies at local and global levels. Our goal is to produce a fully automated water monitor that yields weekly updates and provides statistically significant measures of changes in water surface area. We use freely available USGS Landsat data and leverage the latest developments in deep learning and cloud computing to deliver our signal with minimal overhead. With this technology, we can observe surface water fluctuations at county, state, national and global levels — providing planners and policymakers with more timely, comprehensive information.\n\nCalifornia, which has suffered from an intense drought since 2011, offers a potent local case in point. To enrich public understanding about these changing water levels, we applied our technology to the state’s reservoirs.\n\nIn Figure 1, you can see the raw image of the San Luis Reservoir with the Landsat 8 and Orbital Insight’s water masks. To produce the middle image with the Landsat 8 water mask, we utilize information captured in the quality assurance (QA) band. The image on the right shows Orbital Insight’s water mask, calculated using a convolutional neural network approach; this technique effectively filters out the shadows that are mistaken for water in the QA band of Landsat 8.\n\nThe simplest next step is to calculate the water surface area by adding up the number of water pixels and scaling them by the area per pixel. For Landsat 8’s panchromatic band, the pixel size is 15 m, the same as the ground sample distance (GSD). Using this approach, we can compare the normalized value of the water surface area in the reservoir, determined through remote sensing, with the water level measured by local in-situ sensors.\n\nAs one might expect, we found an annual pattern in which the amount of water dips to its minimum at the end of summer and through the fall, and increases again through the winter due to precipitation. These levels continue to rise in spring as the snowpack thaws. By analyzing the depth of those dips over the years, we can illustrate the drought’s intensity since 2011, at least for that one reservoir. To produce a more comprehensive analysis of the drought, we must measure and aggregate water levels in many reservoirs throughout the state.\n\nMoving our lens abroad, Figure 3 demonstrates our capabilities on Lake Haditha in Iraq. Most of the rice and wheat grown in northern Iraq is irrigated using water from Lakes Haditha, Mosul, and Habbaniyah. Water shortages in these reservoirs directly affect the country’s grain production through the amount of cropland that is planted. As Figures 3 and 4 illustrate, Orbital Insight’s approach produces more accurate data on water levels, enabling better planning and management of resources. For instance, the water masks derived from Landsat 8’s QA band can significantly underestimate the amount of water available (see figure 4). Such inaccuracies result in a very noisy, high-variance time series, impeding the ability to track trends. By comparison, Orbital Insight’s more accurate and comprehensive water masks lead to much smoother time series.\n\nExpanding on our water monitoring innovations, Orbital Insight plans to leverage the availability of multispectral and hyperspectral satellite and drone imagery to examine pollutants and contaminants in lakes, rivers, and other bodies of water. By combining this imagery with deep learning methods such as convolutional neural networks, we can quantify threats to water quality. Using our expertise in data science, we can detect significant changes as they occur, and signal decision makers when quality threatens to drop below agreed-upon thresholds.\n\nWhether in California or Iraq, this technique has the power to globally impact issues of fresh water availability, water security, and geopolitical risk through persistent coverage and wide reach. It can therefore play a defining role in evaluating and monitoring Integrated Water Resources Management practices across the world. By leveraging remote sensing capabilities, Orbital Insight’s technology enables a standardized global approach that can access hard to reach locations around the world that frequently endure more water stress than the developed world.\n\nAs water shortages threaten to exacerbate conflicts in water-stressed areas, these new data-gathering tools could even play a useful role in geopolitics. Research tells us that shortages will be most poignant in regions that are already battling over water — and states will increasingly come into conflict over water access. Representing 60 percent of the world’s surface water, 263 rivers around the globe cross international borders, and 158 have no laws regulating how these resources get shared. Many of these potentially contentious rivers run through regions that suffer water scarcity and have either a history of conflict or a powerful military, such as Egypt (Nile), China (Mekong), India/Pakistan (Indus), Iraq/Syria/Turkey (Tigris and Euphrates) and Israel/Jordan (Jordan). Although widespread water wars have not broken out in most of these regions, some analysts believe that water issues have played a major role in the Syrian Civil War and, as water security worsens, will drive future conflict. With improved water data, policy makers can engage in more informed dialogue and negotiations that may help prevent future water-driven conflicts.\n\nTo create a sustainable water future, we must understand the current water situation around the world. Remote sensing combined with advances in machine learning enables us to develop this understanding in a global context. Current efforts to monitor fresh-water levels rely on individual measurements or monitoring campaigns for specific lakes, reservoirs or rivers by different groups at different times, with varying metrics and accuracies. Likewise, satellite campaigns to evaluate water levels currently suffer from poor accuracy (e.g. Landsat 8’s own Quality Assurance (QA) band). Orbital Insight’s innovative approach provides both superior accuracy and a more comprehensive analysis, in terms of time and space. By measuring bodies of water consistently over long periods of time, we can produce standardized and data-rich knowledge about the state of water in the U.S. and other countries. As water shortages and contentions intensify around the world, our technology can help planners, policymakers, and the public to better understand and address these challenges.", 
        "title": "Data in Focus: A New Way of Looking at Water – From the Macroscope –"
    }, 
    {
        "url": "https://medium.com/@BCGDV/smartphones-get-smarter-4262a7236251?source=tag_archive---------2----------------", 
        "text": "While smartphones have become indispensable to our lives, there are still things they do that are extremely dumb. Why do I need to put in all my details every year when I want to buy insurance? Why do I need to use a combination of the time, my diary and Citymapper to work out when to leave for a meeting and how to get there? Why do I have to check the weather app every day to decide whether to take my umbrella with me? Why does Amazon keep recommending things I already bought?\n\nHowever, this is all about to change as companies figure out how to use the combination of personalised data, smart algorithms and pre-emptive notifications in an intelligent way to make our lives a lot easier. In 2016, we’ll really start to see smart services built with deep artificial intelligence capabilities appear and hit the mainstream. These will work by combining contextual, demographic and unstructured data with prediction analysis and deep learning to create services of great value.\n\nWe have seen the beginnings of this with Google Now, Netflix’s Suggestions and Nest. The investment the big players are making — Google buying DeepMind for a reported £500m, Apple ramping up Siri and Microsoft investing heavily in Cortana — will all begin to have an impact in 2016.\n\nI see us moving to a world where simply asking Siri or Cortana to find you the best car insurance and answering a few yes-or-no questions will result in your insurance being renewed and the documents sent to your inbox. This is solving numerous pain points that customers face every year when they renew their annual car insurance.\n\nIn addition to transport and weather (services proactively reading our diaries and telling us to leave for a meeting, as well as the best way to get there and proactively ordering an Uber if it is raining), there will also be a battle for intelligence in the home. A battle currently being fought by Apple (Apple TV), Microsoft (Xbox), Sony (PlayStation) and Google (Chromecast, Nest) will increasingly become more important as the Internet of Things ramps up and more and more data is created to allow for deeper learning and more intelligent decision- making.\n\nBut there’s something to look out for in all this — what is the company’s motivation? For some, it’s the value that this level of data collection will bring and selling advertising on the back of it. For others, it’s providing services and selling devices to enable this.\n\nWhat’s key in getting smart services to the mainstream and getting people to use them is making the interface simple and intuitive. Some interfaces will disappear completely and will be replaced by voice interaction. We’ll also start to see more and more easier to use hardware such as wearables, as well as improvements to software that recognise haptic feedback and gesture control.\n\nOver the next 12 to 24 months, services will begin to become more refined, and there will be widespread adoption for some of the core services. Many more startups will enter the space that focus on deep learning. With that, we can expect buyouts and internal investment from corporates.\n\nIn the next five years, this will be completely transformed, and we’ll come to expect deep learning services that allow us to complete even some of the most time-consuming tasks in a few simple commands or, better still, without any involvement from us at all.\n\nThe key payoff for investment in this is building long-lasting relationships with your customers and creating highly personal and intuitive services, which they cannot live without.", 
        "title": "Smartphones get Smarter – BCG Digital Ventures –"
    }, 
    {
        "url": "https://medium.com/@yosola/python-ser%C3%A1-mi-expecto-patronum-858dfea4d559?source=tag_archive---------3----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "Python será mi Expecto Patronum – Cristina Rodríguez –"
    }, 
    {
        "url": "https://medium.com/@Ilexa_Yardley/conservation-of-identity-d839feaa9245?source=tag_archive---------4----------------", 
        "text": "What is the difference between one person and another? You and me, for example.\n\nWhat is the difference between one person and another? You and me, for example. This is not that difficult to figure out.\n\nX and Y (X and X, X and X’) articulate a circle. Therefore, identity is conserved (the circle is conserved) (a circle conserves identity).\n\nThat is, there is an invisible circle between you and me, any we, a unit and a group (abstract and concrete, hidden and showing). Thus, the constant is a variable (and vice versa). Therefore, conservation of a circle is the most important dynamic in nature.", 
        "title": "The Conservation of Identity – Ilexa Yardley –"
    }
]