[
    {
        "url": "https://medium.com/@jsphbtst/the-real-ai-threat-92761ba0685?source=user_profile---------1----------------",
        "title": "The Real AI Threat – Joseph J. Bautista –",
        "text": "Artificial intelligence (AI) has been booming recently thanks to the rapid increase in data collection, memory storage, computing power, and general availability of AI development frameworks (Tensorflow, PyTorch, et al.). However, concerns are voiced because of fears of machines taking over. Hollywood characters like Terminator’s Skynet and Iron Man and the Avengers’ JARVIS, FRIDAY, and Ultron have dazzled the public to not only AI’s amazing feats, but also to its dangerous and uncontrollable potential.\n\nBut let us take a deep breath and a step back. AI, like those in Terminator or the Avengers, are vastly different from what we are currently producing. Artificial general intelligence (AGI), which is what Ultron and Terminator are, is still far beyond the horizon. Currently we are struggling to figure out how to generalize our algorithms to work in multiple contexts. To quote Dr. Yann LeCun from an interview with Udacity CEO Sebastian Thrun:\n\nRight now we have powerful algorithms like multi-layer perceptrons for general classification and regression, convolutional neural networks (and Hinton’s recent capsule networks) for computer vision, recurrent neural networks for time-bounded decisions such as speech recognition and time-series prediction, and so on. But the problem is making these algorithms work in multiple contexts, not just in what they were built to do.\n\nTony Stark’s Ultron was not only able to learn combat strategy and engineer a machine that turned Sokovia into a meteor, but was also able to manipulate the inner workings of online financial security to illegally pay for the vibranium. Currently, our AIs are only working from a limited scope, like classifying faces from the set {X1, X2, X3, … XN}, but not including {Y1, Y2, Y3, … YN}, a set totally unrelated to the first set.\n\nWe have gotten a a step close though. One such feat is Google DeepMind’s Deep-Q Learner, an algorithm that managed to play multiple Atari games and scored well on all of them. But alas, the algorithm still cannot be used to both play said games, cross-translate languages in Southeast Asia, and help find my uncle’s television remote which somehow always gets lost at least three times a week.\n\nOne could say that a lot of our current models and algorithms are still “context dependent.” We have a long way to go before we reach AGI.\n\nIf AI is not capable of destroying the human race on its own yet, then what makes it so dangerous? The people who use it.\n\nAny piece of equipment in of itself is not a moral agent. These pieces of equipment are merely tools that we use in aid of our actions. We, as individuals or groups of individuals, are the moral agents. For example, a knife in of itself is not evil, but rather, how it is used in different situations is what we define as neutral, good, or evil. It is like that old saying, “guns don’t kill people, people kill people.” To be more nuanced about it, “guns don’t kill people, people who use guns to murder, kill people.” We can generalize further by saying that “_ don’t kill people, people who use _ to murder, kill people,” where _ is anything from rat poison, swords, pens, et al.\n\nSubstitute AI for _ and what we get are dangerous pieces of technology that can take away our liberties. To make matters worse, these pieces of technology are being used by the same people who swore to protect you — your governments.\n\nOne example out there is the Chinese government using facial recognition (I reckon a convolutional neural network) with CCTV cameras and GPS navigation. Using this, they can identify a person who is being recorded by matching features retrieved from the national database. Why do they have a national database? The national ID system. This national ID has your picture, name, age, et al. Read about this here and here. Their system creepily named ‘Sky Net’ is being used for hunting down fugitives. But as the great Lord Acton said, “power tends to corrupt, and absolute power corrupts absolutely.” We will see if they stretch beyond Sky Net’s initial goal.\n\nIt is bad enough that a government agency that inevitably abuses its power gets to use AI for these purposes. But there is danger that also happens when government security gets compromised. The danger in having this national ID database is that there is no telling what could happen when said database gets either stolen or compromised. This is valuable information that any corporation or terrorist organization can use to their advantage — more so if they know how to program their own AI.\n\nAnother example comes from Gizmodo’s recent report that Google has partnered up with the United States Department of Defense (DoD). Project Maven, also known as the Algorithmic Warfare Cross-Functional Team (AWCFT), is a project that started last year with the mission to “accelerate DoD’s integration of big data and machine learning.”\n\nGiven the advent of self-driving cars, automatic face detection, credit fraud detection, and even having data science competitions for fun, it was only a matter of time for the Pentagon to automate their analyses for object and anomaly detection given the hordes of data they receive from their drones worldwide. When the rate of data coming in is faster than what their human analysts can work with, automation will be the obvious thing to do.\n\nThe partnership is to allow DoD to use Google’s open source software called Tensorflow, one of the biggest software libraries used to make machine learning and deep learning models such as neural networks. AirBnb, NVIDIA, Uber, Twitter, Dropbox are among the many companies that use such a framework to deliver better services to their respective customers. Tensorflow is extremely robust, to the point where two programmers were able to use it and a $10 webcam to create a DIY Kinect.\n\nAnother scenario, although hypothetical, would be for governments or corporations with government protection to create propaganda machines. A primordial example would be Facebook’s News Feed, which was built to optimize for attention and keep you there scrolling aimlessly until you realize you have wasted an hour when you should be getting work done. However, optimizing one’s attention could also mean putting you into a political echo chamber to reinforce your views. From an optimization perspective, it does not make sense to give you content you do not agree with. This was not Facebook’s intention, but it was the result we had to face.\n\nOpenAI, a 501(c)(3) AI research company founded by Elon Musk and Sam Altman, gets it right in their launch blog post by saying they, “[…] believe AI should be an extension of individual human wills and, in the spirit of liberty, as broadly and evenly distributed as possible.”\n\nBouncing off of the OpenAI quote, the two step approach in my mind right now with how we can paint a slightly better future with the advent of AI are: 1) democratize data and AI; and 2) spread the values of liberty.\n\nWhen AI and data get democratized, no corporation or government can ever use it against us. A similar technology before was the printing press. Before, only the wealthy were able to afford an education. However, with the creation of the printing press, lowered costs allowed more people to learn how to read, be educated, and rise up from poverty. The 21st century equivalent is the birth of the internet, where now you do not even need a university education to get the high-level skills you need for the job market. A lot of budding programmers can access most of the information they need from the internet. They can build an online presence, portfolio, and eventually either get hired by tech giants or be a freelancer. This was unheard of just two decades ago. Furthermore, fact-checking can happen with the click of a button, scams can be avoided by looking at online credibility, and sending money overseas was never easier. With AI? The possibilities are endless.\n\nSpreading the values of liberty, on the other hand, is a long-term approach to creating the path so safe and better AI. The values that we have inevitably get transmitted into the technology we use. If we are for totalitarianism, then we end up with things like China’s Sky Net. If we are for liberty, then we will have machines that can do amazing things like translate foreign languages received from your earphones in real time, optimize a building’s energy usage, narrate the current environment received through the earphones for the blind, and many others.\n\nDo we panic? In terms of computers taking over the world, maybe not in the near future. In terms of people using it against other people? Probably, but I am hopeful."
    },
    {
        "url": "https://medium.com/@jsphbtst/quick-word2vec-on-trump-fdfd4866d52a?source=user_profile---------2----------------",
        "title": "Quick Word2Vec On Trump – Joseph J. Bautista –",
        "text": "Simply put, word2vec is a group of methods that use fancy math to map words into their vector or real number form. We do this because machines can’t actually read words. And in order to make use of text for predictive models, we first transform them to words, make predictions, and then convert them back to words.\n\nBefore I got into converting words to numbers, I had to preprocess the data. The process involved loading up the data, turning everything into lowercase, and removing all non-ascii elements. This is all done in order to make the data being fed into the model consistent.\n\nThe next thing we need to do is to create the proper input for Gensim’s Word2Vec. The proper input is an array of array of words from each sentence. For example, “I pooped. Loljk not really. But srsly.” gets transformed into [[“i”, “pooped”], [“loljk”, “not”, “really”], [“but”, “srsly”]].\n\nWe’re almost there. All that’s left is to feed the data into Gensim’s Word2Vec function and watch the magic happen.\n\nBeing the inquisitive nerd that I am, I’ll try re-implementing this using Tensorflow to get more “into it.” I personally can’t admit to being competent with word2vec if I don’t know how to tinker every single moving piece in it. In the greater scheme of things, the purpose of this exercise was to get a high-level understanding first of how word2vec works. I usually get to the technical details later. This is how I learn.\n\nTime for the exciting part. I removed all the stopwords (commonly used words like “the,” “a,” and others) in the vocabulary to reduce the amount of words in the resulting plot.\n\nIt was then just a matter of using the t-stochastic neighbor embedding (t-SNE) to reduce the dimensions to two and then plot the results. What I like about t-SNE is that it keeps the structure from the high-dimensional plane onto the preferred lower-dimensional plane. If two points are close in 10D, then they’ll still be close in 2D after t-SNE does its job. Same goes if they’re far apart.\n\nAfter all that, the result is shown below. WARNING, big plot ahead."
    },
    {
        "url": "https://towardsdatascience.com/a-bit-beyond-gradient-descent-mini-batch-momentum-and-some-dude-named-yuri-nesterov-a3640f9e496b?source=user_profile---------3----------------",
        "title": "A Bit Beyond Gradient Descent: Mini-Batch, Momentum, and Some Dude Named Yuri Nesterov",
        "text": "Last time, I discussed how gradient descent works on a linear regression model by coding it up in ten lines of python code. This was done in order to demonstrate the principles of gradient descent that will give the reader insights and practical know-how when it comes to self-implementation. There are tons of libraries out there that get the job done for us with a simple plug-and-chug. However, I believe that learning how these methods work internally is equally important for researchers and practicing data scientists alike.\n\nI took the effort of discussing gradient descent in order to transition the reader into deep learning more smoothly. Understanding how to take the derivative of a cost function and using that to update the weights and biases is important when studying deep learning as it repeatedly shows itself (see backpropagation). Take the time to learn these things.\n\nWe’ll explore again our basic linear regression model with our mean squared error cost function to navigate through optimization techniques beyond gradient descent. Before reading any further, think to yourself, what potential problems could gradient descent give us?\n\nLastly, recall that our cost function is the mean squared error given below:\n\nUnpacking the above equation for linear regressions yields us:\n\nCheck out my GitHub repo that contains the full algorithm. I performed benchmarks on all the methods we’ll be discussing.\n\nOne problem we face when we use vanilla gradient descent (another term for our plain old buddy gradient descent) is the memory problem. Our computers can only handle so much, so what if we’re dealing with millions, if not and more commonly, billions of data? Luckily, as the name implies, mini-batch gradient descent uses the same methods as vanilla gradient descent but only on a smaller scale. We create batches from our training data and train our model on that smaller batch, updating our slope and bias term all the while. It will look something like this:\n\nFor every epoch, we train our model per batch. This will cause us to create a nested for-loop. A necessary sacrifice in my opinion as opposed to feeding the huge dataset altogether. One problem with mini-batch gradient descent is that our increased number of parameter updates with high variance cause fluctuations in our cost function. There are times when this will cause our gradient to jump to lower local minima because of overshooting, which makes it superior to vanilla gradient descent because mini-batch gradient descent just doesn’t stay within the area of the local minima — it can go beyond that to find other lower local minima. Other times we might not reach lower local minima because of overshooting.\n\nWe can do better. Let’s borrow from physics.\n\nRemember momentum from physics? The equation for momentum is p=mv, where p is the momentum, m is the mass, and v is the velocity — both p and v are vectors. An intuitive understanding of momentum can be painted by a ball rolling down the hill. Its mass is constant all the way, but because of the gravitational pull, its velocity (v) increases over time, making momentum (p) increase. The same concept can be applied to cost minimization! When a gradient from the previous time step “points” in the same direction as our current time step, we increase “the speed” when we go “down hill.”\n\nIn terms of improving mini-batch gradient descent, this allows us to increase our “speed” in a certain direction. When the directions change, we go marginally slower because our momentum “broke.” When our ball is rolling down the hill, it keeps on increasing its momentum, but when another ball hits it (or anything that hits it really), it slows down and then tries to recuperate back its momentum. Physics allows us to make intuitive analogies!\n\nWe’re going to have to change things up a bit. Refer to the equation below:\n\nv here is just our “velocity” with respect to time. That “y”-looking symbol is just called the momentum term, usually valued at 0.9. The symbol that looks like the letter “n” is our learning rate which is multiplied to the derivative of the cost function. We still take our derivatives similar with how we take them in both vanilla and mini-batch gradient descent as can be seen below:\n\nYou calculate v and subtract that from our previous parameter and voila, there’s your parameter update!\n\nIn code, it will look something like this:\n\nAgain, refer to my GitHub repo for the full implementation details.\n\nThe problem with just the momentum is that it’s not dynamic enough. Sure it amplifies the velocity in order to reach convergence much faster, but a researcher named Yuri Nesterov observed that the value of the momentum is still high when the gradient reaches the local minima.\n\nThe method above does not have a way for us to slow down our parameter updates when we’re reaching the local minima. The problem of overshooting is once again present. Imagine our ball rolling down the hill again. In our momentum method, sure the ball rolls down faster as it goes down, but it doesn’t have a clue of where it is going so that it knows when to slow down and finally settle down before the next uphill slope. We need a smarter ball.\n\nThe Nesterov Accelerated Gradient (NAG) is an anticipatory update that prevents us from going “too fast” when we shouldn’t already. Refer to the equation below, and see if you notice a thing that has changed compared to momentum. HINT: Check the cost function.\n\nThere’s a new term that we subtract from the weight/slope in the cost function! This is the anticipatory move. By taking our gradient from the previous time step, we anticipate where we are likely to go, while the terms that you eventually add to it are the corrections we make. This makes NAG more dynamic as our updates adapt based on the slope of our error function.\n\nOur new slope and bias gradient will look different. All you have to do for NAG is to plug in the new term to the cost function and proceed to take the derivative as we have done before. For our linear regression example with a mean squared error cost function, it will look something like the following:\n\nWe would need to make a few tweaks from our code before. Again, check my GitHub repo out for the full implementation details. It looks like the following:\n\nOf course there is! So far we’ve talked about: 1) making it easier on our computer to do computations; and 2) implementing adaptive gradient steps based on the slope of the error function. We can take it further. Why not make all the other stuff adaptive? Like, say, adaptive learning rates? What if we make those adaptive learning rates update similar as to how we do our updates with NAG?\n\nThere are lots of resources that discuss those. A simple Google search will lead you to a treasure trove of information just waiting to be learned. I will try to explain those simply for you next time. See you then!"
    },
    {
        "url": "https://towardsdatascience.com/linear-regression-using-gradient-descent-in-10-lines-of-code-642f995339c0?source=user_profile---------4----------------",
        "title": "Linear Regression Using Gradient Descent in 10 Lines of Code",
        "text": "My goal is to eventually write out articles like this for other optimization techniques. Let’s start with gradient descent. Note: This isn’t a comprehensive guide as I skim through a lot of things.\n\nIn our journey to study machine learning and artificial intelligence, it is important to know the basics before going deeper. The basics are the building blocks needed in order to understand more complex forms of architectures. For instance, you wouldn’t want to study ordinary differential equations without first understanding what, how, and why a derivative works. The same can be said with machine learning. An understanding of linear regression by using gradient descent as our optimization technique will help us understand more complex models in the future.\n\nI remember one time explaining to a group of data scientists the random forest classification model I created for this company. I tried making an analogy by using logistic regression since I assumed that my fellow data scientists in the room would know about it. A whole lot of them said they weren’t familiar with it. I got shocked since we were talking about a more advanced method here yet they didn’t even know what a logistic regression model was. Don’t be like that.\n\nLinear regression is one of the most basic ways we can model relationships. Our model here can be described as y=mx+b, where m is the slope (to change the steepness), b is the bias (to move the line up and down the graph), x is the explanatory variable, and y is the output. We use linear regression if we think there’s a linear relationship. For example, let’s say that the x-axis below is study_time while the y_axis is test_score.\n\nA straight line best describes this relationship because as a student studies more, his or her test scores increase. It wouldn’t make sense to use an exponential, sinusoidal, or logarithmic function to model this relationship. Linear models offer us simplicity; linear relationships are easy to understand and interpret. Note that relationships in the real world aren’t always linear, so instead we use more advanced methods like neural networks, which are universal function approximators. More on neural networks in the future.\n\nBy tweaking m and b, we can create a line that will best describe the relationship. How do we know we’re close? By using a thing called a cost function. It literally tells us the cost. A high cost value means it’s expensive — our approximation is far from describing the real relationship. On the other hand, a low cost value means it’s cheap — our approximation is close to describing the relationship.\n\nFor linear regressions we use a cost function known as the mean squared error or MSE. We take the squared value of our real data points minus the approximated values. Our approximated values can be calculated using the current m and b values we have: y_approx = m_current*x + b_current. After that, we add all those values up and divide them by the number of data points we have, effectively just taking the average. Now you see why it’s called the mean squared error.\n\nYou’re probably thinking right now, “that sounds splendid and all but how can we uncover m and b?? Brute force??” Brute force isn’t helpful. A more efficient way is gradient descent. Imagine trying to find the lowest point blindfolded as can be seen below. What you would do is to check left and right and then feel which one brings you to a lower point. You do this every step of the way until checking left and right both brings you to a higher point.\n\nThe math behind it isn’t as complicated as it looks. What we’re doing here is applying partial derivatives with respect to both m and b to the cost function to point us to the lowest point. If you remember your math, a derivative of zero means you are at either a local minima or maxima. Which means that the closer we get to zero, the better. When we reach close to, if not, zero with our derivatives, we also inevitably get the lowest value for our cost function.\n\nThe process of finding the optimal values for m and b is to then minimize our derivatives. Training a machine learning algorithm or a neural network really is just the process of minimizing the cost function.\n\nHere I’ll be using Python to code our linear regression model. I use Python because it’s my go-to language for doing data science. Furthermore, Python is great for both experts and beginners. The language was made for readability, so whether you’ve been programming for years or have just been programming for a day, it’s still fairly easy to navigate through someone else’s code.\n\nX and y are our input parameters. On the other hand, m_current and b_current are our slope and bias terms respectively, both of which will be updated as we try to find the best numbers so that the equation we get best fits our data. Here epochs refer to the number of times we train our model to find the best slope and bias for our model to fit the data. Finally, learning_rate here refers to the speed of convergence, meaning how fast gradient descent finds the best parameters.\n\nTo further understand the learning_rate, let’s go back to our example of finding the lowest point blindfolded. A big learning_rate would mean that the steps we take are too big and that you might miss the lowest point entirely. However, too small of a learning_rate means that we will take a long time to reach the bottom. Try to strike a balance between the two.\n\nThe important bit is the for-loop:\n\nWe iterate 1000 times because 1000 sounds good. Really depends on how much you want to iterate. Hyperparameter fine-tuning is an ongoing research right now, so you might want to check that out!\n\nWe calculate the gradient of the slope and the bias by using the equations we saw above. We then update our slope and bias by subtracting them the learning rate times and respective gradient value. The learning rate will determine the speed we will reach convergence. After 1000 iterations, we return m_current, b_current, and the cost.\n\nCongratulations! That’s the first step in your machine learning and artificial intelligence journey. Get an intuitive feel for how gradient descent works because this is actually used in more advanced models also. The goal here is to learn the basics, and you my friend have just taken the first step. Now off you go and learn more!"
    },
    {
        "url": "https://hackernoon.com/ready-for-infinity-war-heres-a-simple-countdown-timer-using-reactjs-2751eae37c0e?source=user_profile---------5----------------",
        "title": "Ready for Infinity War? Here’s a Simple Countdown Timer Using ReactJS!",
        "text": "I’m a huge fan of Marvel. I’ve been following the story line leading up to the big fight against Thanos since Iron Man was released in 2008. But at the same time, I like programming. Recently I’ve been learning bits and pieces of ReactJS and I thought to myself, “Why not make something useful out of these random pieces of tricks I learned!” See it here. If the font looks like TNR, wait a bit and refresh the page. It takes a while to download the Avengers fonts.\n\nThis was one of the first few apps I made during my earlier learning stages. I’ve learned a lot more since then. I plan on sharing my other works in the future to document my learning progress. It’s amazing how much time we don’t use that we otherwise could use for just learning and building. This gap year I’m taking is making me realize that.\n\nMy belief in “learning by doing” stems from the idea of building up certainty. At first I had no idea what the hell I was doing with the earlier fiddling I did with ReactJS. There were tons of trial and error involved like setting up a damn project for starters! Afterward, I continued looking around and made sure I understood at least one or two things from the code that I knew contributed to the output. I’m still in that process (I don’t think you’ll ever really get out of that honestly), and I’ll continue on that path because it helps me fill in gaps, and at the same time, build on previous knowledge that will eventually culminate to bigger projects.\n\nDoing this was really easy, seeing as a simple command such as create-react-app was all I needed to setup everything at hand. Makes life much easier than having to setup everything from Babel to Webpack. Programmers are notoriously lazy, so shortcuts like these are always welcomed and adapted.\n\nMy experience in Python and MATLAB programming also helped in understanding JS as a whole. It’s pretty easy to migrate skills to other languages when you start to realize that they all pretty much follow the same structure and logic one way or another. ReactJS is pretty big, let alone JS, so I’d say it’s still a long way to go.\n\nHere’s what the contents of the html file look like after I did some cleaning:\n\nEverything gets set up for you quite neatly. Here’s what the main index.js file looks like:\n\nThe rendering happens here by “attaching” the contents of “App” into the root div tag in the HTML file above. Think of it like inserting a previously coded 200+ line HTML file into that root div tag. That’s how ReactJS works in summary. You program in JavaScript eXtension (JSX), making it look like you’re programming still in HTML when in fact what you’re using is JavaScript. Pretty awesome stuff.\n\nThe bulk of the rendering happens in App.js, and as you can see below. JSX makes it feel like you’re writing both HTML and JS at the same time. Amazing stuff!\n\nThe functionality of the countdown timer was put in another file called Clock.js. The bulk of the math and the actual rendering that allows one to see in real time the countdown is all there. I haven’t intuitively understood the component lifecycle yet, so I can’t explain yet in simple terms how componentWillMount() and componentDidMount() work. I know it works, but I just can’t find the simple words yet to describe why and how. I don’t want to presume knowledge in something I don’t know well enough of. Told you there are still some gaps; I’m working on it!\n\nIf you’re new to ReactJS, you might have noticed that the div tag has className instead of class. Remember, we’re still programming in JS, and the word class is already reserved. There are some other minute details like this also. For instance, using const or let instead of var. I’m still new to all of this so I’m still navigating.\n\nI’ve hosted everything on my Github page in case anybody wanted to take a look at the whole shebang.\n\nStill got a long way to go! Gotta keep practicing. I mean I gotta host my Machine Learning backends online somewhere somehow, right?"
    },
    {
        "url": "https://medium.com/@jsphbtst/three-reasons-the-philippines-is-not-free-market-capitalist-a8e5c86b0678?source=user_profile---------6----------------",
        "title": "Three Reasons the Philippines is Not Free Market Capitalist",
        "text": "Three Reasons the Philippines is Not Free Market Capitalist\n\nWhen I say “free markets,” what I mean to say is that the degree of freedom of the market from the government is great. As opposed to the government altering the price system and its associated market signals via fiscal policy, monetary policy, subsidies for favored players in the market, arbitrary seizure of property, and many others.\n\nSome argue that the Philippines is becoming too “capitalist,” with so-called neoliberal policies here and there. However, us classical liberals and libertarians would like to remind our friends from the left that we are not even close to being a “capitalist” nation, if by “capitalist” they mean free market capitalist.\n\nLooking at the landscape of the Philippines, it would be safer to say that it is a mixed economy, with the State having a tight grip on the market, and with some of its policies working in favor of the ruling oligarchs. The State colludes with favored players in the market by using regulations, taxes, and subsidies to pick and choose winners. In doing so, there does not exist, to a certain degree, a genuine competitive market. One only needs to look at our Internet Service Providers to see that. One will be easily pressed to say that what we have is an oligopoly, with competition being hampered because of either lobbying efforts or by the high barriers to entry. Remember Telstra?\n\nAnother example is the recent uproar from the taxi cab lobby to ban ride-sharing companies such as Uber, Lyft, and Grab. Why? For the sole reason that these ride-sharing companies are able to sell their services for a lower price than the taxi cab companies. It absolutely makes no sense that taxi cab companies are outraged over their revenue stream being cut by a more effective competitor that better voluntarily attracts customers. Yes, the same taxi cab companies who like saying that they hate going along certain areas because they are “too traffic,” or that “no other passengers are there,” or thousands of other excuses. Or perhaps the same taxi cab companies that overcharge their customers because of the aforementioned, or cheat their customers by fixing the meters so that it sometimes runs faster. And these grievances have been happening for years with little improvement. Makes no sense at all.\n\nHere I outlined three quick reasons why the Philippines is far from being free market capitalist.\n\nThe Philippine income tax system has not been amended in a long time. By “long time,” I mean since 1997. Talk about being old.\n\nThe problem with not updating the tax system is this phenomenon called “bracket creep,” a movement into higher and higher tax brackets because of inflation. Due to inflation, the purchasing power of the Philippine peso weakens over time. Meaning to say, 1 peso in 1997 is “not equal” to 1 peso now in 2017. If Php 100 pesos before could buy you 2 pieces of Chicken with rice, while now it can only buy you 1 piece of Chicken with rice, then the “power” of your money to buy that same good before has now diminished. You cannot use the same nominal amount to buy the same good from before.\n\nTo anyone who is old enough, think of a good or service from 15 years ago and compare it with the price of today. Will you still pay roughly the same amount for that good or service?\n\nCarrying that same logic to taxes, as can be seen in the table above, those values are not “equal” with 2017 values. Prices have roughly doubled since 1997. The value of Php 10,000 in 1997 is roughly equal to Php 20,000 today in 2017. If part of an individual’s earnings was Php 10,000 back in 1997, and that same individual is now earning Php 20,000, then in inflation-adjusted terms (real terms, as economists would say), the income did not really rise. Said individual would still have the same purchasing power as he or she did 20 years ago. This means that the things he or she could buy in 1997 would roughly still be the things he or she could buy in 2017.\n\nLet us take it a little step further. If a person was earning Php 144,000 in 1997, and is now earning Php 288,000, then the purchasing power roughly did not change as we have discussed. However, if we look at the income tax brackets above, that same person is now pushed up into a higher tax bracket without having an increase in purchasing power, giving up more of his or her money to the State. This is bracket creep.\n\nEven for private businesses it is also painful when compared to our Southeast Asian neighbors — We have the highest rate. Here in the Philippines, the corporate tax rate is set at 30%. This means that after deducting operation costs and depreciation from the revenue, which would equate to the company’s profit, 30% of that will go to the State.\n\nInstead of allowing a company to use that money to invest in itself, or to offer bonuses to its employees when a certain profit level is hit, 30% gets stolen. Make no mistake about it, incentives change with and without a tax. For example, and let us use also the same 30% deduction, if you had Php 120 for lunch, and say you were extremely hungry, what would you buy with it? Now assuming 30% gets deducted and you now have Php 84, what would you buy or do now?"
    },
    {
        "url": "https://medium.com/@jsphbtst/thank-the-state-for-consumerism-8c7f94020f71?source=user_profile---------7----------------",
        "title": "Thank the State for Consumerism – Joseph J. Bautista –",
        "text": "Now we can begin our analysis of how the State plays a role in promoting this increasing tendency toward more consumption.\n\nLet us take a simpler case: Robbery. When you get robbed, your claim to your property gets violated. The economic implications of it is that you now have less stuff on your hands. Why is this a problem? That stuff you once had could have been used in aid of satisfying future wants. In other words, the goods stolen possessed some form of future investment, use, or serviceability to you that is now gone. For example, if your washing machine gets stolen, it halts all future possibility of making your life easier in terms of washing your clothes. Now that it is gone, and until you find a way to replace it, you either must spend money to pay someone to clean your clothes for you, or you will have to do it yourself, incurring more costs than you would have if your washing machine did not get stolen in the first place. According to Hoppe,\n\nWhen our stuff gets stolen now, or when we get prevented from using them now, our rate of time preference will tend to rise. Another example to illustrate this point is when all our stockpile of food either becomes spoiled or stolen. Now that they are gone, we will tend to buy more food now to compensate for the loss, reflecting the increase in the rate of time preference. The good news is that eventually we go back to equilibrium when no such occurrences of further property violations or the prevention of using our own property arise.\n\nTime preference rates and schedules naturally fall over time because, as we grow older, we tend to become more farsighted. As kids, all we wanted to do was consume, demanding more this and that from our parents, clearly being unaware of the reality of scarcity. But, as we grew older, we come to the realization that things are not always readily available, and that things are indeed scarce. The amount of money that you have can only get you so far, so it is about finding a way to utilize one’s spending, saving, and earning capabilities that enables one to have a better future.\n\nThe more we consume our resources now, the less we can consume in the future. As was noted above, time preference rates and schedules can indeed fall when property violations or measures to disallow the use of one’s property emerges. Robbery, however, rarely happens in a high-functioning society. And in most high-functioning societies with clear property laws in place, getting just compensation and retribution from the evil doers is assured. Furthermore, investment in security becomes common once one possesses the needed funds. A good question to ask is: What if this form of robbery is persistent? What happens to one’s time preference rates and schedules?\n\nAs was mentioned before, the State’s continued existence relies upon its legitimate monopoly on violence. Without it, the State would be rendered moot and its wealth-appropriating powers gone. Today, it continues to make its case relevant by “taxing the rich and giving to the poor.” Taxing the productive sector of its citizenry, charges a talent and operations fee, and then proceeds to redistribute that wealth. Talk about actually redistributing the wealth out of your own good will. Hoppe notes that,\n\nAll things considered, what happens to time preference rates and schedules of individuals whose property get violated? What we should observe is a rise in time preference rates in the short-term, and inevitably a rise in time preference schedules in the long term. In effect, individuals are incentivized to obtain or consume goods and services now more than later. Why? As we have said before, the State appropriates wealth, and seeing as that is within the time horizon, individuals decide to plan ahead and consume now. Allow me to put it this way: If you know you will be robbed tomorrow, and there is no stopping it, what do you do with your current resources? Majority of you will probably answer that you will consume more now than later, because there will be no more of your resources later for the obvious reason that they got stolen.\n\nI cannot stress enough how good Hoppe describes this phenomena in his book. He does not directly discuss consumerism, but a close reading and a little thinking should lead one to conclude the same ideas as I have. He states the following,\n\nAnother institution that the State can use to promote consumerism is Central Banking. With its monopoly on money, tinkering with the forces of the market can become regular. For instance, quantitative easing or negative interest rates are nothing more than tools that inevitably decrease the value of the currency at hand with every new one being printed. One only should know the concept of diminishing marginal returns, or value for this case, to figure that out.\n\nThe central idea we need to consider here is the role that interest rates play in the structure of production. As we have mentioned earlier, interest rates reflect the time preference of society. Higher interest rates mean that people tend to want to consume now more than later. In practical terms, people are not saving their money, meaning that there is not enough money around or inside bank vaults to lend out. Since this is the case, interest rates tend to get pushed up. On the other hand, what about lower interest rates? Just the opposite: People are saving more than they are spending, meaning there is more money around the bank vaults to be lent out.\n\nInterest rates play an important role in allocating resources over time. Some goods require a lengthier period before a return on investment is made, meaning they become a riskier investment venture. These goods, also called higher-order goods, can then be said to be interest-rate sensitive. If the interest rate is currently 15%, and your project costs you about $1,000,000, with a $1,500,000 return on investment after 5 years, your profit will be $350,000. Imagine the difference if the interest rate was 8% with the same costs and return on investment. This would lead you with a profit of $420,000. That is a lot of money.\n\nThere are many things that can happen when interest rates are lowered, mostly notably the business cycle, however, let us look at what happens with the consumer. Artificially lowered interest rates do not reflect the real time preference of society. What happens when a society that currently wants to consume now gets faced with artificially lowered interest rates?\n\nLudwig von Mises notes in Human Action that “a monetary expansion results in misinvestment of capital and overconsumption.” Here, overconsumption is what happens when both entrepreneurs and consumers fight for scarce resources at the same time, in effect bidding up prices. The interest rate should be coordinating resource allocation over time, but since they are distorted, the mechanism for coordinating also becomes distorted. Entrepreneurs, especially those that are engaged in longer-term return on investment types of businesses, will be incentivized to take advantage of this drop in interest rates because it will increase further their profits in the future. As for the consumers who want to consume more now? They will also take advantage of the lowered interest rates by also borrowing money to finance their spending.\n\nIn this scenario, an artificially lowered interest rate will then cause everyone to consume more. The more this goes on, the citizenry will continue to consume more now than later because the cost of borrowing money is low. In this regard, the population gets incentivized to consume more, not necessarily by capitalism, but by the State.\n\nThe State is a dangerous institution that holds plenty of monopoly privileges. Furthermore, it is also exempt from a lot of the rules it even sets itself, most notably, property laws, with its continued practice of wealth appropriation.\n\nIs capitalism the sole blame for consumerism? Not necessarily, as has been argued above. Capitalism may have its faults, but it does not necessarily promote this culture of an ever-increasing mode of consumption over time. Consumerism is dangerous in that it promotes shortsightedness rather than farsightedness. Resources are scarce, and people over time realize that.\n\nGiven all that has been discussed, one can only imagine the incentive to consume now more than later in a more socialist society. But that, my dear reader, is a topic for another time."
    },
    {
        "url": "https://medium.com/@jsphbtst/what-excessive-capitalism-a-response-to-capitalizing-development-e7ccc0052901?source=user_profile---------8----------------",
        "title": "What Excessive Capitalism? A Response to ‘Capitalizing Development’",
        "text": "Author’s note: This is a short response and commentary to an article written for my university’s student newspaper. It can be found here.\n\nThere is a stench of anti-market bias that exists inside Ateneo. This bias comes from the distorted picture of the role of the entrepreneur, the social function of profits, and what the market actually does. The three have already been answered by many great classical liberal and libertarian thinkers. Google is your friend. Here, I wish to address the idea that there exists “excessive capitalism” that is causing Philippine development to either be stalled or not happen at all.\n\nProfits exist as a signal that tells us where scarce resources should be allocated — higher-order capital goods in aid of creating lower-order capital goods, directly for consumer goods, for capital in aid of providing services, etc. Without profits, entrepreneurs will never be able to tell where and how to allocate resources. A basic neoclassical microeconomics course paints the picture of a firm entering market X, making a profit, and incentivizing other entrepreneurs to enter said market, thus lowering the profit margins prior to the first firm entering the market.\n\nA free market economist, classical liberal, or libertarian’s view of profits is that it is not necessarily a bad thing. The social responsibility of a firm is to make profits within the bounds of the rule of law and social norms. What makes profits unjustifiable is if they were earned through non-voluntary means or through the collusion with the State.\n\nA firm not making profits, as we have defined, is wasting resources. The Earth has scarce resources, and it is our job to make the most out of them. This is not for the sake of “efficiency”, but rather for the desire to want there to be more for generations to come. High time preference rates and schedules means less resources in the future. The more we make good use of our resources now, the more we will have for everyone else in the future. Imagine a parent happily spending so many things now that he or she burdens his or her family with tons of debt after he or she passes away. In what world can that be called responsible?\n\nIs there excessive capitalism? We can have an empirical look on this by looking at the Index of Economic Freedom by the Heritage Foundation. The historical development for the Philippines shows us that we do not have excessive capitalism in the free-market sense. Instead, what we have is an excess of corporatism and cronyism, a collusion between favored players in the private sector with the State. In particular, take a look at Business Freedom and Government Integrity. You can look up the definitions respectively here and here.\n\nThe collusion of the State and favored businesses brings about the creation of anti-competitive market conditions that protect said businesses from being booted out of the market. Consumers inevitably choose which businesses in the marketplace survive, but if other companies limit competition, where is the freedom to choose between businesses when we are not satisfied? This is a big hindrance to development. These favored firms rack up the money, continue to get in bed with the State, and have the gravy train continue for as long as it should. One only needs to look at the military-industrial complex in the United States to see how this all goes.\n\nThe author notes that, “there are some companies who actually hire the people into the company, but most would rather provide short-term projects for them to generate income.” Competitive market conditions do not just exist in the goods and services market, but also in the labor market. The same logic applies. Again, if I am not happy with my employer, but there are not many opposing competing employers available, then what choice do I have? I can start my own business, true, but where will I get the money to invest in it? Assuming I already do have it, what about existing regulations thanks to the power the favored industries hold? Will I last?\n\nAt the end of the article, the author notes a point that I agree with, yet from a different perspective, saying that,\n\nThese are the key takeaways from the collusion of the State with the favored industries in the private sector. Once these favored players are in, you think they care about “giving back to society?” I doubt it. As Lord Acton once said, “power tends to corrupt, and absolute power corrupts absolutely.”\n\nWhat we could do is to properly enact good private property laws to prevent theft and arbitrary asset seizures, a competitive market condition that will discipline businesses into doing their jobs (I am looking at you, ISP providers), and to ban the State getting in bed with favored players in the market. Which should get you thinking, why not just abolish the State altogether?"
    },
    {
        "url": "https://medium.com/@jsphbtst/trouble-with-the-welfare-state-additional-notes-on-us-vs-them-3a8471ed1c5a?source=user_profile---------9----------------",
        "title": "Trouble with the Welfare State: Additional Notes on “‘Us’ vs. ‘Them’”",
        "text": "Earlier on, I wrote an article entitled Us vs. Them in an attempt to demonstrate how the tactics employed by the State in times of war are also used domestically. The creation of the dichotomy allows the State to see who are its allies and who are its dissenters. Its all-seeing eye allows it to either stop or exterminate those in the opposition when the time comes.\n\nWhy is it that the State never gets booted out of power? It was only answered briefly in my previous article after quoting Dr. Robert Higgs. Here, we shortly expound on how the State enables that using what seems to be a positive tool: welfare. The road to hell is paved with good intentions.\n\nWhat is a welfare state? Merriam-Webster defines the welfare state as “a social system based on the assumption by a political state of primary responsibility for the individual and social welfare of its citizens”. This should be a fair-enough definition to work with.\n\nEarlier conceptions of the welfare state can be traced to German sociologist and economist Alexander Rüstow, who said in his book Das Versagen des Wirstschaftsliberalismus that,\n\nDr. Juan Ramon Rallo points out that Rüstow saw neoliberalism as the “third-way” between capitalism and socialism, with Rüstow even creating the term the “social market economy.” In Rallo’s words,\n\nTo my Filipino audiences, even our former president and dictator Ferdinand E. Marcos shared the same sentiments. His time as president was his way of implementing his obsessed vision of the ‘New Society.’ He wrote in page 84 of Notes on the New Society of the Phillipines,\n\nHe saw authoritarianism as a necessary tool in order to implement his New Society. Without the obedience of the citizenry, his mission would fail. One can already see, in part, how he and his supporters would later on justify both the authoritarianism and atrocities that happened during the Martial Law period. Furthermore, he writes in page 102 in An Ideology for Filipinos that,\n\nThe welfare state combines the redistributive properties of socialism with the private property-esque based institutions of free market capitalism. I say “esque” because the State extracts wealth through taxation or asset forfeiture. Your supposed property claim becomes void when the State decides to forcefully seize it away from you. It seeks to redistribute these stolen assets to promote a “more just and fair society.” People are incentivized to be made dependent on the goodies given by the State when this practice is continued.\n\nThen there is State monopolization, or nationalization, of industries. What becomes of one’s healthcare when this is monopolized by the State? What happens when electricity gets monopolized? Or what about when internet providing services gets monopolized? There is danger here. For the last point, one only needs to look at how restricted the Chinese are.\n\nAll things considered, what happens in times of internal warfare? Once the State creates the dichotomy, it keeps everyone in check by providing them with the goodies it promises — goodies which were stolen. Some dissenters might look past this and continue with their agenda. However, for the supposedly “non-crazy” ones, how can they revolt or dissent against the same organization that keeps them dependent on it? It is as if any form of dissent is biting the hand of the provider. Quite disrespectful, some would even say.\n\nThe damage becomes more severe when the market is weakened. The monopolization of some industries makes choice non-existent. If there is only one healthcare provider, how can one voluntarily abstain from one provider in order to go to another? Competition is what keeps private goods and service-providers afoot because they get their money voluntarily. Acting in ways that does not attract customers will eventually lead to their demise in the marketplace. On the other hand, the State extracts its wealth by force, distinguishing it from goods or service providers in the market since it does not obey this voluntaryist practice.\n\nWhen the State assures itself that it will give you the goodies promised, and that it is the only one providing it, will you really dissent from it? It is a good question to ponder on.\n\nI will conclude by quoting Higgs yet again. He wraps up the point excellently in his short essay entitled The Welfare State Neutralizes Potential Opponents by Making Them Dependent on Government Benefits, saying that,"
    },
    {
        "url": "https://medium.com/@jsphbtst/us-vs-them-768b22dac86d?source=user_profile---------10----------------",
        "title": "“Us” vs. “Them” – Joseph J. Bautista –",
        "text": "When the drums of the war machine are being banged, what is the overarching theme? Some would say that it is about winning, while some would say it is about defeating evil. True, but these can all be restated as being “us” vs. “them.” The State, in its ownership of informational and symbolic capital (See Pierre Bourdieu’s Rethinking the State: Genesis and Structure of the Bureaucratic Field), creates this dichotomy to win wars. After all, a less-than-united nation-State in times of war will surely lose.\n\nThe reader may be tempted to restrict war as something external. War, in its traditional and historical picture, is painted as a battle between opposing nations, with gunshots being fired and bombs being showered. Propaganda runs endlessly to discredit the other side, creating the image that “our side” is the benevolent actor. The funny thing is that both nation-States believe to an almost, if not, absolute certainty that their side is the “right side.”\n\nTreason is a weapon used by the State to quell dissent. Conspiring against one’s own team by “helping” the opposition is considered a war crime and may be punishable by death. How funny is it that even the slightest bit of skepticism toward the war or with activities of the State is considered a crime, when it is the State that orders the showering of bombs, and would even go as far as to rape the men and women of the opposition and kill their children. Despicable.\n\nWar also manifests itself in other forms. It is short-sighted to believe that the State only wages war against other people, and never its own. The State masks its democidal tendencies in a way that makes it look benevolent to the citizenry. Oftentimes we hear the war on poverty, the war on drugs, and so forth. It sounds benevolent and acting in kind, but the true nature of the activities of the State are evil and utterly reprehensible.\n\nApplying the pattern of traditional warfare, we see some odd and disturbing implications as to what the State is doing.\n\nThose who are on the opposing side of the war on drugs, for example, are deemed as criminals, terrorists, or even scums of the Earth. The State’s propaganda machine is used to such an extent as to rile up the “fan base” to create the dichotomy. Once the dichotomy has been established, it will be easier for the State to target its enemies. Police brutality and militarization, arbitrary expansion of State power, and so forth are common observations. Drug users, abusers, sellers, and everyone else are at the opposing end here— including the nonviolent ones.\n\nWhat about those peaceful people who are dissenting against the State? They are traitors that deserve to either be silenced or punished. All hail the great power of the State and its moral absolutism. “Traitors” are castigated, labeled, and dismissed. Some are mocked to such an extent that their truth becomes a lie, with the combined efforts of the “fan base” and State propaganda. One only needs to read George Orwell’s 1984 to understand how this goes.\n\nIn the case of the Philippines, the opposition, in any shape or form, is labeled as “dilawan” or “yellowtards.” Name-calling becomes a weapon instead of sticking to the argument. To some, this may seem petty or childish, but for the State, this is all but beneficial. The all-seeing panopticon that is the State uses this artificially created dichotomy to keep track of who are its allies. It will also use its propaganda arm to fully weed out dissenters. When the time comes, it will target those it deems as the enemy.\n\nHow does the State maintain its grip on its so-called “legitimacy” despite all these reprehensible acts of violence? In the words of Dr. Robert Higgs, in his essay entitled State Power and How It Might Be Undermined, he states that,\n\nPropaganda is used to make the drug war look and sound “beneficial.” Using public or private funds to bribe other government officials to obey and follow orders is to showcase artificial “unity” or “bipartisanship.” Threats and other institutional means are used to make dissenters either bow down and follow along or utterly powerless and irrelevant. The final option would be to kill, by either using capital punishment or staging a crime scene. There are many ways to go about this.\n\nThe danger of giving more and more power to the State is giving it more capabilities to keep an eye on you, and when the time comes, destroy you. We cannot abolish this monstrosity overnight, but over time, continually limiting its capabilities and delegating most of its powers back to the people is the only way to contain this leviathan. Perhaps in time, we will not be needing the State anymore. That would be nice."
    },
    {
        "url": "https://medium.com/@jsphbtst/bautista-contra-sison-i-on-what-is-neoliberalism-and-similarities-ish-with-libertarian-anarchists-7ae91e971ed7?source=user_profile---------11----------------",
        "title": "Bautista Contra Sison I: On What IS Neoliberalism and Similarities-Ish With Libertarian Anarchists",
        "text": "On August 20, 2012, the Communist Party of the Philippines (CPP) founder Jose Maria Sison wrote an article entitled Neoliberalism: A Scourge to Mankind. Here, Sison gives us a brief overview of the thinkers who contributed to what he describes as “neoliberalism,” like Ludwig von Mises, Friedrich Hayek, and Milton Friedman, and further stresses the point for a revolutionary change because of the scourge that is “neoliberalism.” It is an interesting read, and I invite both my leftist comrades and classical liberal and libertarian brethren to read it with an open mind.\n\nIt is true that the term “neoliberalism” emerged from the Colloque Walter Lipmann in Paris in 1938, but as Dr. Juan Ramon Rallo writes, “Hayek and Mises neither coined nor accepted the term.” Rather, it was, as also correctly pointed out by Sison, German sociologist and economist Alexander Rüstow who coined the term “neoliberalism.” Rallo continues by saying that Rüstow “opposed classical liberalism and used the word “neoliberalism” to describe a ‘third way’ between capitalism and socialism.”\n\nRallo further cites what I think summarizes the neoliberal creed from Rüstow’s perspective. In Rüstow’s book entitled Das Versagen des Wirstschaftsliberalismus (In English: The Failure of Market Liberalism), he writes:\n\nRüstow’s view closely resembles the modern day welfare statist, in which the market is allowed to operate, while the State is there ready to appropriate wealth in order to redistribute it in the form of welfare programs.\n\nAs we read further Sison’s article, however, we see an implicit side-stepping, by putting Mises, Hayek, and Friedman into the “neoliberal” dumpster despite him being aware of Rüstow. None of these men, apart from Rüstow, have ever claimed to be “neoliberal.”\n\nSison also mentioned the Freiburg school as being part of the “neoliberal” camp. However, I contend that this is only true if we are talking about Rüstow, and not Mises, Hayek, or Friedman. For matters of clarification, the Freiburg school is in contrast with the conclusions of what both the Austrian and Chicago school produce.\n\nSome of you may call this simply a matter of semantics, and I grant that. Allow me then to dive further into Sison’s article.\n\nSison starts off by stating that the roots of so-called neoliberalism started off from the works of Adam Smith. Mises, Hayek, and Friedman’s works are largely influenced by what Smith has already written, and since Sison charges these men of being so-called neoliberals, then I have no problem with his claim that Smith is, in some way, the root.\n\nA chunk of what Mises, Hayek, and Friedman wrote were influenced by Smith. Not to say that there were other economists such as Carl Menger, Eugen Böhm-Bawerk, and Friedrich von Wieser for Mises and Hayek, or economists like Frank Knight, Jacon Viner, and Henry Simons for Milton Friedman. The point of the matter is that Sison is correct in pointing out that Smith is an important figure to look into, however, not the only figure that we should look at in determining who influenced who. These men were not Smithians, as they eventually developed their own bodies of work in economics.\n\nWhat I find strange is the following paragraph from Sison, in which he writes:\n\nA short note before diving in that I would like to make is that it is true that classical liberals and libertarians denounce State intervention as much as possible, while radicals like myself, Bryan Caplan, David D. Friedman, Murray N. Rothbard, Robert Higgs, and other libertarian anarchists further conclude that we abolish the State altogether. Now I say classical liberals and libertarians because Sison mentioned Mises, Hayek, and Friedman, who, if we recall: 1) rejected the term neoliberalism; and 2) called themselves something else. Mises referred to himself as a liberal (See Liberalism: In the Classical Tradition) in the old sense, with Hayek not being far from that as he preferred to call himself a classical liberal (See Why I Am Not a Conservative). Friedman (the same can be said with his son David, and his grandson Patri) happily called himself a libertarian.\n\nGoing back to the quotation, if what Sison meant by State intervention is the ways in which the State interferes or regulates either activities or decisions by private individuals or group of individuals, then I will have to disagree with him, and charge him with mischaracterization. I have never come across a quote from Friedman, Hayek, or Mises in which they said that State intervention is favorable because it benefits businesspeople. What these three have done, in their own different ways, was advocate for the State to lay its dirty hands off of the economy, and keep its role in protecting property rights, enforcing the rule of law, and maintaining the judiciary, police, courts, and mechanisms for national defense.\n\nWhat further bothers me is how distorted the “who or what constitutes a neoliberal” litmus test is. Sison claims that, “Hayek and Milton Friedman became the iconic figures of neoliberalism in the Chicago School of Economics.” Is this true? The two were similar, but highly different on an important matter: Monetary policy.\n\nHayek’s business cycle theory puts the Central Banks and the interest rate at the center of the analysis, stating that an artificial expansion of credit distorts the capital structure (See the Hayekian triangle) and sow the seeds for the boom-bust cycle. This was how he interpreted the boom that had asset prices and capital goods prices soar, and how the inevitable bust that was the Great Depression (See this video by the Foundation for Economic Education or this video of Murray N. Rothbard) occured once the Central Bank stopped inflating.\n\nFriedman saw it differently, stating the opposite by saying that it was the money supply contraction of around 35% that caused the crisis. Had the Central Bank expanded the money supply and not stood idly by, the banking crisis that caused one-third of all banks to vanish, which Friedman and his colleague Anna J. Schwartz points as what caused the Great Depression, would not have happened (See this video of Friedman explaining the causes of the Great Depression).\n\nWhat about subsidies? All three men were against subsidizing certain industries as they favored the State not interfering in the market. Subsidies are a form of crony capitalism, plain and simple. When the State allocates its resources to a certain producer, the State is inevitably choosing the “winners” and “losers” by virtue of allocating said resources to a particular, or set of particular producers. That is not in any way, shape, or form free market capitalism.\n\nAs for investment guarantees, I will admit that I do not know what in particular Sison is talking about. If, what he means, is again crony capitalism (whereby, again, what I mean here is the State favoring certain industries over another), then I will simply reiterate the fact that neither Mises, Hayek, nor Friedman ever advocated for that.\n\nSo far, Sison fails to offer what exactly constitutes a neoliberal. As I have demonstrated, he fails to distinguish between Mises, Hayek, and Friedman, while lumping them in together as if they were the same. Sison states that “expansion of money supply and credit” is part of the so-called neoliberal creed, but fail to realize that Mises and Hayek were against this. Mises advocated for a commodity-backed currency (something like a gold and silver standard), while Hayek expanded on the point by advocating for a competition on different currencies. Furthermore, at the center of an Austrian-school analysis of business cycles is the Central Bank, which is spread all over Mises and Hayek’s works. The two were in favor of doing away with Central Banks, which would make one wonder if Sison even read the works of Mises and Hayek in the first place.\n\nThe only one of the three who is remotely close to what he is saying is Friedman. Milton Friedman’s position was to match the growth of the money supply at the same rate as inflation. As mentioned by his son David D. Friedman, author of the Machinery of Freedom and renowned libertarian/anarcho-capitalist theorist, his father only supported such a policy because Central Banks existed in the first place. Milton Friedman was only working within the confines of what could politically be done, and trying inasmuch as he can to direct policy toward more liberty. In David’s words:\n\nDistinctions are important so we do not get sucked into rhetoric. This is my main beef with Sison: he fails to adequately define what he means by neoliberalism, but proceeds anyway to comfortably lump similar-looking things into one, then vociferously attack. It would be akin to lumping together a liberal democrat, a social democrat, and a national democrat into one and calling them all communists. Some people out there do this, but I think that is intellectually dishonest. There are differences that exist, and it is important to know the differences and be able to distinguish.\n\nIf there is one thing I like about Sison that shows a glimmer of hope, it is that he acknowledges a bit the role of the Central Bank. He writes that,\n\nI say a glimmer of hope because there may be grounds for agreement on some parts, and hopefully an opportunity to convert him (as unlikely as it sounds) or his followers. I am here to build bridges, not burn them.\n\nIt would pay Sison to read up on the writings of Mises, Hayek, Rothbard, and other Austrian school economists in studying the role of the Central Bank in starting business cycles and worsening income inequality. It seems that he is not at all familiar with their positions.\n\nContinuing on, Sison further writes that:\n\nIf the neoliberalism that Sison advocates for includes the strong role of a Central Bank in manipulating interest rates and the money supply, then he should hop on board with me and the rest of the Austro-libertarian crowd. What he described in the quotation above is exactly what happens when we have the State toying around with the money supply — which is nothing good, most of the time.\n\nIn the “Neoliberal Economic Policy” section, Sison also points to imperialist powers and imperialist State accumulation of military power. I myself would not personally support the continued accumulation of military power of any State. Just because Ronald Reagan and Margaret Thatcher had some good policies, does not mean that one defends these two conservative leaders in totality. Their interventionist ventures, of which include feeding the military-industrial complex, are things that we classical liberals and libertarians completely and utterly denounce.\n\nThere is a question that Sison implicitly touches on that needs to be answered: Why is it that most capitalist nations are the most militarily capable? This grabbed my attention, because, similar to the prior glimmer of hope in him acknowledging the role of Central Banking, there may be room for moreagreement and possible opportunities for conversion among him and his followers. My short answer would be through capital accumulation. The unhampered market economy through cooperation and the division of labor can produce immense wealth that it inevitably tempts the State to appropriate more. Once a capitalist nation has done all the necessary savings and investment of capital goods that it needs in order to further grow its economy, it will have every advantage that it has when it comes to war.\n\nMy oversimplifcation does not do justice with what Dr. Hans Hermann-Hoppe wrote before. Here I leave you with a fair quotation of what he wrote. He addressed this point in his essay entitled Marxist and Austrian Class Analysis, saying that:\n\nThe last point that Sison made was that the current crises of today cannot be solved by the dogmatic clinging to neoliberal economic policy. In Sison’s words:\n\nI will have to agree with Sison on this one, if what he means is what libertarians mean: A State that claims to practice “free market capitalism” when by very nature it does not, and continues to appropriate wealth via taxation, asset forfeiture, and other forms of theft, while at the same time, continue to think that its continued intervention in the market economy will solve the problems it created in the first place.\n\nI firmly believe that at our core, we both agree that peace and liberty are a way to achieve human flourishing. However, the interpretation of “peace and liberty,” and the means to achieve them, is disagreed upon. For Marxist-Leninist-Maoists like Sison, the approach is to start the people’s revolution by sowing the seeds of the revolutionary consciousness, and topple down the bourgeoisie. They will then seize control of the State and the means of production, implement socialism, and let time work its way through until the State withers away. When that time comes, communism will be realized.\n\nWhat I find strange about their battle plan is that they want to solve the problem statism with more statism — this time, with their people in it. I find this justification to be utter nonsense. But that is not the purpose of this article. Perhaps some other time.\n\nIt would probably pay well if Sison read and understood some of the works of the Austro-libertarians. Might I suggest Murray N. Rothbard’s magnum opus entitled Man, Economy, and State with Power and Market? Who knows, Sison may turn out to be a late convert into the cause of liberty. That would be splendid."
    },
    {
        "url": "https://medium.com/@jsphbtst/a-short-note-on-the-state-as-a-false-existential-comfort-44cb1faf36df?source=user_profile---------12----------------",
        "title": "A Short Note on the State as a False Existential Comfort",
        "text": "A Marxist-Leninist-Maoist (MLM) friend recently gave a good anecdote for me to formalize another way at looking at the State. This, of course, is not to discount the already-great works that have been thought of and written by the late Murray N. Rothbard. For one, his work entitled Anatomy of the State is an example of a great exposition to the venal and violent montrosity that the State is. Furthermore, there is an essay by Pierre Bourdieu entitled Rethinking the State: Genesis and Structure of the Bureaucratic Field that I invite you to check out. Rather, here I present a more practical symbolic view of the State.\n\nIn my friend’s analysis, he asserts that capitalism gives answers to existential questions that most religions in the world aim to address. He posts two questions: 1) What is the meaning of life?; and 2) What is my place in the universe? He proceeds to offer two answers: 1) To have more tomorrow than I have today; and 2) To compete against my neighbors for as much as I can gain, and let the Invisible Hand take care of the rest. However, in my reply, my contention was that the State offers a stronger answer to these questions as opposed to his mere misrepresentation of free market capitalism. In my view, the State is the religion of the sheep.\n\nIn answering the first question, one first needs to see what the State is. Being the sovereign entity that it is, the State can be viewed as the physical representation of God, who is itself a sovereign entity. Sovereignty implies supreme and complete independence, power, and authority. A sovereign state is not bound by any rules except its own, implying that it can — and will — terminate the life of its own respective citizenry under the guise of whatever propaganda it aims to promote. Democide has been well documented in history. For the statist then, the meaning of life is inevitably tied to one’s complete subjugation to the State. If not, either flee from this land or the State will enact its sovereign powers to terminate you. The State owns you.\n\nThe answer to the second question is a mere application of the answer to the first one. A statist’s role would be to support everything the State does to ensure its continued existence. More specifically, support the wars that keeps the State alive (war is the health of the State), justify all double standards of the State such as theft in the form of appropriation of wealth, asset forfeiture, counterfeiting money by Central Banking, inflationary policies that inevitably make the elite richer and the poor porrer, and many others. Do not go against the State. The State is great. Or else.\n\nWhat bewilders me is that some individuals from the MLM crowd acknowledge aspects of these truths, yet think that more of it is what is needed to enact their socialist utopia. They too see the dangers of the State, yet believe that putting “the right people in power,” namely their people, will be the solution. As Lord Acton said, “power tends to corrupt, and absolute power corrupts absolutely. Great men are almost always bad men.”\n\nThe great Jordan B. Peterson puts it way better than I ever could in the video below:\n\nA sizable amount of individuals defend the State up to this day, despite all of the horrible crimes against life, liberty, property, and the pursuit of happiness that it has repeatedly committed throughout history. These same individuals, even stretching back to their intellectual forbearers, have made a religion out of the State. As a thought experiment, name yourself a certain present-day social issue and proceed to conduct a short survey on what is to be done. More often than not, assuming majority of your friends are not libertarian (not even the case sometimes) or State-skeptics, the answer that you will get is more State action. The problem of poverty? State action. Human rights violations? State action. Traffic congestion? State action.\n\nSadly, for the dissenters, the Church they built does not welcome heretics."
    },
    {
        "url": "https://medium.com/@jsphbtst/a-sincere-concern-for-some-free-education-far-leftists-796728648a97?source=user_profile---------13----------------",
        "title": "A Sincere Concern for Some Free-Education Far-Leftists",
        "text": "I have been seeing some far-leftists advocate for free education. In truth, I myself believe that that should be realized. I, along with others, have a different approach with how to enact that without the utilization of the venal and violent monstrosity known as the State. However, to no one’s surprise, the utilization of such is what some far-leftists are advocating for.\n\nIf I am not mistaken, some of them demand free education now, because in their eyes, education is a right. The State should then enforce this right by making education free. Simple enough.\n\nNow from an outsider’s perspective, both a libertarian and a Marxist-Leninist-Maoist (MLM) will sound the same in terms of their surface level analysis of the State. To my knowledge, both groups hold that the State is too dangerous to tolerate — or at least a bulk of them. I myself certainly hold this belief thanks to great minds like Murray N. Rothbard and Robert Higgs, who continue to be great deals of influence to my intellectual development. However, whereas libertarian anarchists (redundant?) believe in the abolition of the State and replace it with nothing, the MLM crowd would instead replace the contents of the State with their kind first to enact socialism before their controlled State withers away and communism is achieved.\n\nIt is through the development of the revolutionary consciousness in the proletariat mind will the communist/socialist revolution be successful. Again, the spread of the revolutionary consciousness is a necessary component for the socialist revolution to be successful. The full imposition then of the unhampered market economy should do the trick, as full exploitation can be achieved, and the revolutionary mindset could be accelerated. I say “full exploitation” because when welfare programs are enacted, a sense of comfort is given to those who are supposedly exploited. The proletariat are dissuaded away from the revolutionary mindset because of welfare programs, as the sense and experience of exploitation is diminished because of welfare programs that are at least present in their hardship. Welfare serves as a policy of attraction of sorts to make the proletariat dependent on the elites who control the State. Capitalism in this case becomes tolerable.\n\nLet us step back a bit. The MLM crowd are the same crowd who hold that the State today is being controlled by the bourgeoisie — the very elite they want to overthrow/wage a revolution against. Does that not seem odd? Giving the State more power? Again, the same entity currently controlled by the ruling elite?\n\nBy providing free education using the State apparatus, are the MLM crowd not giving the bourgeoisie more incentives to strengthen their hold on society? By nature of holding this power, the bourgeoisie can use State power to indoctrinate the masses in their bourgeois ways. This hold will strengthen over time, as the bourgeoisie both appropriates larger sums of wealth using the State apparatus, and also exploit the laborer even further in the private sector by lengthening the surplus value they continually take advantage of.\n\nJust to be clear, I believe Marxian economics is baloney and a load of crap. See the great Austrian school economist Eugen von Böhm-Bawerk’s work entitled Karl Marx and the Close of His System. Lots of great works too like Man, Economy, and State by Murray N. Rothbard, The Machinery of Freedom by David D. Friedman, Socialism: An Economic and Sociological Analysis by Ludwig von Mises, and many others.\n\nMy suggestion to my comrades in the MLM crowd and beyond would then be to first institute the unhampered market economy. Let us institute full capitalism, much to the cringing of some. This way, the revolutionary consciousness could be achieved faster. Second, your crowd could either start your own respective educational institutions or even infiltrate and take control of already-existing institutions. After which, a new army of graduates of your kind coming from your institutions could further brainwash others into your ways of thinking. Ad infinitum until every last speck of intellectual dissent is gone — through voluntary means of course.\n\nI say these because in my hypothetical scenario, the wretched bourgeois who control the State will not get in your way by using regulations and the like; You are free as you wish so as long as you do not infringe upon the equal rights of others. Is this not a good combination?\n\nAfter all that has been said so far, I leave you, my dear MLM (or related) comrade, with a sincere message: In the medium-run, be libertarian with me. It is the only way to achieve your socialist utopia without those wretched bourgeoisie ruining everything. Libertarians will not even get in your way since you own the property. Since it belongs to you, you have every right to physically remove, so to speak, those who you wish to be expelled from your private land — again, peacefully of course.\n\nWho knows, you might actually understand our way of seeing the economy, society, and the State. Even better, you might eventually abandon your ways and instead join our cause. That would be nice."
    },
    {
        "url": "https://medium.com/@jsphbtst/the-economics-of-why-we-dont-care-a-short-public-choice-esque-view-on-the-sanggunian-elections-fe3cfd3d6707?source=user_profile---------14----------------",
        "title": "The Economics of Why We Don’t Care: A Short Public Choice-Esque View of the Sanggunian Elections",
        "text": "Author’s note: I am both happy and willing to edit this article when more empirical evidence comes my way. Feel free to send in some if you have any.\n\nAt this time of the academic year, leadership positions are vacated and new students fill them up. From large student organizations to small clubs, old leaders are replaced with new students, serving as a fresh start for the upcoming semester. One of the organizations that will be holding this annual replacement is the student government. Here in Ateneo de Manila University, we call it the Sanggunian ng mga Mag-aaral ng mga Paaralang Loyola ng Ateneo de Manila. It is a mouthful, so the shorthand is the Sanggunian, or if you are feeling even more lazy, Sanggu.\n\nHowever, there has been an observed decline in student participation in elections — perhaps even, in campus politics as a whole. There even existed a problem before of shortages within Sanggu. This was because prior to the recent Constitutional Convention, there were two hurdles that had to be jumped over: 1) Candidates first had to have 50%+1 of their constituency vote for them; 2) Once the previous condition was met, only then can the results be considered “valid.” Even if candidate X gets more votes than candidate Y, the votes would not matter if the 50%+1 requirement was not met.\n\nDid the passage of the new constitution aid in increasing voter turnout? Some thought that it would, now that some barriers to entry have been removed. While others, like myself, thought that it would not. Removing those barriers to entry had nothing to do with increasing student participation at all.\n\nThe closest empirical data that can be used to look at this trend are the electoral results. The Ateneo Comission on Elections (COMELEC) posts them online. This made it easy to see the historical development of the percentage of the student population who voted over time. The data that was available was from 2012 Freshman and Special Elections (Fresh & SpecEl) up until the recent 2016 Freshman and Special Elections. To non-Ateneans, Fresh & SpecEl is usually scheduled within the first three months of the first semester, while the General Elections (GenEl) is scheduled at around three months before the end of the second semester.\n\nFor GenEl, Seniors are only counted in the official tally after a candidate reaches the 50%+1 quota. However, for my analysis, I decided not to remove them to further prove my point. On the other hand, for Fresh & SpecEl, in cases where there was no school-wide position being ran on (Vice-President, Secretary-General, Finance Officer), I merely took the sum of the voting population of each college-level position (those running in SOH, SOM, SOSE, and SOSS) and used that as a reference for the participation rate.\n\nBelow, we see a time series data depicting a progressively declining student body participation rate. However, the 2016 Plebiscite vote was an exception to the trend as it had a 67.44% turnout. Good job to the tireless efforts of those in the Ateneo Constitutional Convention at the time.\n\nSince I have not yet figured out a way to embed Bokeh plots in Medium, feel free to click that thing below to see where I did the visualization.\n\nIn any case, here is the static version of the time series graph generated using python seaborn.\n\nI argue that the incentive structures that exist make non-participation rational. Most of the ideas here are intuitive and are not my own. However, I still try to formalize most of these thoughts into a model of some sorts. This is to serve as an explanation as to why campus politics non-participation runs rampant.\n\nFirst we have to be reminded of four terms in economics. These are, namely: 1) Time preference; 2) Ordinal preference rankings; 3) Utility maximization; and 4) The production possibility frontier.\n\nWe aim to use these models to describe the behavior of the student, and to explain the workings of the incentive structures that exist. I believe these terms will be important in gaining better insights as to what is actually happening.\n\nFeel free to skip this part if you are familiar with the concepts already. This just serves as a brief non-technical overview. Here, I try inasmuch as I can to not bog down the readers with the boring parts. I will dive right into the gist of the concept.\n\nLet us say that you were such a good child that your parents are willing to give you Php 100,000.00 (USD 2,000). There are no strings attached. The only thing they ask is whether you want it now, or five years from now. Let us also say that within that five year time period, prices will not rise, meaning the inflation rate is 0%. The question now is: When will you take the money? Today or five years from now? Most of you will probably answer now.\n\nTime preference tell us that individuals will, majority of the time, choose now than later. This is because individuals seek to satisfy the not-yet satisfied wants of right-now with the available resources that are curently possessed; The more resources now, the better. Taking the money later means that the individual has forgone satisfying his or her wants now for later. The individual would then have to find another source for satisfying the now-wants. This means that there is an added cost for the individual: Look for that other source that he or she can use in order to satisfy those now-wants.\n\nThis is not to say that some people will choose later. It may be the case that some individuals will choose later for some reason. However, a reason to get the money now would be to satisfy further wants in the mental backlog. Another would be to put it in the bank and earn money from it. More often than not, you gain more from taking that money now than later.\n\nTime preference serves as the time component in the decision-making process of an individual. It serves as a supplement and an important insight in understanding ordinal preferences and utility maximization.\n\nOrdinal preferences can be taken literally, roughly “numbered preferences.” We have a set of preferences (or wants) that we seek to satisfy and we psychologically rank them accordingly. The higher rank ones are the ones an individual seeks to satisfy now, while those lower rank ones are those that the individual either: 1) Will want to satisfy in the future; or 2) Seek to satisfy now but are relatively not as important as the higher ranked ones.\n\nDuring my midterms, the following was probably my ordinal preference rankings:\n\nFinishing the project, which was ranked (1), was more important than studying for the midterm exams, which was ranked (2), because I only had to review a bit for the midterms — I could divest less amount of time and resources for (2) relative to (1). However, (2) was relatively still more difficult than (3), so I spent more time studying for and working on (2) rather than (3). The same pattern of logic would apply for the remaining ordinal preferences.\n\nAgain, individuals seek to satisfy the not-yet satisfied wants of right-now. Utility maximization just means that individuals try inasmuch as they can to “get the most bang for their buck.” In every action an individual partakes in, he or she incurs a cost (studying could have been done instead of partying, using Php 150.00 to buy new shorts could have been used instead of buying a two-piece Chickenjoy Meal in Jollibee, et al.). Individuals seek to obtain a psychic gain (Dr. Murray N. Rothbard’s term, see Man, Economy, and State) over costs. Given that, at any time, we as individuals only possess scarce amounts of time and resources, we then rationally seek to maximize the returns we get using said time and resources.\n\nSay that we have the following set of ordinal rankings for lunch:\n\nIf an individual only has Php 180.00 at hand, he or she cannot satisfy (1) and (2), the top two wants. But in order to get the “most bang for the buck,” will choose (3) over (4). It is true that (4) could have been chosen, but since more utility or psychic gain could be obtained from choosing (3), then (3) will be chosen over (4).\n\nLet us now have a quick look at the Production Possibilities Frontier, or the PPF for short. We are going to have to look at a graph here, but do not be terrified. The idea is quite simple.\n\nThe PFF shows the possible combinations that an individual can act on. A dot relatively nearer to consumption means that an individual tends to consume rather than invest, and vice versa.\n\nSay, for example, that apples are in the y-axis and oranges in the x-axis, where the maximum apples was at 10 while the maximum oranges were at 15. You cannot consume all at the same time. The curve above represents the different possible combinations of apples and oranges you can possess/consume that will yield the same amount of utility, “happiness,” or “satisfaction.”\n\nIn the graph above, we have different implications for consumption and investment. If the dot is nearer to the investment side, then an individual has forgone relatively plenty of consumption opportunities in order to invest in the future. For example, you decide not to eat lunch outside today. This act saves you X amounts of money to be used either for future meals or for savings to be spent in the future. However, if an individual tends to consume more, then he or she leaves him- or herself with less opportunities in the future. If you consume all of your lunch money, you get satisfied in the immediate run, but get left without the possibility of more money in the future.\n\nThere is a reason why the turnout over the years has been progressively declining; It is not the fault of anyone in particular either. Students should not demonize or castigate other students for “being apathetic” or for “being lazy” with non-participation. Here I argue that it is just what they are incentivized to do, and there is nothing wrong with that.\n\nFor instance, in a survey conducted by the Ateneo Constitutional Convention (ADMU ConCon), more than half of the respondents were not satisfied with the elections. That should tell you a lot already. Although a majority of them acknowledge the value of Sanggu, non-participation is still high.\n\nThere are exceptions to the things I will be outlining. Not every student fits into the mold. Individuals are still unique in their own special way. However, incentives may drive a portion of a group of individuals into acting on or doing something when incentives present themselves.\n\nAny student in a university would want to mainly achieve these three ends: 1) Pass classes; 2) Graduate; and 3) Take further studies or get a good job after. In order to achieve 3), 2) has to be achieved, and in order to achieve 2), 1) has to be achieved. From these three things, a student’s main goal is to then allocate his or her scarce time and resources properly to achieve these ends.\n\nLet us first recall the PPF from above. For our purposes, we replace consumption with ‘leisure time’ and investment with ‘study/work time.’ The former can be categorized as activities that do not aid in achieving the goals mentioned, while the latter aids in achieving those goals. Binge watching Game of Thrones, assuming it is not part of a school requirement, is part of the former, while reading The Sparrow by Mary Doria Russell (good book; I highly recommend) for Philosophy 103: Philosophy of Religion can be considered part of the latter.\n\nThe more a student allocates time and resources toward leisure time, the less time and resources exists in the future for studying or working. However, the more a student allocates time and resources for doing school work, the more available time there is for future leisure time. If you finish all of your school work during the school week, that leaves you with a lot of free time on the weekend to do whatever you want to do. Some decide to study or review more, catch up on some sleep, binge watch, et al. The crux of the matter is that this extra opportunity would not have existed if you had no prior investment in doing school work first. However, that is the ideal student, and if you are like me and everyone else, you tend to take a combination of both leisure time and study/work time over the course of the entire week.\n\nIn maximizing utility, the optimal allocation of time and resources currently possessed will be done. To “get the most bang for the buck,” any combination of leisure and studying will be done during the course of the week. This combination is relative to the student.\n\nOrdinal preferences step into the picture in disaggregating leisure and study/work. If more time and resources are allocated in doing school work, the student will choose which work goes first or which subject should be studied or reviewed first. The same goes for leisure time. This is again relative to the student.\n\nThe functions of a student government can be summarized into three things: 1) Represent the student population to the administration; 2) Cater to student needs by providing services; and 3) Protect student rights.\n\nThe problem with the first function is the power that the student and student organizations already have. Home organizations tend to be more connected to home departments, and in some cases, the deans of the colleges themselves. If a student wanted proper representation, like the delivery of grievances or concerns to the higher-ups, either the department responds or caters to it immeidately because it is hands-on, or the home organization does it for the student. There is also email now, which is quite helpful on our part as most professors regularly check their emails (shoutout to Ateneo professors who respond faster in email than on social media). Sanggu does step in to the picture, but in terms of who better to approach, the more connected home organization or student, in my belief, is far more effective in doing so. If the home department is hands on, then all the better in reducing the role of both Sanggu and the home organization.\n\nThe same sort of theme can be applied for the second function. Student organizations are more specialized in what they do than Sanggu. For instance, do you really approach Sanggu for math tutors, or do you approach the Ateneo Mathematics Society? Do you go to Sanggu to get better at writing through workshops, or do you approach either Ateneo Heights or WriterSkill ? These alone diminish the role of the student-service-providing function of Sanggu. This does not discount, however, that there may be some roles Sanggu can still play, like allocating subsidies for thesis projects. However, in my (and a lot of other students’) experience, a student can directly approach the home department chair and have it relayed up to the college dean. More often than not, thesis advisers themselves are the ones that guide and advise their students on where and how to get funding. There are tons of other examples, but it would take a long time to enumerate them all.\n\nThe last point, which is protecting student rights, is an important one. Incompetent and inherently rebellious professors tend to violate these rights. I recall of one case in which a professor included attendance in class as part of the grading system, when according to the Magna Carta of Undergraduate Student Rights (check page 79 of the .pdf file), is not supposed to be the case. However, these cases are either: 1) Rare; or 2) Easily handled. A student can easily complain to the home organization to be relayed upward, or go straight to the home department to complain these types of events. Or to be more straight about it, tell the professor that he or she is in violation of the Magna Carta. Professors in Ateneo are regularly briefed about the Magna Carta, and violations incurred merits a penalty to be delivered by the department chair, or even by higher-ups in the administration. Professors are also incentivized not to violate the Magna Carta because of job security (tenured professors are a different story).\n\nThe incentive structures tell us that it is perfectly rational for non-participation to occur. Why? Costs incurred.\n\nBeing an informed voter can be costly. Investing time knowing the candidates, their plans/platform points, their backstories to dig up on their credibility and genuineness, and so forth means a cost is incurred not just in the actual effort exerted in researching, but also in knowing that you could have done something else.\n\nA student has other things in his or her mind during the course of the semester. Is being informed of the candidates, and knowing the ins and outs of campus politics, be a priority for such a student? What do the ordinal preferences tell us? How much remaining time and resources does a student have after doing school work and having fun with friends? Does investing in campus politics merit a psychic gain? For the student who seeks to maximize his or her utility by satisfying the immediate not-yet satisfied wants given currently possessed resources, where does being an informed voter and participating in the political process enter?\n\nIn asking these questions, while looking at the economic models and tools we have discussed and applying them to our scenario, I believe it is perfectly rational for a student not to participate in campus politics. Given the scarce time and resource a student has at any given time, he or she would have to use them wisely in the limited amount of time he or she has in the university. Passing classes and eventually graduating and landing that dream graduate school or job are important too. What is immediately going on in your head during hell weeks, midterms, or finals?\n\nGiven what has been discussed so far, I think the question should not be why students do not participate in campus politics. I believe it is totally rational for a non-Sanggu aspiring student to not care about campus politics. Merely dismissing them as “apathetic” or “lazy” is not taking into consideration other factors that have been discussed. Non-participation is not born out of genuine disinterest, but rather born out of the incentives that point them generally in the direction of non-participation.\n\nWhat is the better question to ask? I believe the better question to ask is the following: 1) What can then be the proper function of the Sanggunian?; and 2) Do we even need the Sanggunian in the first place?\n\nI offer no answer to these questions. In part, because I do not know the answer to them, while the other is I honestly have no incentive to answer these questions as I am graduating.\n\nOn a parting note, I leave it up to the reader to decide what the answer to these questions are. This is not the first time they have been asked. Good luck."
    },
    {
        "url": "https://medium.com/@jsphbtst/politicians-on-minimum-wage-231ec78ae144?source=user_profile---------15----------------",
        "title": "Politicians on Minimum Wage? – Joseph J. Bautista –",
        "text": "This was made last year August 6, 2016; Originally posted in my WordPress here. Before I’ve been vacillating over the ultra-ultra minimal State (thanks to my awesome friend and soon-to-be Dr. Tate Fegley of George Mason University) and anarchism (thanks to Dr. Robert Higgs of the Independent Institute’s talk at Mises University 2013 here). Although I recently have been believing that the State cannot be tolerated, so I am much more of an anarchist now.\n\n‘Put the politicians on minimum wage and watch how fast things change.’\n\nIn analyzing this quote, one might think that the set of consequences inevitably leads to politicians acting better. However, I contend, that only holds under a constitutionally restricted nightwatchman State with a free market. How so?\n\nIn a free market, cronyism would theoretically not be able to exist. This is because the State is only left to its role of enforcing contracts, protecting private property, and securing the life and liberty of individuals. In this Nozickean nightwatchman state scenario, corporate lobbyists and special interest groups that try to bribe politicians into passing or voting for legislation such as minimum wage increases, more regulations on competition, and other forms of barriers to entry in the market are a waste of time. The State in this scenario is incorruptible to these individuals seeking to undermine competition to maximize their potential gains.\n\nIf the State is not limited to the nightwatchman roles, then putting politicians on minimum wage would not change anything. This incentivizes individuals who want to game the system, as was mentioned before, into giving compensation to politicians if they pass legislation X to achieve result Z. Further compensation may even be made if these politicians vote in accordance with the vested interests of these individuals who seek to gain more through unfair means. Imagine the amount of incentive given to politicians because their pay is low and in comes people with money to pay them to vote in a certain manner. In this scenario, as with the common rhetoric nowadays, ‘corporations’ and ‘big businesses’ control the legislative process. However, this only happens because both businesses and the politicians are incentivized to do so.\n\nThe realities are even more frightening when we look into our modern day political systems. It does not matter whether you live in the Philippines where the supposed narcopoliticians and plunderers of public funds run rampant, or whether in the United States of America where organizations like the American Legislative Exchange Council and big corporations game the system. Allowing the corruptibility of the State and not allowing free market competition to do its job inevitably fails us despite this noble policy of putting our politicians on minimum wage.\n\nWhat we can do instead is to remove these barriers to entry and free the market — allow smaller businesses to compete against bigger corporations. Increasing the suppliers in the market spreads out and diminishes market shares thereby lowering prices. Lowering corporate taxes and not imposing high minimum wages allows smaller businesses to thrive and survive in the market, thereby allowing them to freely and flexibly increase their wages as productivity and profitability improve over time. This happens when these businesses provide excellent services to the customer base (Note that businesses also have to hunt for the best people in the labor market who can do the job). This can be done by attracting individuals in the labor market with proper compensation such as high wages, benefits, excellent working hours, and many others. Higher income taxes will neither help businesses or employ people.\n\nThe path toward mixing a nightwatchman State (a constitutional republic with explicit limits to power of every branch of government as envisioned by America’s founding fathers perhaps?) with free market competition where private property is protected and contracts are properly enforced all through the strict implementation of the rule of law would lead to more prosperity. In this manner, we actually disincentivize using political capital as a means to gain power. Instead, we incentivize entrepreneurship, listening to the wants and demands of the consumers; Providing it to them all the while competing against other individuals or group of individuals who want to do the same."
    },
    {
        "url": "https://medium.com/@jsphbtst/my-high-school-self-was-skeptical-of-power-4e3dfd83adcf?source=user_profile---------16----------------",
        "title": "My High School Self Was Skeptical of Power – Joseph J. Bautista –",
        "text": "The root of what transformed me into someone who advocates the ideas emanating from the tradition of classical liberalism was skepticism toward power. As Lord Acton said, “power tends to corrupt, and absolute power corrupts absolutely. Great men are almost always bad men.” What better way to see this in action than the displays of power tripping that I saw in high school.\n\nMy school was a bit conservative, and I believe this stems from what I perceived as the demonization of liberal practices, especially those with regard to his or her own body. I recall vividly how some of my classes negatively portray drinking alcohol, smoking tobacco and marijuana, and many others. It was portrayed as something that was nothing short of a path toward self-destruction, which to my mind, was nothing more than a value-judgement being passed on to us.\n\nThere was that time during my junior year in high school when some batchmates got caught drinking in school. My peers and I were around 15–16 years old at the time, so we were below the allowed age for drinking. This happened at some school function in the evening — I forgot which.\n\nNeither could I not have cared less what they were injecting in their bodies (even if it were cow piss) nor the necessary steps the school took to punish them for breaking school policy. However, what ticked me off was what an instructor did during one of the lectures. I was classmates with some of them, and the way this instructor conducted the lecture was just sickening. There were the obvious potshots and snarky remarks implicitly aimed at the students who got caught. It was through these actions that a lot of students got curious, and eventually word got out. Power tripping at its finest, because the instructor knew that the students could not fight back. Those students were in enough shame already.\n\nThat was one instance out of many coming from school administrators. Then there are cases coming from student leaders themselves.\n\nI was a member of the Senior Scouts of the Philippines chapter in my school. Although I had the option of being a leader, I opted not to be one since: 1) I was genuinely not interested and; 2) I already had another leadership role I was putting my heart into (I was the team captain of the track and field team). Despite being improved to the rank of Eagle Scout, the highest possible rank in the scouting movement, I was still comfortable not being a leader within our chapter.\n\nNow if you were not part of the leadership, you should not dare do anything that upsets them, because that would merit you loads of push-ups or other forms of non-violent physical penalties. There are also cases when leaders will find a different reason to punish you (ex., he was annoyed at a remark you made, but since these are not proper grounds for punishment, he will find a different rationale). This was a gut feeling of mine as I never got anyone from the leadership to admit it. However, my suspicion has always been that when the majority of us non-leaders do not share the rationale of the punishment by the leader, then something must be up. Sucks to be at the bottom of the power chain.\n\nGiving any one individual or group of individuals a lot of power and control over another individual or group of individuals is dangerous. I noticed this earlier on, and continue to keep this truth close to my heart to this very day. But then again, as I have said during the 31st EDSA Revolution Anniversary, the powers that be are only as powerful as we allow them to be."
    }
]