[
    {
        "url": "https://medium.com/singular-distillation/too-many-toolmakers-7cfe1eec4bee?source=tag_archive---------0----------------", 
        "text": "The current dilemma of data science is this: too many people are making tools and not enough are making solutions.\n\nAs an example, imagine if you had people making screwdrivers, but nobody making cars. Or how about everybody making hammers, but nobody making houses. Everybody needs cars & houses, not everybody needs screwdrivers and hammers. [1] So why does the data science community seem to think otherwise?\n\nI love the multitudes of new resources, frameworks, and cloud services. I really really do. You can rent GPUs from Amazon for 60 cents an hour to quickly train complex neural networks. You can pick from dozens of libraries to train neural networks. If I had to write my own networks from scratch, I don’t think I’d have a life outside of Kaggle competitions.\n\nI remember first learning about machine learning two years ago and being mystified by deep learning. It all looked like black magic, if only because there were no easy tutorials for it. I still recall the late nights I spent throwing together matrix multiplications in NumPy that carried out the correct operations to do neural networks.\n\nThe reason I handwrote this all was because of the lack of resources. There were very few libraries around, and those that existed were frankly terrible or abstract to the point of being useless to learn from. There was no Keras, no Tensorflow. Caffe was, and remains, difficult to configure. [2] So, as a reflection of my general stubbornness to learn frameworks, I rolled my own. I wrote my own algorithms and functions in NumPy and SciPy. It didn’t run that well to be honest, but it was enough as a proof-of-concept for myself.\n\nNow there’s tons of libraries and support to use. Many people probably only have a passing knowledge of the underlying algorithms. All you need, as far as coding is concerned, is to call “.fit” and then “.predict” in Scikit-Learn. Frameworks like Keras have wrappers for Scikit-Learn, so even with cutting edge neural networks its easy. [3] This is of course a gross simplication, one should know the guts of whats happening, but most can likely convince themselves they’re pros.\n\nThis isn’t even to mention the various services around. Google Predict, Amazon’s competitor, Microsoft Azure, IBM Watson, the list goes on. Even stranger are how similar they all are. Sure, we can mince details to figure out the differences between them, but they all do basically the same thing. With neural networks, they allow one to specify layers, inputs, and how everything connects. With other types of algorithms, you specify your model with a few parameters. Then you train or fit it to some target values. [4] As cool as this all is, what’s the point? To play Go?\n\nI joke somewhat, because I firmly believe in the deepest of hearts that Machine Learning will be a big deal. But I don’t think these companies are approaching it right. They all want to be platforms, but with nobody building anything useful there’s a limited need for this technology right now. Keep in mind that while DOS was the cash cow for Microsoft early on, Commodore, Amstrad, & Acorn were all competitors trying to be platforms too. It took Visicalc (which I wrote about in a past post) to really push the need of computers to everybody. And Visicalc was on every platform. If you ask me, they were the real winners of the early PC era.\n\nWe need solutions so for the love of God, stop building platforms nobody ever uses.\n\n[1] I guess its debatable whether or not everybody doesn’t need screwdrivers. In my opinion, many people probably feel they don’t.\n\n[2] I don’t like Caffe. If you do, that’s your opinion and I respect it. I know many people who do wondrous things with it. I’m just not one of them.\n\n[3] Setup is really difficult with deep learning I find. Its exceedingly difficult especially for the uninitiated and impossible on Windows.\n\n[4] Unless its unsupervised, which is a bit different. I’m just covering myself here.", 
        "title": "Too many Toolmakers – Singular Distillation –"
    }, 
    {
        "url": "https://medium.com/@jwesly/quiz-bowl-reflections-3c58846ae318?source=tag_archive---------1----------------", 
        "text": "The first lines of Dover Beach have always moved me. Each time I read it, I’m standing right next to Matthew Arnold on the cliffs at night, watching the waves of chance crash upon the sands of life. Each time, the turbid ebb and flow of the ocean reminds me of the futility of temporary mortal endeavors in light of the cruel infinity of the Universe. Each time, I take a cold, hard look at my activities, my accomplishments, my goals, and my passions and attempt to justify my existence.\n\nFor most of my life, my justification came through learning. At the age of 6, I’d read Children’s Encyclopedias from cover to cover. Over the years, I moved on to atlases and reference books covering topics such as science, geography, and war. I didn’t have an end goal at the beginning, but that changed when a new club was founded at my high school.\n\nAt the first quiz bowl meeting, I was one of 50 new members. I remember banging on tables to buzz in. By the second and third meeting, as the club thinned to 10 or so players, I became a force with my buzzer. From Julius Caesar to Uncle Tom’s Cabin, my vast reading list was finally being useful.\n\nAlthough I was a good player at school, nothing prepared me for the competition at my first quiz bowl tournament. I still remember the sense of helplessness I felt as my team got pummeled by MAST A and their lead scorer Reuben.\n\nUnfortunately, that loss was only the beginning. Even as MCA built an A team, we got blown out by teams such as St. Joes, BCA, and Livingston. There was simply so much we didn’t know — from the writings of Kafka and Borges to the operas of Puccini and Verdi. It seemed that know matter how much we knew, the great teams knew more. And so we lost — sometimes coming up just short (Bloomfield 2014) and sometimes getting upset by teams even we were better than. We told each other to study and specialize, but in typical Academy fashion, those attempts came at the midnight before the next tournament.\n\nLosing a game sucks. But losing game after game, tournament after tournament, year after year — it burns. Prolonged losing causes doubts about whether the losses are really caused by lack of preparation or are instead the signs that you don’t have the intelligence necessary to succeed.\n\nThe summer before senior year, I set out to change all that. I made quizlets and memorized lists of works and their creators. Finally, I felt that I had the knowledge to win. A Team went in to Princeton with high expectations, but once again fell short of playoffs.\n\nThe doubts became more pronounced. After all that memorization, I had still not been able to get over the hump. As I sat in silent thought, I once again read my favorite poem.\n\nThe sea is calm tonight. I’d been able to buzz on Dover Beach not because I knew who wrote it, but because I knew what the lines meant.\n\nAnd so I went down a list of poets, reading the words they chose to represent their inner thoughts. I discovered William Blake for his poems other than “The Tyger” and gained an appreciation for urban life in England at his time(check out his poem “London”). I wandered as lonely as a cloud with Wordsworth, and read the odes of Shelley and Keats. After a few tries, I started to appreciate the heavy symbolism of Yeats. I learned more about Longfellow and Whittier, and for the first time understood how radical Whitman’s free verse was in comparison. After observing the shift to free verse, I marveled at Frost’s mastery of the ancient art of rhyme and how he applied it to subjects in 20th century New England. I read my first poem by ee cummings, which instantly became my second favorite poem (read “anyone lived in a pretty how town”). I relived the struggle of the African-American community for equality and human dignity through the poems of Maya Angelou and Langston Hughes. Although I fear some of the genius was lost in translation, I gained respect for foreign poets like Jose Marti and Pablo Neruda.\n\nWe came in 5th place at our next tournament, beating High Tech A, one of the best teams in the region, in an upset win. MCA had finally arrived. I didn’t do it alone of course — none of it would have been possible without Anthony becoming an expert in US History and on Jane Eyre, Shree reading plot summaries of random books and TV shows, and Pratik continuing to stay informed on current events and Lebanese-Americans. I captioned our victory photo with “Winning isn’t everything, it’s the only thing” — but that wasn’t true. Winning was great, but knowing is even greater.\n\nI spent 3 years of my life on Quiz Bowl. I spent hours on Wikipedia studying. Was it worth it? What did I even get out of it? The short answer is that I learned a bunch of stuff. But the true answer is that that knowledge gave me at least a basic understanding of the human condition. From Alexander the Great to Tchaikovsky, the great men and women of history have also stood on the cliffs of Dover, attempting to justify their existence. While the multitudes worked away their sorrows, some put their feelings into songs and words. While millions were in intellectual darkness, some risked their lives to expose the truth about the solar system and the world around us. Some tried to rule and improve the lives of the people, while others tried to rule the entire world. And yet others described the forces that compelled these people — the Spirit of the age that drives men to greatness.\n\nIt’s been a good 3 years. But as senior year comes to an end, my search for meaning must stretch beyond Quiz Bowl. I’m sorry to my teammates for not being able to compete in HSNCT, but I want them to know I will be there in spirit. To all those who are interested in Quiz Bowl, I have this message for you: it’s not easy to win here. You won’t walk in, make up some bs, and walk out with an award. It takes work to win — months of preparation and studying. It’ll be easier for you guys because of all the work we’ve already put in — but that doesn’t mean it’s easy. What I can promise is that if you stick with it, you will gain an appreciation for humanity and our greatest achievements.", 
        "title": "Quiz Bowl: Reflections – Jabez Wesly –"
    }, 
    {
        "url": "https://medium.com/@tamilarasi2897/introduction-to-computer-networks-dd5ea4bebafc?source=tag_archive---------2----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "INTRODUCTION TO COMPUTER NETWORKS: – Tamilarasi Rajasekar –"
    }
]