[
    {
        "url": "https://medium.com/apprendimento-automatico/la-creazione-di-un-degno-avversario-405ed96f9c6c?source=tag_archive---------0----------------", 
        "text": "Di recente si è parlato molto di macchine intelligenti. Lo scorso dicembre ha suscitato parecchio clamore la nascita di un laboratorio non-profit sul deep learning sostenuto, con un investimento multimiliardario, da Elon Musk e altri magnati statunitensi. In questi giorni —proprio nella settimana in cui è scomparso a 88 anni il pioniere dell’intelligenza artificiale (AI, artificial intelligence) Marvin Minsky — è invece arrivato il primo grande successo di Google DeepMind nel solving del plurimillenario gioco del Go, ritenuto il più difficile da affrontare tra quelli classici. Queste notizie hanno portato sui quotidiani storie di inarrestabili ricerche finalizzate alla creazione di macchine che affiancheranno l’uomo in compiti sempre più difficili, per aiutarlo. Macchine che molto probabilmente arriveranno al punto di poter competere con, e superare, la specie creatrice su molti aspetti rilevanti —pensate, per esempio, alle auto che si guidano da sole.\n\nPer rilassarci un po’ e non pensare a prospettive distopiche — a la Skynet — parliamo di macchine che giocano contro avversari umani. Subito ci vengono in mente le prodezze scacchistiche di DeepBlue, oppure lo sfoggio di una raffinata e precisa cultura generale di Watson (ancora oggi cavallo di battaglia dell’AI di IBM) nella sfida contro i campioni di Jeopardy! Ma non ci siamo fermati qui, perché qualche giorno fa la versione distribuita di AlphaGo di DeepMind ha battuto Fan Hui, il campione di Go europeo, per 5 giochi a 0. Nel mondo del Go è stata la prima vittoria di un programma contro un giocatore professionista, senza handicap, su un goban standard (19x19).\n\nNel caso di un gioco come il Go, risolverlo significa creare un programma in grado di battere sistematicamente un avversario umano, adesso questo programma (quasi certamente) esiste. Esso effettua i suoi “ragionamenti” attraverso una tecnologia — le reti neurali — che fino a non molti anni fa veniva irrisa, perché considerata troppo inefficiente, da buona parte dei ricercatori (vi rimando a questo articolo sulla nascita del deep learning per approfondire). AlphaGo arriva dal laboratorio londinese DeepMind recentemente acquisito da Google, specializzato nelle reti neurali deep per il reinforcement learning. Per la sfida contro Fan Hui è stata usata una versione distribuita del programma, che ha girato su 1202 CPU e 176 GPU (i chip principali delle schede video) sia per il training che per la partita.\n\nDi deep reinforcement learning ne abbiamo già sentito parlare lo scorso anno. Nelle applicazioni che DeepMind ci ha mostrato, l’input è rappresentato da sequenze di frame di videogiochi, mentre l’output consiste nei movimenti di un joystick virtuale in un sistema Atari 8-bit (per esempio quello in questo popolare filmato). I movimenti e le decisioni, attraverso un modello adattivo ispirato alla psicologia comportamentale fatto di esplorazioni e ricompense, migliorano continuamente fino ad arrivare a un livello super-umano. In questo caso stiamo parlando di videogiochi “essenziali”, quindi il contesto è ultra-semplificato, comunque i risultati ottenuti sono davvero sorprendenti.\n\nPer affrontare il gioco del Go invece è stato seguito un approccio ibrido innovativo, combinando le tecniche più tradizionali di supervised learning (così è chiamato l’apprendimento automatico attraverso esempi) per il training con sessioni storiche di gioco di esperti, con il reinforcement learning attraverso partite simulate. Non vado oltre con i dettagli tecnici — in verità mi ero già fermato — gli interessati possono approfondire l’argomento leggendo il nuovo paper su AlphaGo di David Silver (et al.) pubblicato sulla rivista Nature. Lì si trovano riferimenti alle diverse tecniche e agli algoritmi usati (per esempio l’ormai assodato Monte Carlo tree search) e all’ingegnosa struttura del modello, composto da due reti neurali deep (policy network e value network) per la selezione e la valutazione delle mosse. Il sistema fa in modo che AlphaGo alla fine dell’elaborazione scelga ogni volta la mossa successiva che nelle simulazioni risulta migliore.\n\nGo resta un gioco ostico per le macchine, AlphaGo ha però una serie di vantaggi rispetto agli avversari a base carbonio. Gli esseri umani hanno parecchie debolezze. Si stancano dopo un po’ di tempo. Inoltre anche i migliori professionisti in un certo ambito possono commettere gravi errori, spesso legati a questioni di precisione e attenzione, che commettono proprio perché essi non sono macchine. Le macchine invece non hanno di questi problemi, soprattutto quelle che non hanno bisogno di essere programmate in modo tradizionale.\n\nIl limite più grande degli umani in questo gioco è legato al numero di esempi di partite che sono in grado di “processare”; quante partite di Go può giocare un essere umano nella sua intera esistenza? AlphaGo può processare milioni di partite in una sola giornata, apprendendo qualcosa da ognuno di questi esempi. Il Go per un umano è un gioco molto intuitivo. Spesso anche giocatori esperti effettuano mosse senza attuare un particolare ragionamento, e senza essere in grado di spiegare precisamente il motivo di certe scelte. Le prossime sfide del team di DeepMind suonano come uno scontro tra l’intuizione umana e una sorta di intuizione artificiale, fondata sulla precisione computazionale unita al rigore statistico delle macchine create dall’uomo stesso.\n\nIn marzo si apprestano a incontrare in Seul il più grande giocatore del mondo Lee Sedol (9 dan), che ha accettato la sfida con AlphaGo. Al gruppo di Demis Hassabis restano meno di due mesi per migliorare e addestrare un campione.", 
        "title": "La creazione di un degno avversario – Apprendimento Automatico –"
    }, 
    {
        "url": "https://medium.com/@kidzik/deepart-io-sells-art-by-creative-machines-painted-on-canvas-843a63f01cbb?source=tag_archive---------1----------------", 
        "text": "DeepArt.io joins forces with the inventors of the famous neural algorithm for artistic style transfer and announces high-quality high-resolultion canvas prints for sale.\n\nTübingen, Germany. Starting today, the first DeepArt ever printed on canvas is on auction on eBay. DeepArt.io is the first web service that allows people from all over the world to render their photos in the style of famous paintings. Inspired by the human brain, the method is among the top 10 most influential scientific results in 2015 according to Altmetric. Now, the company overcame one of the major technical limitations: low resolution. They can now render images at high resolution — sufficient to print on a large canvas.\n\nOne of the major limitations in the past has been that the generated images were too small to be printed even on a postcard. “Virtually everybody asked me if I couldn’t generate a higher-resolution image for them,” says Leon Gatys, the lead author on the paper describing the algorithm and co-founder of DeepArt, the startup company now running the website.\n\nThe team has now found a way to overcome these limitations and render artworks at much higher resolution — sufficient to print on canvas at a size of 50 by 50 cm. In the future users will be able to buy those canvas prints on the website. Each artwork is unique in several ways: Only the creator knows the original content and style, each image is sold only once, and each canvas is uniquely numbered. The first piece, DeepArt #1, can be purchased by auction on eBay.", 
        "title": "DeepArt.io sells art by creative machines painted on canvas"
    }, 
    {
        "url": "https://medium.com/@joeferns13/big-data-analytics-trends-you-should-lookout-for-in-2016-6f739adc0fb8?source=tag_archive---------2----------------", 
        "text": "Big Data and Analytics has come a long way since the time it was introduced and is now an integral part of many Business organizations. Industries have adopted Big Data Analytics as a core part of their overall business strategy.\n\nThis infographic on Big Data and Analytics trends highlights the key trends that you should lookout for in 2016. There will be an increase in demand for real time analytics and end users will be able to handle analytics in self-service mode.", 
        "title": "Big Data & Analytics Trends You Should Lookout For in 2016!"
    }
]