[
    {
        "url": "https://towardsdatascience.com/how-to-set-up-a-deep-learning-environment-on-aws-with-keras-theano-b0f39e3d861c?source=tag_archive---------0----------------", 
        "text": "Updated: 05/19/2017 — In this article, I’ll explain step by step how to set up a deep learning environment running on Amazon’s EC2 GPU instance using:\n\nDownload CUDA 8.0 first e.g. to your $HOME folder (/home/ubuntu):\n\nCheck if everything was installed correctly:\n\nNext, register an account on NVIDIA’s Accelerated Computing Developer Program and download cuDNN 5.0 to your local machine:\n\nSCP the TAR archive file to the EC2 GPU instance:\n\nSSH into the EC2 GPU instance and untar the file:\n\nFinally, open the .bashrc and then add this:\n\nDownload Anaconda on the EC2 instance and install it:\n\nNote: Reload your bash profile (source .bashrc) so that Anaconda is activated.\n\nNote: Make sure that Theano is used as backend in Keras. If not you need to change it in the Keras configuration (.keras/keras.json) which is usually created after the first import in python.\n\nNow you are good to go! Normally, I tend to test my environment with a simple script to see if everything works as expected.\n\nHere is a simple MLP network which is used to train the MNIST dataset:\n\nRun the script by invoking this command:\n\nAlternatively, you could have specified the settings in the theano configuration file (.theanorc):\n\nNote: The flag “nvcc.flags=-D_FORCE_INLINES” is very important for Ubuntu 16.04 since CUDA 8.0 does not seem to support the default gcc version (5.4.0) (see Ubuntu 16.04 and CUDA and Fix for glibc 2.23). This is a tricky hack for now. Alternatively, you could also link CUDA to an older gcc version by using the update-alternatives (see here).\n\nEventually, here is the output:\n\nNote: It is also interesting to monitor NVIDIA’s system management interface to see if there are some activities e.g. memory usage, running processes and GPU utilization.\n\nIn this blog post, I described step by step how to set up a deep learning environment on AWS. Contact me via twitter @datitran if something is unclear or just follow me. In the next article, I will focus on how to automate those steps explained above by using docker and therefore immensely speed up the setup process.", 
        "title": "How to Set Up a Deep Learning Environment on AWS with Keras/Theano"
    }, 
    {
        "url": "https://blog.grakn.ai/advent-at-grakn-labs-22nd-december-2016-aff91db08b98?source=tag_archive---------1----------------", 
        "text": "We covered Deep Learning in the #GraknLovesTech blog earlier this month, but today we are looking at Machine Learning. Impacting everything from game playing and online advertising to brain/machine interfaces and medical diagnosis, machine learning explores the construction of algorithms that can learn from and make predictions on data. Rather than following strict program guidelines, machine learning systems build a model based on examples and then make predictions and decisions based on data.\n\nSo first things first, we often hear people ask what the difference is between Deep Learning and Machine Learning. So we have gathered a few resources that might help answer that question.\n\nNVidia put out a nice blog post for those wanting a clear explanation of the difference between machine learning and deep learning earlier this year:\n\nSpeaking of cats and deep learning, Peter Norvig also has a video explaining how they did it at Google. (Editorial Note: Also because our founder is a huge fan, especially since meeting him in the flesh at the AI conference in NYC earlier this year).\n\nOur friends at KDNuggets also published a guide:\n\nAndrew Ng’s “Machine Learning” MOOC on Coursera is one of the most popular of their entire corpus. Professor Ng published an interesting article earlier this year about what Artificial Intelligence can and cannot do right now in 2016.\n\nIncreased accessibility of ML to the wider community\n\nWhat we noticed about Machine Learning this year, is that it is not so much about massive breakthroughs but rather it was about making it more accessible to more developers and non-specialists.\n\nIn November 2016, Amazon announced the launch of its new Amazon AI platform, to deliver the machine learning that Amazon has developed in-house to a broader developer community. For now, the service only makes three different tools available, but the plan is to add more over time.\n\nEarlier in the year, a partnership on AI was signed by Amazon, DeepMind, Google, Facebook, IBM and Microsoft, to advance public understanding of AI, support best practices and develop an open platform for discussion and engagement.\n\nWe are looking forward to 2017, to see what it generates.", 
        "title": "Advent at Grakn Labs: Machine Learning –"
    }, 
    {
        "url": "https://medium.com/@mslavescu/what-happens-next-in-artificial-intelligence-1deb818b2d6c?source=tag_archive---------2----------------", 
        "text": "We will use more and more Deep Learning to help us find more and more patterns in the ever growing data that surrounds us.\n\nI wouldn’t call this intelligence, but more like “effective and easy to use tools” for thinking automation.\n\nWhat Deep Learning tools should do is enable us to easily find and extract patterns and accelerate our understanding of complex systems (organic and nonorganic).\n\nWhat some people may not realize is that the tools that simplify our life must be the ones that should make us smarter.\n\nWe live in a world with more and more data pushed through our eyes and ears, most of it I call it noise and sometimes fake.\n\nIt is harder and harder to find relevant and useful data, as it is covered by this extra unnecessary data.\n\nThe same tools that helps us filter the data are used to generate the noise.\n\nSo Artificial Intelligence is not actually Deep Learning, but what we could build using the outcome of deep learning.\n\nSoftware based intelligent agents (programs) that help us navigate the sea of data and find ground that we could build upon, I see it as next step towards Artificial Intelligence.\n\nLet the machines learn from us as we learned from our parents as kids, and not only learn but also evolve.\n\nTo evolve we need more then smart pattern matching techniques, we need dynamic and adaptive reasoning and that needs new ways of thinking and also easy ways to transfer knowledge.\n\nOf course we can make robots, specifically Self Driving Cars, learn how to drive on certain roads using Deep Learning, but unless we look at how we (humans) really do it and replicate that behaviour, we will not have a safe method.\n\nWe actually filter and simplify data a lot, and now even faster and more then ever.\n\nOur (brain) computing power did not increase much, but our speed to reduce noise did.\n\nLets figure out ways to reduce noise, using Artificial Intelligence tools, in all aspects of our life, and increase our power to learn faster and better.\n\nTo play with and understand all of these I invite you to join us in the Open Source Self Driving Car (OSSDC) Initiative:\n\nWhere we use both robotics and intelligent systems to achieve safe autonomy.\n\nSelf Driving Car will be the first autonomous robot deployed at global scale with some kind of Artificial Intelligence, as everyone will be affected then everyone should participate and contribute in defining it.\n\nFollow my journey in robotics and self driving cars on Twitter @gtarobotics", 
        "title": "What happens next in Artificial Intelligence – Marius Slavescu –"
    }, 
    {
        "url": "https://chatbotslife.com/evidence-of-skynets-rise-2016-12-22-ff75fe5c19fc?source=tag_archive---------3----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "Evidence of Skynet’s Rise, 2016–12–22 –"
    }, 
    {
        "url": "https://medium.com/linomari/un-programmatore-su-tre-verr%C3%A0-sostituito-dallintelligenza-artificiale-46ec82ae4877?source=tag_archive---------4----------------", 
        "text": "Molto presto i computer non verranno più programmati come oggi, dove sviluppatori creano programmi per specifici compiti. Il prossimo passo sarà quello di addestrarli a risolvere problemi specifici.\n\nPer esempio per insegnare ad una rete neurale artificiale a riconoscere un cane basta mostrargli migliaia di immagini di cani. Il processo continua finché il sistema non sarà in grado di individuare un cane in tutti i contesti.\n\nQuesti sistemi sono già ampiamente utilizzati in applicazioni che utilizziamo tutti i giorni. Facebook utilizza questi sistemi per riconoscere le storie sulla vostra timeline o per riconoscere immagini da censurare o per riconoscere le facce dei vostri amici. Anche Microsoft utilizza questi sistemi per tradurre in tempo reale i discorsi su Skype in diverse lingue. Lo stesso approccio è utilizzato nelle automobili che si guidano da sole come le Tesla che imparano a guidare giorno per giorno migliorando in base all’esperienza.\n\nCon le machine learning, l’ingegnere o lo sviluppatore non sa esattamente come il computer svolga i propri compiti. Le operazioni della rete neurale sono in gran parte oscure come in una black box. Quando si analizza una machine learning non si vedono righe di codice ma una vastità di calcoli matematici.\n\nPresto non serviranno programmatori come li conosciamo oggi ma ci saranno figure professionali diverse. Tim O’Reilly sostiene che ci sarà bisogno di programmatori ancora per lungo tempo, ma ad un certo punto il numero scenderà in modo sensibile perché si occuperanno delle architetture che sovraintendono le machine learning più che di programmi specifici.", 
        "title": "Un programmatore su tre verrà sostituito dall’Intelligenza Artificiale"
    }, 
    {
        "url": "https://medium.com/@linguooapp/el-mundo-en-3d-de-google-una-gran-escuela-para-la-ia-global-ed39c997072d?source=tag_archive---------5----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "El Mundo En 3D De Google: Una Gran Escuela Para La IA Global"
    }
]