[
    {
        "url": "https://medium.com/emergent-future/how-will-apps-benefit-from-deep-learning-and-ai-9d5554f13a87?source=tag_archive---------0----------------", 
        "text": "Deep learning and AI enable us to solve certain kinds of problems that would otherwise take an unreasonably long time to work out using other techniques.\n\nToday the typical app experience resembles filling out a stack of form sheets. The app developer’s job is to mould user input into some sort of data structure and this is an incentive to be as unambiguous as possible in conveying what the app expects the user to do. Collecting unstructured data (i.e. data that does not fit the mould) is considered a waste by the developer and the user may be left guessing why their data is being collected even though they are receiving no clear benefit from it. However, deep learning and AI excel at solving problems that involve unstructured data such as freeform text, audio, images, and video. Collecting large amounts of unstructured data actually makes it easier to solve a problem using these methods.\n\nWhat will be the catalyst that will imbue “all serious applications” with deep learning and AI? Several services and frameworks currently offer AI algorithm sandboxes but none of them promote AI enabled user experience stories. This leaves a void between UX design and data science. An innovator in this space could start, for example, with contemplating how Apple’s Human Interface Guidelines (the HIG) could be revised to reflect deep learning and AI enabled design patterns. Bot enabled platforms will have an advantage as they encourage freeform user input by design.\n\nToday a small number of apps collect the bulk of unstructured user data and are often reluctant to share it. Sharing of user data with other apps is a double edged sword: on one hand the user experience is improved from better understanding of the user and on the other hand the user might feel uncomfortable with what is shared and who has access to their data.", 
        "title": "How will apps benefit from deep learning and AI? – Emergent // Future –"
    }
]