[
    {
        "url": "https://medium.com/mmc-writes/artificial-intelligence-in-the-uk-landscape-and-learnings-from-226-startups-70b9551f3e4c?source=tag_archive---------0----------------", 
        "text": "Given the ‘cold start’ challenge, the reality is that most consumers will first experience machine learning via the world’s most popular consumer applications — Facebook, Google, Amazon, Netflix, Pinterest and others — that leverage vast data sets and machine learning teams to deliver facial recognition, search and entertainment recommendations, translation capabilities and more.\n\nA ‘cold start’ challenge around data is inhibiting the number of new B2C AI companies. Training machine learning algorithms usually requires large volumes of data. While B2B companies can analyse the varied and extensive data sets of the businesses they serve, in the absence of public or permissioned (e.g. Facebook profile) data, customer-facing companies usually begin without large volumes of consumer data to analyse. Typically, therefore, they deploy machine learning over time as their user bases and data sets grow. Gousto, for example, is an MMC portfolio company that delivers recipes and associated ingredients to consumers for them to cook at home. Today, Gousto’s team of machine learning PhDs, data analysts and engineers leverage AI for warehouse automation and menu design. Since its inception Gousto has had a vision for the use of AI, but the Company has achieved its vision over time.\n\nTo whom are AI companies selling? Nine out of 10 AI companies are predominantly ‘B2B ’, developing and selling solutions to other businesses (Figure 3, below). Just one in 10 sells directly to consumers (‘ B2C ’).\n\nMost early stage UK AI companies — five in every six — are applying machine learning to challenges in specific business functions or sectors (Figure 2, below). Reflecting the nascent stage of the field, however, one in six is developing an AI technology  — a capability, platform or set of algorithms — applicable across multiple domains. These companies’ activities range from the development of computer vision solutions to the creation of algorithms for autonomous decision-making.\n\nAfter analysing the market and meeting with 40 companies in recent weeks, we highlight the following six dynamics in the market:\n\nWe’ll update our map regularly. We apologise if we’ve omitted or mis-classified your company; we’re aware that many early stage companies may be using, but not presenting, extensive AI. Please get in touch with additions or corrections.\n\nWe’ve researched 226 early stage AI companies in the UK and met with 40 of them. We’ve developed a map (Figure 1, above) to place the 226 according to their:\n\nOver time, we expect the distinction between ‘AI’ companies and other software providers to blur and then disappear, as machine learning is employed to tackle a wide variety of business processes and sectors. Today, however, it is possible to point to a sub-set of early stage software companies defined by their focus on AI .\n\nThe sectors above are well suited to the application of AI, explaining the concentration of AI activity within them. The opportunity for value creation within each segment is demonstrable as well as significant. In marketing and in finance, for example, improvements in campaign conversion and financial performance against a benchmark are readily quantifiable. All offer numerous prediction and optimisation challenges well suited to the application of machine learning. All offer large data sets for training and deployment. A path to better-than-human performance is technically achievable. The alternatives are impractical or expensive. And all are specialised verticals, distant from the competitive threat posed by the consumer- and horizontal focus of the AI platform providers Google, Amazon, Microsoft and IBM — with the exception of healthcare where Google and IBM both enable and challenge.\n\nAs attractive market fundamentals catalyse activity, the strongest AI companies can develop a competitive moat by: bringing deep domain expertise to bear in a complex domain; developing proprietary algorithms; creating a network effect around data by leveraging non-public data sets; and by securing adequate capital to build a high quality machine learning team and go-to-market resources.\n\nActivity in Marketing & Advertising dominates; one in five early stage UK AI companies target this function. The fundamentals of modern marketing and advertising represent a sweet-spot for AI. Consumers have billions of touch points with websites and apps, providing a rich seam of available, but complex, data. Further, almost every stage of the marketing and advertising value chain is ripe for optimisation and automation — including content processing, consumer segmentation, consumer targeting, programmatic advertising optimisation, purchase discovery for consumers and analysis of consumer sentiment.\n\nIn a number of areas, activity appears modest relative to market opportunities. In the Manufacturing sector, for example, there are few startups to address a substantial need. Machine learning has the potential to unlock 20% more production capacity through predictive, optimised maintenance of machines. Raw material costs and re-working can be reduced through improved analysis of product quality data. Further, ‘buffering’ — storing raw materials and part-developed products to compensate for unforeseen inefficiencies during production — can be reduced by up to 30% given more predictable production capacity. The proliferation of sensors in the manufacturing industry, including sensor data from the production line, machine tool parameters and environmental data, has also increased significantly the data available for machine learning.\n\nWithin the Compliance & Fraud function, there appear few startups capitalising on banks’ ballooning expenditure on compliance. 30,000 people in Citi — 12% of the Bank’s workforce — now work in compliance. In its 1Q15 conference call, Citi highlighted that over 50% of the $3.4B it saved through efficiency initiatives was being consumed by additional investments in regulation and compliance. The dynamics are similar among Citi’s peers. JP Morgan increased compliance spend 50% between 2011 and 2015, to $9B, while Goldman Sachs highlighted that its 11% increase in headcount in the last four years has largely been to meet regulatory compliance needs. Our discussions with banks highlight particular focus on ‘Know Your Customer’ (KYC) and Anti- Money Laundering (AML) initiatives. Beyond presenting an extensive need, the sector offers large data sets for training, expensive human alternatives and, in some areas at least, an evident ability for machine learning to deliver better-than-human performance given the pragmatic impossibility of humans monitoring the data deluge. There may be few UK compliance companies given in-house efforts by the banks, concern regarding potential client concentration, or competition from US startups — but opportunities appear considerable.\n\nThe number of AI companies founded annually in the UK (Figure 5, below) has doubled in recent years (2014–2016) compared with the prior period (2011–2013). Over 60% of all UK AI companies were founded in the last 36 months. During this period, a new AI company has been founded in the UK on almost a weekly basis.\n\nEntrepreneurship in AI is being fuelled by the broader coming of age of AI as well as factors specific to early stage entrepreneurship.\n\nRegarding AI activity generally, seeds planted during the last 20 years of AI research are bearing fruit today. New algorithms, particularly convolutional and recurrent neural networks, are delivering more effective results. A logarithmic increase in the availability of training data has made it possible to tune machine learning algorithms to deliver accurate predictions. Development of graphical processing units (GPUs) has decreased the time required to train a neural network by 5x-10x. And a six-fold increase in public awareness of AI during the last five years has increased buyers’ interest in the technology.\n\nAdditional factors are fuelling an increase in new AI startups. Venture capital funding of AI companies has increased seven-fold in five years as investors see promise in the sector. The provision of AI infrastructure and services from industry cloud providers (Google, Amazon, Microsoft and IBM) is reducing the difficulty and cost of deploying machine learning solutions. And the growth of open source AI software — particularly TensorFlow, a library of components for machine learning — has reduced barriers to involvement. Subject to continued venture capital funding, we expect high levels of AI entrepreneurship in the UK to continue.\n\nWhere are new AI companies focusing? The HR business function and Finance sector have the highest proportion of new AI companies (Figure 6, below). Two thirds of AI HR and Finance companies are less than two years old.\n\nRecent activity in HR stems from a paradigm shift taking place within the function. HR is evolving from an administrative system of record to a predictive driver of growth and efficiency. Business owners are seeking to leverage previously under-utilised data sets to drive utility — ranging from competency-based recruitment to predictive modelling of employee churn.\n\nIt is unsurprising that in the business intelligence, security and compliance functions, and in the retail and infrastructure sectors, the proportion of new AI companies is lower. With large data sets ripe for machine learning, these sectors were the first to attract AI entrepreneurs.\n\nThe UK AI sector is at a nascent stage in its development relative to global peers, presenting both opportunities and challenges.\n\nToday, three quarters of UK AI companies are at the earliest stages of their journey, with ‘seed’ or ‘angel’ funding, compared with half of US peers (Figure 7, below). At the other end of the spectrum, just one in 10 UK AI companies is in the late, ‘growth capital’ stage compared with one in five in the US. In 2015, the last full year for which data are available, almost all capital infusions into UK AI companies were at the angel, seed or Series A stage — while among global AI peers a third received later-stage funding (Figure 8, below).", 
        "title": "Artificial Intelligence in the UK: Landscape and learnings from 226 startups"
    }, 
    {
        "url": "https://medium.com/@sanparithmarukatat/deep-learning-67d82eaffc0d?source=tag_archive---------1----------------", 
        "text": "One clap, two clap, three clap, forty?\n\nBy clapping more or less, you can signal to us which stories really stand out.", 
        "title": "Deep Learning – Sanparith Marukatat –"
    }, 
    {
        "url": "https://medium.com/@dilgreen/i-am-neither-arguing-against-the-viability-of-game-theoretic-approaches-nor-am-i-making-a-narrower-600a5b5c40c5?source=tag_archive---------2----------------", 
        "text": "I am neither arguing against the viability of game-theoretic approaches, nor am I making a narrower argument about the difference between humans and machines; using a human example as a quick way of introducing an obviously complex scenario in my original comment was not clear enough.\n\nI am suggesting that game-theoretic approaches only apply well to scenarios with well-defined ‘optimal’ outcomes — like games, where we can see either a zero-sum outcome or an arithmetic maximisation outcome as clearly desirable, but that applying them to scenarios where outcome quality cannot be so easily measured is worrisome.\n\nAt present, AI is still building out capacity in the region of such scenarios as: ‘Is this a cat?’, ‘What will happen next?’, ‘Should I raise, stick or fold?’. Game theory makes sense in all these situations, and many more.\n\nHowever, just beyond these scenarios lie others which have formally complex descriptions of optimal outcomes — but which we would definitely like to have AI help us with. And my concern is that, in our excitement about the new power that AI appears to be giving us, we might convince ourselves that, because game-theoretic approaches are working well for AI so far, that we should apply such approaches to these complex scenarios.\n\nTo take a simple example, I am often standing at a street intersection, observing that traffic in both directions, as well as pedestrians, are facing red lights, and that this situation persists for ten seconds or so — far longer than is needed for a safety interval. Or that traffic and pedestrians are waiting while the system shows a green light for a street with no vehicles. Massive inefficiency — leading to the obvious question; ‘if AI is so good these days, how come no-one has conquered the market with a system that maximises traffic throughput?’. Given the enormous economic disbenefits of traffic delays, this would surely be something to address?\n\nBut what to optimise? Immediately, we are in the realm of politics and externalities. What is the balance between vehicle traffic, pedestrian ease of movement, emissions minimisation, local vs through traffic, bus or cycle prioritisation? What is the value of a human life when we assess throughput against likely fatality outcomes?\n\nThis is what I mean by a formally complex scenario (there are technical definitions). They occur when deciding about what optimal looks like involves many feedback loops and ‘it depends…’ conditions, and where there are many links to wider systems. There is no mathematically modelable optimum that does not allow for changing answers to these questions, and for the fact that changes in one are likely to result in changes to others. Even scenarios as everyday as this are likely to exhibit the ‘sensitivity to initial conditions’ characteristic of chaos theory.\n\nNevertheless, the current approach to design of traffic control systems is to treat them as almost completely an engineering problem — but one where we use humans to do the optimisation, however inefficiently and haphazardly they do it. Humans use heuristics (explicit and implicit) and crudely simplified rules, as well as the political muscle built in to the systems of command and implementation that demand traffic control solutions, to produce results that are generally bearable, if not obviously great.\n\nSo the temptation might be to apply an engineering approach to build an AI traffic control designer -to ‘cut the Gordian knot’ of inherent complexity in the scenario by using a game-theoretic approach. Build a complicated (but not formally complex) optimisation metric that we decide is ‘good enough’ (we can improve it later — iteratively; parameterise it to allow for variety in traffic laws/whatever — we are sophisticated, after all), and crash on through to a solution.\n\nA ‘technical’ solution. Because after all, it’s a technical problem, isn’t it?\n\nDon’t get me wrong — I think that we should attempt this. The current approach is obviously awful, and has enormous negative consequences. It is not hard to believe that improvements could be made (putting driverless cars to one side for the sake of the argument).\n\nBut it illustrates my concern exactly. We would be crudely simplifying an inherently complex situation in order to be able to use a game-theoretic optimisation approach, hoping to achieve designs that would be an improvement over human engineers.\n\nAs I said in the original comment, when presented with a ‘good enough’ computer solution to a problem, people tend to simply stop thinking about the problem and move on. Assuming that the AI-designed traffic control systems were better than human-designed ones, the AI community could celebrate a success, and move forward to larger challenges with seemingly similar characteristics — complex, but with a largely technical aspect to them.\n\nThis is where it gets dangerous. Even respected climate scientists can be heard talking about climate change as ‘a technical problem’. This is utter nonsense. Our era has been called the ‘Anthropocene’ — the era when human culture affects the deep geology of the planet, in ways that will be measurable millions of years from now. Which means that Climate Change is just as much a political and cultural issue as it is a physics and chemistry issue. Meaning that the individual and mass psychology of 7 billion and more humans are implicated, along with all the other stuff.\n\nClimate Change is a problem of the whole biosphere — interacting with everything else on the planet —from 40 miles up to 40 miles down. It is the epitome of a formally complex system; we know of nothing more complex smaller than the Universe itself.\n\nBut we desperately need better approaches, and in a hurry, and we have a human problem, too; we are terrible at complexity. So of course, we are going to be looking to AI to help, hoping that our computing prowess can help us dig ourselves out of the mess.\n\nAt this point, though, we need to remember the limits to game-theoretical approaches. If we attempt to apply such approaches to optimising the biosphere, we are likely to do very poorly — and here, we are unlikely to be able to iteratively improve.\n\nHere’s a little diagram that attempts to illustrate the landscape of problem space for AI approaches. The green area portentously labelled ‘Zone of Hubris’ is the location of the type of problems where I consider that overly simplified outcome meaure approaches might look tempting as a way to allow ‘progress’, but where great risk lies.", 
        "title": "I am neither arguing against the viability of game-theoretic approaches, nor am I making a narrower…"
    }
]