[
    {
        "url": "https://aiinvestor.com/ai-winners-portfolio-methodology-6fe51e4f697d?source=tag_archive---------0----------------", 
        "text": "The AI Winners Portfolio tracks the publicly traded stocks of companies that are leaders in embracing advanced AI technologies. We use an objective model to identify specific trends in AI technology development and adoption across companies, and rebalance our portfolio quarterly based on data collected over the period.\n\nAI technologies have long been promised as the path to smarter computer systems, more closely mimicking how humans understand knowledge and make decisions. Past waves of AI technologies have been unsuccessful in delivering results outside of very narrow fields of expertise, and consequently, AI has historically been seen as a failed technology.\n\nThis time is different. Foundational advances in computer processing speeds and fast memory storage, coupled with vastly larger data sets that are used to teach the AIs, are now all aligned to drive dramatic improvements in the ways that computers reason. Computational challenges that only recently were forecast as a decade or more away, are falling almost daily to this new wave of AI and the companies that are scaling it.\n\nTo forecast the winners in this AI arms race, we have identified two different company personas: The AI Builders and the AI Scalers. Our portfolio assigns a 50% share of investments to both of these categories.\n\nDespite the extreme noise about AI, the core science of modeling the brain in code falls to just a handful of organizations. These companies are selling the pickaxes during the gold rush. Google, Facebook, Amazon, Microsoft, and IBM are the public companies that are building the core algorithms on which other companies will scale solutions. They are joined by several private companies and universities. Each of these organizations has released core components of their AI into the open source community and is fighting a battle for developer hearts and minds. For these players, the game is to lock up as much of the developer community as possible on your platform. The more developers who embrace your algorithm, the more companies that will build solutions on top of it. Solutions bring users, and users bring revenues.\n\nFortunately, activities in the open source community are — open. And they are concentrated on several key developer portals: Github for code management and sharing. And StackOverflow for Q&A. We have created a methodology of tracking activities on these sites and use the underlying data to create the AI Builders portion of the AI Winners portfolio.\n\nA casual tour through Github will reveal that 15 million software developers “Watch”, “Star”, and “Fork” 38 million open source software projects. When a developer “Forks” a project, it means they create a new personal copy of the project, upon which they can edit, redirect or expand the effort. Because AI Builder algorithms have been released into the open source community, their number of Forks is a leading indicator for the number of projects, developers, and companies that are embracing the technology. We trend Forks over time to compare companies against each other, and use the data as one of the factors from which we calculate our portfolio distribution.\n\nIn this gold rush, the AI Scalers are the miners. The AI Scalers are all about using core AI technologies (from the AI Builders) to create new offerings and drastically improve their products and services. Theoretically, any public company could turn up on our list of AI Scalers. However, only a small minority have given any indication that they are focused on AI yet. How do we know who these early adopters are? We can track their behaviors by looking at several key public data sets.\n\nBy tracking the roles that public companies are hiring for, we can ascertain if they are recruiting talent that understands the AI Builder technologies. You might be surprised to learn that Siemens is hiring more deep learning specialists than almost any other company this year. Or that Monsanto is hiring more AI experts than AIG, Citigroup and Liberty Mutual combined.\n\nWe run a daily scan of job postings and track and trend the information related to AI technologies. The results are used to determine which companies are embracing AI and to what degree, and are fed into our quarterly rebalancing of the AI Winners portfolio.\n\nWe are currently assign a 50% weighting to the AI Builders companies, and 50% to the AI Scalers companies.", 
        "title": "AI Winners Portfolio Methodology –"
    }
]