[
    {
        "url": "https://medium.com/@navsha/learn-deep-learning-the-hard-way-e5d844f9fbc1?source=tag_archive---------0----------------", 
        "text": "There are so many articles about learning Deep Learning but still I decided to write one more. The reason is I find many of those articles saying the same thing over and over again. The same set of online courses and the same set of books. I think there is a need for a new guide for learning DL for people who are already well-versed with traditional ML.\n\nDeep Learning is as much science as it is art. It’s increasingly looking like the most promising candidate among a set of different techniques for solving Artificial Intelligence one day. I’ve met and spoken to a lot of people recently who believe doing deep learning is pretty easy, you only need an open source library like TensorFlow, Theano etc. and decent data at your disposal, and you are all set. Trust me, it’s not true.\n\nComing from a science background before venturing into the world of ML first as an engineer and then as a founder I think one should seriously dive very deep into a field to appreciate the low level details before building models in a hackish way. This method is OK for a small personal project but not good if you want to be a good researcher in the field one day or if you have plans of building a great product for the real world.\n\nWe at Artifacia broadly classify all of AI into Visual Understanding and Language Understanding. This is not exactly the best approach in the world but it helps us organise and execute our projects pretty efficiently. Much of our work is applied in nature with a small part of it being basic and long term in nature such as Project Turing and Project Button. We expect to publish some of our ongoing work sometime next year.\n\nEven though my cofounder and CTO Vivek primarily looks after technology and research at Artifacia I continue to spend 20% of my time with the research team to be able to do the right kind of mapping between our technology and product, and between our product and business. Moreover, I like speaking to them and continue my learning of an area I believe will impact every industry similar in scale to the Internet and the Personal Computer before that.\n\nThe following is the list of essential read for anyone who really wants to learn the fundamentals of Deep Learning :\n\n1) This is going to be an evolving post and I’ll keep updating it. The latest update included second and third papers.\n\n2) I’ve also taken inputs from Vivek@Artifacia, who specialises in visual understanding, and Rajarshee@Artifacia, who specialises in language understanding, to compile this list of essential papers.\n\n3) The title of this post is inspired by a popular book series by Zed Shaw. His book Learn Python the Hard Way remains one of the most recommended books for people starting with Python or programming in general.\n\n4) If you’ve already read most of these papers and understood all of it, you should really consider applying to Artifacia!", 
        "title": "Learn Deep Learning the Hard Way – NavSha –"
    }, 
    {
        "url": "https://medium.com/@vervaak/definition-of-artificial-intelligence-188ff4c67c87?source=tag_archive---------1----------------", 
        "text": "In biology, whether life is present is determined based on seven criteria (included at the end of this post). So, I am curious is there a set of criteria for determining whether a system has intelligence? Such a list might be useful when thinking about artificial intelligence.\n\nHere is a set of criteria that I came up with.\n\nA system has intelligence if it:\n\nCriterion three is interesting because it alludes to the notion that an algorithm, which can be debugged, is not a form of intelligence. Maybe, an algorithm is analogous to wisdom, something that can be passed on to another person.\n\nThe seven criteria for determining whether something is a life form:", 
        "title": "3 Criteria of Intelligence – Sijung Lai –"
    }, 
    {
        "url": "https://insights.untapt.com/deep-learning-study-group-session-1-perceptrons-and-sigmoid-neurons-9fb590cecf0a?source=tag_archive---------2----------------", 
        "text": "Last week, untapt hosted the inaugural session of a study group bent on mastering Deep Learning.\n\nIt proved far more popular than we anticipated, first necessitating splitting the session over two evenings and later capping the group size.\n\nThank you to Ed Donner, untapt’s neural network-obsessed CEO (pictured above), who offered up our office space to the group, and who kindly provided nourishment and refreshments for hungry minds.\n\nIn addition, many thanks to the fifty-five Deep Learners who attended and contributed on both Wednesday and Thursday evening. I learned a lot from the in-depth discussions around the textbook exercises that we worked through, and am excited for our next session.\n\nAs detailed in our GitHub repository, we covered the theory of:\n\nUsing Yann LeCun’s classic MNIST data set, we also worked through straightforward tutorials to classify digits with varying degrees of accuracy:\n\nFrom a theoretical perspective, we aim to eventually complete Nielsen’s neural network textbook and Goodfellow et al.’s forthcoming Deep Learning tome, filling in with the requisite mathematical, statistical and computer science foundational concepts where necessary. Simultaneously, we’ll be combining our broad mix of technical backgrounds to develop novel deep networks.\n\nAt present, we’d like to keep the study group size intimate and conversational. We are, however, ideating on future, alternative formats that could accommodate larger numbers. Please email me (jon@untapt.com) if you’re interested in the latter.", 
        "title": "Deep Learning Study Group Session #1: Perceptrons and Sigmoid Neurons"
    }, 
    {
        "url": "https://medium.com/@simons.brenna/artificial-intelligence-to-be-a-powerful-healthcare-tool-660032a6c988?source=tag_archive---------3----------------", 
        "text": "One of Microsoft’s top researchers is predicting that the medical field is about to experience a revolution. That revolution is going to be brought about by machine learning. Machine learning is a branch of artificial intelligence that involves programming computers to analyze vast amounts of data, recognize patterns, and “learn” in a sense. While it’s already being used in limited ways in the health care industry, it’s about to become a major player.\n\nUses for AI in health care\n\nOver the years, humans have collected vast amounts of data about various forms of cancer. Thanks to machine learning, we can input all of that information into a computer and it can analyze the hundreds of thousands of scans and train itself to detect cancer much more accurately than even trained doctors can. Already, healthcare professionals are using AI technologies to diagnose and even predict illness. It can also be used to make personalized recommendations for patients regarding the best way to go about treating various illnesses.\n\nNot only are such technologies more accurate than humans, they can perform the task much more efficiently than humans and they can detect illness much earlier which often results in more effective treatment and a better prognosis.\n\nFor now, the uses of AI in the medical field is more limited but expect to see it become a lot more common place as the technology advances. Perhaps your next scan will be read by a computer instead of a doctor.\n\nArtificial Intelligence News brought to you by artificialbrilliance.com", 
        "title": "Artificial Intelligence To Be A Powerful Healthcare Tool"
    }
]