[
    {
        "url": "https://medium.com/@atveit/tutorial-using-deeplearningkit-with-ios-for-iphone-and-ipad-de727679bae4?source=tag_archive---------0----------------", 
        "text": "4. Have a look at ViewController.swift — notice that import DeepLearningKitForiOS gives an error (in red)\n\n5. Open Finder and Drag DeepLearningForiOS.xcodeproj over to the demo app in xcode\n\n6. Highlighted line below shows how the framework DeepLearningForiOS.xcodeproj can be included\n\n7. Click on app settings (highlighted line in left part of Xcode) and go the General tab on the right\n\n8. Scroll down to embedded binaries in General tab and add DeepLearningKitforiOS.frameworkiOS\n\n9. Result afterwards should look something like this — embedded binaries down to the right\n\n10. Drag the Shaders.metal file from DeepLearningKitForiOS into top project\n\n11. Connect iPhone to your Mac (e.g. iPhone 6S), compile and run, should get something like this", 
        "title": "Tutorial — Using DeepLearningKit with iOS for iPhone and iPad"
    }, 
    {
        "url": "https://medium.com/@atveit/announcing-deeplearningkit-open-source-deep-learning-framework-for-apple-s-ios-os-x-and-tvos-be656a90d763?source=tag_archive---------1----------------", 
        "text": "Happy to announce that a (early) version of DeepLearningKit is available on:\n\n0. What does DeepLearningKit do?\n\nIt currently allows using deep convolutional neural networks model trained in Caffe on Apple’s iOS, OS X and tvOS (transformed from protobuffers into json with the tool athttps://github.com/DeepLearningKit/caffemodel2json — a tutorial about this will come later).\n\n2. How to get started?\n\nHave a look at Tutorial — Using DeepLearningKit with iOS for iPhone and iPad — it is about using a pre-trained CIFAR-10 Network in Network example.\n\n3. What is DeepLearningKit developed in?\n\nIt is developed in Metal (for GPU Acceleration) and Swift (for app integration). I believe DeepLearningKit is the first (public) Deep Learning tool that is using the Metal compute API for GPUs (Metal is Apple’s recommended way to program GPUs)\n\nMore tutorials and a paper describing DeepLearningKit will be made available on http://deeplearningkit.org (+ http://arxiv.org for the paper)\n\n5. I love developing for Apple’s [iOS,OS X or tvOS] and would like to contribute to this project, how?\n\nHere are a few thoughts:\n\n6. Is DeepLearningKit production ready for my mission critical app?\n\nmost likely not, but that doesn’t stop you from testing it out?\n\n7. DeepLearningKit reminds me more about CUDA/GPU Libraries such as Nvidia’s cuDNN or Facebook’s fbCunn rather than larger tools such as Torch, TensorFlow and Caffe, is that right?\n\nYou’re right, DeepLearningKit can be roughly seen as an early “metalDNN” with Swift packaging for loading and running models. (It currently doesn’t support Fast Fourier based convolution such as Facebook’s fbcunn)\n\nDeepLearningKit was developed and opensourced by the company Memkite — check out the About page for details", 
        "title": "Announcing DeepLearningKit — Open Source Deep Learning Framework for Apple’s iOS, OS X and tvOS"
    }
]